{
  "collectionId": "shamail",
  "bookId": 7,
  "bookName": "7Kuhl Of Rasoolullah باب ما جاء في كُحل رسول الله صلى الله عليه وسلم",
  "hadithCount": 5,
  "hadiths": [
    {
      "hadithNumber": 50,
      "english": {
        "narrated": "Ibn 'Abbas reported that the Prophet said (Allah bless him and give him peace):",
        "hadith": "\"Color the edges of the eyelids with antimony [ithmid], for it clears the vision and makes the eyelashes grow!” He also maintained that the Prophet (Allah bless him and give him peace) had a kohl jar from which he used to apply kohl to his eyelashes every night, three times in this [eye],and three times in that.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ الرَّازِيُّ، قَالَ‏:‏ حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ، عَنْ عَبَّادِ بْنِ مَنْصُورٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم، قَالَ‏:‏ اكْتَحِلُوا بِالإِثْمِدِ، فَإِنَّهُ يَجْلُو الْبَصَرَ، وَيُنْبِتُ الشَّعْرَ وَزَعَمَ أَنَّ النَّبِيَّ صلى الله عليه وسلم، كَانَتْ لَهُ مُكْحُلَةٌ يَكْتَحِلُ مِنْهَا كُلَّ لَيْلَةٍ، ثَلاثَةً فِي هَذِهِ، وَثَلاثَةً فِي هَذِهِ‏.‏",
        "grade": ""
      },
      "collectionId": "shamail",
      "bookId": 7,
      "bookName": "7Kuhl Of Rasoolullah باب ما جاء في كُحل رسول الله صلى الله عليه وسلم",
      "bookReference": 50
    },
    {
      "hadithNumber": 51,
      "english": {
        "narrated": "Ibn 'Abbas said:",
        "hadith": "“Allah’s Messenger (Allah bless him and give him peace) used to color the edges of his eyelids with antimony before going to sleep, three times in each eye.\nYazid ibn Harun also said in his tradition: “The Prophet (Allah bless him and give him peace) had a kohl jar from which he used to apply kohl to his eyelashes before going to sleep, three times in each eye.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا عَبْدُ اللهِ بْنُ الصَّبَّاحِ الْهَاشِمِيُّ الْبَصْرِيُّ، قَالَ‏:‏ حَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُوسَى، قَالَ‏:‏ حَدَّثَنَا إِسْرَائِيلُ، عَنْ عَبَّادِ بْنِ مَنْصُورٍ ‏(‏ح‏)‏ وَحَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ‏:‏ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، قَالَ‏:‏ حَدَّثَنَا عَبَّادُ بْنُ مَنْصُورٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ‏:‏ كَانَّ رَسُولُ اللهِ صلى الله عليه وسلم يَكْتَحِلُ قَبْلَ أَنْ يَنَامَ بِالإِثْمِدِ، ثَلاثًا فِي كُلِّ عَيْنٍ، وَقَالَ يَزِيدُ بْنُ هَارُونَ، فِي حَدِيثِهِ‏:‏ إِنَّ النَّبِيَّ صلى الله عليه وسلم، كَانَتْ لَهُ مُكْحُلَةٌ يَكْتَحِلُ مِنْهَا عِنْدَ النَّوْمِ، ثَلاثًا فِي كُلِّ عَيْنٍ‏.‏",
        "grade": ""
      },
      "collectionId": "shamail",
      "bookId": 7,
      "bookName": "7Kuhl Of Rasoolullah باب ما جاء في كُحل رسول الله صلى الله عليه وسلم",
      "bookReference": 51
    },
    {
      "hadithNumber": 52,
      "english": {
        "narrated": "Jabir (i.e. Ibn Abdillah) said:",
        "hadith": "\"Allah’s Messenger said (Allah bless him and give him peace): “You must apply antimony before going to sleep, for it clears the vision and makes the eyelashes grow.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ يَزِيدَ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ هُوَ ابْنُ عَبْدِ اللهِ، قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ عَلَيْكُمْ بِالإِثْمِدِ عِنْدَ النَّوْمِ، فَإِنَّهُ يَجْلُو الْبَصَرَ، وَيُنْبِتُ الشَّعْرَ‏.‏",
        "grade": ""
      },
      "collectionId": "shamail",
      "bookId": 7,
      "bookName": "7Kuhl Of Rasoolullah باب ما جاء في كُحل رسول الله صلى الله عليه وسلم",
      "bookReference": 52
    },
    {
      "hadithNumber": 53,
      "english": {
        "narrated": "Ibn \"Abbas said:",
        "hadith": "\"Allah’s Messenger said (Allah bless him and give him peace): 'The best of your eye salves is antimony, for it clears the vision and makes the eyelashes grow.'”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ‏:‏ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، عَنْ عَبْدِ اللهِ بْنِ عُثْمَانَ بْنِ خُثَيْمٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ إِنَّ خَيْرَ أَكْحَالِكُمُ الإِثْمِدُ، يَجْلُو الْبَصَرَ، وَيُنْبِتُ الشَّعْرَ‏.‏",
        "grade": ""
      },
      "collectionId": "shamail",
      "bookId": 7,
      "bookName": "7Kuhl Of Rasoolullah باب ما جاء في كُحل رسول الله صلى الله عليه وسلم",
      "bookReference": 53
    },
    {
      "hadithNumber": 54,
      "english": {
        "narrated": "Ibn 'Umar said:",
        "hadith": "\"You must apply antimony, for it clears the vision and makes the eyelashes grow.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُسْتَمِرِّ الْبَصْرِيُّ، قَالَ‏:‏ حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ عُثْمَانَ بْنِ عَبْدِ الْمَلِكِ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ عَلَيْكُمْ بِالإِثْمِدِ، فَإِنَّهُ يَجْلُو الْبَصَرَ، وَيُنْبِتُ الشَّعْرَ‏.‏",
        "grade": ""
      },
      "collectionId": "shamail",
      "bookId": 7,
      "bookName": "7Kuhl Of Rasoolullah باب ما جاء في كُحل رسول الله صلى الله عليه وسلم",
      "bookReference": 54
    }
  ]
}