{
  "collectionId": "shamail",
  "bookId": "51",
  "bookName": "51The Names Of Sayyidina Rasoolullahباب ماجاء في أسماء رسول الله صلى الله عليه وسلم",
  "hadithCount": 2,
  "hadiths": [
    {
      "hadithNumber": "365",
      "bookReference": ": Book 51, Hadith 1",
      "collectionId": "shamail",
      "english": {
        "hadith": "\"Allah’s Messenger said (Allah bless him and give him peace): “Verily I have several names: I am Muhammad; I am Ahmad; I am al-Mahi [the Eraser], with whom Allah erases unbelief; I am al-Hashir [the Gatherer], at whose feet the people will be gathered; and I am al-'Aqib [the Ultimate] (The name al-'Aqib [the Uhimate] means the one after whom there is no Prophet.)",
        "narrated": "Muhammad ibn Jubair ibn Mut'im reported that his father said:",
        "grade": "Sahih (Zubair `Aliza'i)"
      },
      "arabic": {
        "hadith": "عن سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ، وَغَيْرُ وَاحِدٍ، قَالُوا‏:‏ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ، عَنْ أَبِيهِ، قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ إِنَّ لِي أَسْمَاءً، أَنَا مُحَمَّدٌ، وَأَنَا أَحْمَدُ، وَأَنَا الْمَاحِي الَّذِي يَمْحُو اللَّهُ بِيَ الْكُفْرَ، وَأَنَا الْحَاشِرُ الَّذِي يُحْشَرُ النَّاسُ عَلَى قَدَمِي، وَأَنَا الْعَاقِبُ الَّذِي لَيْسَ بَعْدَهُ نَبِيٌّ‏.‏",
        "narrated": "",
        "grade": ""
      },
      "scrapedAt": "2025-07-13T05:47:42.227Z"
    },
    {
      "hadithNumber": "366",
      "bookReference": ": Book 51, Hadith 2",
      "collectionId": "shamail",
      "english": {
        "hadith": "\"I encountered the Prophet (Allah bless him and give him peace) in one of the streets of Medina, and he said: “I am Muhammad; I am Ahmad; I am the Prophet of Mercy and the Prophet of Repentance; I am the Follower [of the earlier Prophets]; I am the Gatherer and the Prophet of the Fierce Battles.”",
        "narrated": "Hudhaifa said:",
        "grade": "Hasan Isnād (Zubair `Aliza'i)"
      },
      "arabic": {
        "hadith": "حَدَّثَنَا مُحَمَّدُ بْنُ طَرِيفٍ الْكُوفِيُّ، قَالَ‏:‏ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، عَنْ عَاصِمٍ، عَنْ أَبِي وَائِلٍ، عَنْ حُذَيْفَةَ، قَالَ‏:‏ لَقِيتُ النَّبِيَّ صلى الله عليه وسلم، فِي بَعْضِ طُرُقِ الْمَدِينَةِ، فَقَالَ‏:‏ أَنَا مُحَمَّدٌ، وَأَنَا أَحْمَدُ، وَأَنَا نَبِيُّ الرَّحْمَةِ، وَنَبِيُّ التَّوْبَةِ، وَأَنَا الْمُقَفَّى، وَأَنَا الْحَاشِرُ، وَنَبِيُّ الْمَلاحِمِ‏.‏\n\nحَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ‏:‏ حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ، قَالَ‏:‏ أَنْبَأَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ عَاصِمٍ، عَنْ زِرٍّ، عَنْ حُذَيْفَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم، نَحْوَهُ بِمَعْنَاهُ، هَكَذَا، قَالَ حَمَّادُ بْنُ سَلَمَةَ، عَنْ عَاصِمٍ، عَنْ زِرٍّ، عَنْ حُذَيْفَةَ‏.‏",
        "narrated": "",
        "grade": ""
      },
      "scrapedAt": "2025-07-13T05:47:42.227Z"
    }
  ],
  "scrapedAt": "2025-07-13T05:47:42.227Z"
}