{
  "collectionId": "bukhari",
  "bookId": 95,
  "bookName": "95Accepting Information Given by a Truthful Personكتاب أخبار الآحاد",
  "hadithCount": 21,
  "hadiths": [
    {
      "hadithNumber": 7246,
      "english": {
        "narrated": "Narrated Malik:",
        "hadith": "We came to the Prophet (ﷺ) and we were young men nearly of equal ages and we stayed with him for \ntwenty nights. Allah's Messenger (ﷺ) was a very kind man and when he realized our longing for our families, \nhe asked us about those whom we had left behind. When we informed him, he said, \"Go back to your \nfamilies and stay with them and teach them (religion) and order them (to do good deeds). The Prophet (ﷺ) \nmentioned things some of which I remembered and some I did not. Then he said, \"Pray as you have \nseen me praying, and when it is the time of prayer, one of you should pronounce the call (Adhan) for \nthe prayer and the eldest of you should lead the prayer. \"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ ارْجِعُوا إِلَى أَهْلِيكُمْ، فَأَقِيمُوا فِيهِمْ، وَعَلِّمُوهُمْ، وَمُرُوهُمْ ـ وَذَكَرَ أَشْيَاءَ أَحْفَظُهَا أَوْ لاَ أَحْفَظُهَا ـ وَصَلُّوا كَمَا رَأَيْتُمُونِي أُصَلِّي، فَإِذَا حَضَرَتِ الصَّلاَةُ فَلْيُؤَذِّنْ لَكُمْ أَحَدُكُمْ، وَلْيَؤُمَّكُمْ أَكْبَرُكُمْ ‏\"",
        "grade": ""
      },
      "collectionId": "bukhari",
      "bookId": 95,
      "bookName": "95Accepting Information Given by a Truthful Personكتاب أخبار الآحاد",
      "bookReference": 7246
    },
    {
      "hadithNumber": 7247,
      "english": {
        "narrated": "Narrated Ibn Mas`ud:",
        "hadith": "Allah's Messenger (ﷺ) said, \"The (call for prayer) Adhan of Bilal should not stop anyone of you from taking \nhis Suhur for he pronounces the Adhan in order that whoever among you is praying the night prayer, \nmay return (to eat his Suhur) and whoever among you is sleeping, may get up, for it is not yet dawn \n(when it is like this).\" (Yahya, the sub-narrator stretched his two index fingers side ways).",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لاَ يَمْنَعَنَّ أَحَدَكُمْ أَذَانُ بِلاَلٍ مِنْ سَحُورِهِ، فَإِنَّهُ يُؤَذِّنُ ـ أَوْ قَالَ يُنَادِي ـ لِيَرْجِعَ قَائِمَكُمْ، وَيُنَبِّهَ نَائِمَكُمْ، وَلَيْسَ الْفَجْرُ أَنْ يَقُولَ هَكَذَا ـ وَجَمَعَ يَحْيَى كَفَّيْهِ ـ حَتَّى يَقُولَ هَكَذَا ‏\"",
        "grade": ""
      },
      "collectionId": "bukhari",
      "bookId": 95,
      "bookName": "95Accepting Information Given by a Truthful Personكتاب أخبار الآحاد",
      "bookReference": 7247
    },
    {
      "hadithNumber": 7248,
      "english": {
        "narrated": "Narrated `Abdullah bin `Umar:",
        "hadith": "The Prophet (ﷺ) said, \"Bilal pronounces the Adhan at night so that you may eat and drink till Ibn Um \nMaktum pronounces the Adhan (for the Fajr prayer).",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنَّ بِلاَلاً يُنَادِي بِلَيْلٍ، فَكُلُوا وَاشْرَبُوا حَتَّى يُنَادِيَ ابْنُ أُمِّ مَكْتُومٍ ‏\"",
        "grade": ""
      },
      "collectionId": "bukhari",
      "bookId": 95,
      "bookName": "95Accepting Information Given by a Truthful Personكتاب أخبار الآحاد",
      "bookReference": 7248
    },
    {
      "hadithNumber": 7249,
      "english": {
        "narrated": "Narrated `Abdullah:",
        "hadith": "The Prophet (ﷺ) led us in Zuhr prayer and prayer five rak`at. Somebody asked him whether the prayer had \nbeen increased.\" He (the Prophet (ﷺ) ) said, \"And what is that?\" They (the people) replied, \"You have \nprayed five rak`at.\" Then the Prophet (ﷺ) offered two prostrations (of Sahu) after he had finished his \nprayer with the Taslim.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ وَمَا ذَاكَ ‏\"",
        "grade": ""
      },
      "collectionId": "bukhari",
      "bookId": 95,
      "bookName": "95Accepting Information Given by a Truthful Personكتاب أخبار الآحاد",
      "bookReference": 7249
    },
    {
      "hadithNumber": 7250,
      "english": {
        "narrated": "Narrated Abu Huraira:",
        "hadith": "Allah's Messenger (ﷺ) finished his prayer after offerings two rak`at only. Dhul-Yaddain asked him whether \nthe prayer had been reduced, or you had forgotten?\" The Prophet (ﷺ) said, \"Is Dhul-Yaddain speaking the \ntruth?\" The people said, \"Yes.\" Then Allah's Messenger (ﷺ) stood up and performed another two rak`at and \nthen finished prayer with Taslim, and then said the Takbir and performed a prostration similar to or \nlonger than his ordinary prostrations; then he raised his head, said Takbir and prostrated and then \nraised his head (Sahu prostrations).",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ أَصَدَقَ ذُو الْيَدَيْنِ ‏\"",
        "grade": ""
      },
      "collectionId": "bukhari",
      "bookId": 95,
      "bookName": "95Accepting Information Given by a Truthful Personكتاب أخبار الآحاد",
      "bookReference": 7250
    },
    {
      "hadithNumber": 7251,
      "english": {
        "narrated": "Narrated `Abdullah bin `Umar:",
        "hadith": "While the people were at Quba offering the morning prayer, suddenly a person came to them saying, \n\"Tonight Divine Inspiration has been revealed to Allah's Messenger (ﷺ) and he has been ordered to face the \nKa`ba (in prayers): therefore you people should face it.\" There faces were towards Sham, so they \nturned their faces towards the Ka`ba (at Mecca).",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا إِسْمَاعِيلُ، حَدَّثَنِي مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ بَيْنَا النَّاسُ بِقُبَاءٍ فِي صَلاَةِ الصُّبْحِ إِذْ جَاءَهُمْ آتٍ فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ أُنْزِلَ عَلَيْهِ اللَّيْلَةَ قُرْآنٌ، وَقَدْ أُمِرَ أَنْ يَسْتَقْبِلَ الْكَعْبَةَ فَاسْتَقْبِلُوهَا‏.‏ وَكَانَتْ وُجُوهُهُمْ إِلَى الشَّأْمِ فَاسْتَدَارُوا إِلَى الْكَعْبَةِ‏.‏",
        "grade": ""
      },
      "collectionId": "bukhari",
      "bookId": 95,
      "bookName": "95Accepting Information Given by a Truthful Personكتاب أخبار الآحاد",
      "bookReference": 7251
    },
    {
      "hadithNumber": 7252,
      "english": {
        "narrated": "Narrated Al-Bara':",
        "hadith": "When Allah's Messenger (ﷺ) arrived at Medina, he prayed facing Jerusalem for sixteen or seventeen months \nbut he wished that he would be ordered to face the Ka`ba. So Allah revealed: -- \n'Verily! We have seen the turning of your face towards the heaven; surely we shall turn you to a \nprayer direction (Qibla) that shall please you.' (2.144) Thus he was directed towards the Ka`ba. A man \nprayed the `Asr prayer with the Prophet (ﷺ) and then went out, and passing by some people from the \nAnsar, he said, \"I testify. that I have prayed with the Prophet (ﷺ) and he (the Prophet) has prayed facing \nthe Ka`ba.\" Thereupon they, who were bowing in the `Asr prayer, turned towards the Ka`ba.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا يَحْيَى، حَدَّثَنَا وَكِيعٌ، عَنْ إِسْرَائِيلَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ، قَالَ لَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ صَلَّى نَحْوَ بَيْتِ الْمَقْدِسِ سِتَّةَ عَشَرَ، أَوْ سَبْعَةَ عَشَرَ شَهْرًا، وَكَانَ يُحِبُّ أَنْ يُوَجَّهَ إِلَى الْكَعْبَةِ فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏قَدْ نَرَى تَقَلُّبَ وَجْهِكَ فِي السَّمَاءِ فَلَنُوَلِّيَنَّكَ قِبْلَةً تَرْضَاهَا‏}‏ فَوُجِّهَ نَحْوَ الْكَعْبَةِ، وَصَلَّى مَعَهُ رَجُلٌ الْعَصْرَ، ثُمَّ خَرَجَ فَمَرَّ عَلَى قَوْمٍ مِنَ الأَنْصَارِ فَقَالَ هُوَ يَشْهَدُ أَنَّهُ صَلَّى مَعَ النَّبِيِّ صلى الله عليه وسلم وَأَنَّهُ قَدْ وُجِّهَ إِلَى الْكَعْبَةِ‏.‏ فَانْحَرَفُوا وَهُمْ رُكُوعٌ فِي صَلاَةِ الْعَصْرِ‏.‏",
        "grade": ""
      },
      "collectionId": "bukhari",
      "bookId": 95,
      "bookName": "95Accepting Information Given by a Truthful Personكتاب أخبار الآحاد",
      "bookReference": 7252
    },
    {
      "hadithNumber": 7253,
      "english": {
        "narrated": "Narrated Anas bin Malik:",
        "hadith": "I used to offer drinks prepared from infused dates to Abu Talha Al-Ansari, Abu 'Ubada bin Al Jarrah \nand Ubai bin Ka`b. Then a person came to them and said, \"All alcoholic drinks have been prohibited.\" \nAbii Talha then said, \"O Anas! Get up and break all these jars.\" So I got up and took a mortar \nbelonging to us, and hit the jars with its lower part till they broke.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنِي يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنِي مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ ـ رضى الله عنه ـ قَالَ كُنْتُ أَسْقِي أَبَا طَلْحَةَ الأَنْصَارِيَّ وَأَبَا عُبَيْدَةَ بْنَ الْجَرَّاحِ وَأُبَىَّ بْنَ كَعْبٍ شَرَابًا مِنْ فَضِيخٍ وَهْوَ تَمْرٌ فَجَاءَهُمْ آتٍ فَقَالَ إِنَّ الْخَمْرَ قَدْ حُرِّمَتْ‏.‏ فَقَالَ أَبُو طَلْحَةَ يَا أَنَسُ قُمْ إِلَى هَذِهِ الْجِرَارِ فَاكْسِرْهَا، قَالَ أَنَسٌ فَقُمْتُ إِلَى مِهْرَاسٍ لَنَا فَضَرَبْتُهَا بِأَسْفَلِهِ حَتَّى انْكَسَرَتْ‏.‏",
        "grade": ""
      },
      "collectionId": "bukhari",
      "bookId": 95,
      "bookName": "95Accepting Information Given by a Truthful Personكتاب أخبار الآحاد",
      "bookReference": 7253
    },
    {
      "hadithNumber": 7254,
      "english": {
        "narrated": "Narrated Hudhaifa:",
        "hadith": "The Prophet (ﷺ) said to the people of Najran, \"I will send to you an honest person who is really \ntrustworthy.\" The Companion, of the Prophet (ﷺ) each desired to be that person, but the Prophet (ﷺ) sent Abu \n'Ubaida.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لأَبْعَثَنَّ إِلَيْكُمْ رَجُلاً أَمِينًا حَقَّ أَمِينٍ ‏\"",
        "grade": ""
      },
      "collectionId": "bukhari",
      "bookId": 95,
      "bookName": "95Accepting Information Given by a Truthful Personكتاب أخبار الآحاد",
      "bookReference": 7254
    },
    {
      "hadithNumber": 7255,
      "english": {
        "narrated": "Narrated Anas:",
        "hadith": "The Prophet (ﷺ) said, \"For every nation there is an Amin (honest, trustworthy person) and the Amin of \nthis nation is Abu 'Ubaida.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لِكُلِّ أُمَّةٍ أَمِينٌ، وَأَمِينُ هَذِهِ الأُمَّةِ أَبُو عُبَيْدَةَ ‏\"",
        "grade": ""
      },
      "collectionId": "bukhari",
      "bookId": 95,
      "bookName": "95Accepting Information Given by a Truthful Personكتاب أخبار الآحاد",
      "bookReference": 7255
    },
    {
      "hadithNumber": 7256,
      "english": {
        "narrated": "Narrated `Umar:",
        "hadith": "There was a man from the Ansar (who was a friend of mine). If he was not present in the company of \nAllah's Messenger (ﷺ) I used to be present with Allah's Messenger (ﷺ), I would tell him what I used to hear from \nAllah's Messenger (ﷺ), and when I was absent from Allah's Messenger (ﷺ) he used to be present with him, and he \nwould tell me what he used to hear from Allah's Messenger (ﷺ) .",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عُبَيْدِ بْنِ حُنَيْنٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ عُمَرَ ـ رضى الله عنهم ـ قَالَ وَكَانَ رَجُلٌ مِنَ الأَنْصَارِ إِذَا غَابَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَشَهِدْتُهُ أَتَيْتُهُ بِمَا يَكُونُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَإِذَا غِبْتُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَشَهِدَ أَتَانِي بِمَا يَكُونُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم‏.‏",
        "grade": ""
      },
      "collectionId": "bukhari",
      "bookId": 95,
      "bookName": "95Accepting Information Given by a Truthful Personكتاب أخبار الآحاد",
      "bookReference": 7256
    },
    {
      "hadithNumber": 7257,
      "english": {
        "narrated": "Narrated `Ali:",
        "hadith": "The Prophet (ﷺ) , sent an army and appointed some man their commander The man made a fire and then \nsaid (to the soldiers), \"Enter it.\" Some of them intended to enter it while some others said, 'We have \nrun away from it (i.e., embraced Islam to save ourselves from the 'fire').\" They mentioned that to the \nProphet, and he said about people who had intended to enter the fire. ''If they had entered it, they \nwould have remained In it till the Day of Resurrection.'' Then he said to others, \"No obedience for evil \ndeeds, obedience is required only in what is good .\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ زُبَيْدٍ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ عَلِيٍّ ـ رضى الله عنه ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم بَعَثَ جَيْشًا وَأَمَّرَ عَلَيْهِمْ رَجُلاً، فَأَوْقَدَ نَارًا وَقَالَ ادْخُلُوهَا‏.‏ فَأَرَادُوا أَنْ يَدْخُلُوهَا، وَقَالَ آخَرُونَ إِنَّمَا فَرَرْنَا مِنْهَا، فَذَكَرُوا لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ لِلَّذِينَ أَرَادُوا أَنْ يَدْخُلُوهَا ‏\"‏ لَوْ دَخَلُوهَا لَمْ يَزَالُوا فِيهَا إِلَى يَوْمِ الْقِيَامَةِ ‏\"‏‏.‏ وَقَالَ لِلآخَرِينَ ‏\"‏ لاَ طَاعَةَ فِي مَعْصِيَةٍ، إِنَّمَا الطَّاعَةُ فِي الْمَعْرُوفِ ‏\"‏‏.‏",
        "grade": ""
      },
      "collectionId": "bukhari",
      "bookId": 95,
      "bookName": "95Accepting Information Given by a Truthful Personكتاب أخبار الآحاد",
      "bookReference": 7257
    },
    {
      "hadithNumber": 7258,
      "english": {
        "narrated": "Narrated Abu Huraira and Zaid bin Khalid:",
        "hadith": "Two men sued each other before the Prophet.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ، أَخْبَرَهُ أَنَّ أَبَا هُرَيْرَةَ وَزَيْدَ بْنَ خَالِدٍ أَخْبَرَاهُ أَنَّ رَجُلَيْنِ اخْتَصَمَا إِلَى النَّبِيِّ صلى الله عليه وسلم‏.‏",
        "grade": ""
      },
      "collectionId": "bukhari",
      "bookId": 95,
      "bookName": "95Accepting Information Given by a Truthful Personكتاب أخبار الآحاد",
      "bookReference": 7258
    },
    {
      "hadithNumber": 7260,
      "english": {
        "narrated": "Narrated Abu Huraira:",
        "hadith": "While we were with Allah's Messenger (ﷺ) a bedouin got up and said, \"O Allah's Messenger (ﷺ)! Settle my case \naccording to Allah's Book (Laws).\" Then his opponent got up and said, \"O Allah's Messenger (ﷺ)! He has \nsaid the truth! Settle his case according to Allah's Book (Laws.) and allow me to speak,\" He said, \"My \nson was a laborer for this man and he committed illegal sexual intercourse with his wife. The people \ntold me that my son should be stoned to death but I ransomed him with one-hundred sheep and a slave \ngirl. Then I asked the religious learned people and they told me that his wife should be stoned to death \nand my son should receive one-hundred lashes and be sentenced to one year of exile.' The Prophet (ﷺ) \nsaid, \"By Him in Whose Hands my life is, I will judge between you according to Allah's Book (Laws): \nAs for the slave girl and the sheep, they are to be returned; and as for your son, he shall receive onehundred \nlashes and will be exiled for one year. You, O Unais!\" addressing a man from Bani Aslam, \n\"Go tomorrow morning to the wife of this (man) and if she confesses, then stone her to death.\" The \nnext morning Unais went to the wife and she confessed, and he stoned her to death.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وَحَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ بَيْنَمَا نَحْنُ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذْ قَامَ رَجُلٌ مِنَ الأَعْرَابِ فَقَالَ يَا رَسُولَ اللَّهِ اقْضِ لِي بِكِتَابِ اللَّهِ‏.‏ فَقَامَ خَصْمُهُ فَقَالَ صَدَقَ يَا رَسُولَ اللَّهِ، اقْضِ لَهُ بِكِتَابِ اللَّهِ، وَأْذَنْ لِي‏.‏ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ قُلْ ‏\"‏‏.‏ فَقَالَ إِنَّ ابْنِي كَانَ عَسِيفًا عَلَى هَذَا ـ وَالْعَسِيفُ الأَجِيرُ ـ فَزَنَى بِامْرَأَتِهِ فَأَخْبَرُونِي أَنَّ عَلَى ابْنِي الرَّجْمَ، فَافْتَدَيْتُ مِنْهُ بِمِائَةٍ مِنَ الْغَنَمِ وَوَلِيدَةٍ، ثُمَّ سَأَلْتُ أَهْلَ الْعِلْمِ فَأَخْبَرُونِي أَنَّ عَلَى امْرَأَتِهِ الرَّجْمَ، وَأَنَّمَا عَلَى ابْنِي جَلْدُ مِائَةٍ وَتَغْرِيبُ عَامٍ‏.‏ فَقَالَ ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ لأَقْضِيَنَّ بَيْنَكُمَا بِكِتَابِ اللَّهِ، أَمَّا الْوَلِيدَةُ وَالْغَنَمُ فَرُدُّوهَا، وَأَمَّا ابْنُكَ فَعَلَيْهِ جَلْدُ مِائَةٍ وَتَغْرِيبُ عَامٍ، وَأَمَّا أَنْتَ يَا أُنَيْسُ ـ لِرَجُلٍ مِنْ أَسْلَمَ ـ فَاغْدُ عَلَى امْرَأَةِ هَذَا، فَإِنِ اعْتَرَفَتْ فَارْجُمْهَا ‏\"‏‏.‏ فَغَدَا عَلَيْهَا أُنَيْسٌ فَاعْتَرَفَتْ فَرَجَمَهَا‏.‏",
        "grade": ""
      },
      "collectionId": "bukhari",
      "bookId": 95,
      "bookName": "95Accepting Information Given by a Truthful Personكتاب أخبار الآحاد",
      "bookReference": 7260
    },
    {
      "hadithNumber": 7261,
      "english": {
        "narrated": "Narrated Jabir bin `Abdullah:",
        "hadith": "On the day of (the battle of) the Trench, the Prophet (ﷺ) called the people (to bring news about the \nenemy). Az-Zubair responded to his call. He called them again and Az-Zubair responded to his call \nagain; then he called them for the third time and again Az-Zubair responded to his call whereupon the \nProphet said, \"Every prophet has his Hawairi (helper), and Az-Zubair is my Hawari.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لِكُلِّ نَبِيٍّ حَوَارِيٌّ وَحَوَارِيِّ الزُّبَيْرُ ‏\"",
        "grade": ""
      },
      "collectionId": "bukhari",
      "bookId": 95,
      "bookName": "95Accepting Information Given by a Truthful Personكتاب أخبار الآحاد",
      "bookReference": 7261
    },
    {
      "hadithNumber": 7262,
      "english": {
        "narrated": "Narrated Abu Musa:",
        "hadith": "The Prophet (ﷺ) entered a garden and told me to guard its gate. Then a man came and asked permission to \nenter. The Prophet, said, \"Permit him and give him the good news that he will enter Paradise.\" \nBehold! It was Abu Bakr. Then `Umar came, and the Prophet (ﷺ) said, \"Admit him and give him the good \nnews that he will enter Paradise.\" Then `Uthman came and the Prophet (ﷺ) said, \"Admit him and give him \nthe good news that he will enter Paradise. \"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ أَبِي عُثْمَانَ، عَنْ أَبِي مُوسَى، أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ حَائِطًا وَأَمَرَنِي بِحِفْظِ الْبَابِ فَجَاءَ رَجُلٌ يَسْتَأْذِنُ فَقَالَ ‏\"‏ ائْذَنْ لَهُ، وَبَشِّرْهُ بِالْجَنَّةِ ‏\"‏‏.‏ فَإِذَا أَبُو بَكْرٍ، ثُمَّ جَاءَ عُمَرُ فَقَالَ ‏\"‏ ائْذَنْ لَهُ، وَبَشِّرْهُ بِالْجَنَّةِ ‏\"‏‏.‏ ثُمَّ جَاءَ عُثْمَانُ فَقَالَ ‏\"‏ ائْذَنْ لَهُ، وَبَشِّرْهُ بِالْجَنَّةِ ‏\"‏‏.‏",
        "grade": ""
      },
      "collectionId": "bukhari",
      "bookId": 95,
      "bookName": "95Accepting Information Given by a Truthful Personكتاب أخبار الآحاد",
      "bookReference": 7262
    },
    {
      "hadithNumber": 7263,
      "english": {
        "narrated": "Narrated `Umar:",
        "hadith": "I came and behold, Allah's Messenger (ﷺ) was staying on a Mashroba (attic room) and a black slave of \nAllah's Messenger (ﷺ) was at the top if its stairs. I said to him, \"(Tell the Prophet) that here is `Umar bin Al- \nKhattab (asking for permission to enter).\" Then he admitted me.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ يَحْيَى، عَنْ عُبَيْدِ بْنِ حُنَيْنٍ، سَمِعَ ابْنَ عَبَّاسٍ، عَنْ عُمَرَ ـ رضى الله عنهم ـ قَالَ جِئْتُ فَإِذَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي مَشْرُبَةٍ لَهُ، وَغُلاَمٌ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَسْوَدُ عَلَى رَأْسِ الدَّرَجَةِ فَقُلْتُ قُلْ هَذَا عُمَرُ بْنُ الْخَطَّابِ فَأَذِنَ لِي‏.‏",
        "grade": ""
      },
      "collectionId": "bukhari",
      "bookId": 95,
      "bookName": "95Accepting Information Given by a Truthful Personكتاب أخبار الآحاد",
      "bookReference": 7263
    },
    {
      "hadithNumber": 7264,
      "english": {
        "narrated": "Narrated `Abdullah bin `Abbas:",
        "hadith": "Allah's Messenger (ﷺ) sent a letter to Khosrau and told his messenger to give it first to the ruler of Bahrain, \nand tell him to deliver it to Khosrau. When Khosrau had read it, he tore it into pieces. (Az-Zuhri said: \nI think Ibn Al-Musaiyab said, \"Allah's Messenger (ﷺ) invoked Allah to tear them (Khosrau and his followers) \ninto pieces.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، حَدَّثَنِي اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ بِكِتَابِهِ إِلَى كِسْرَى، فَأَمَرَهُ أَنْ يَدْفَعَهُ إِلَى عَظِيمِ الْبَحْرَيْنِ، يَدْفَعُهُ عَظِيمُ الْبَحْرَيْنِ إِلَى كِسْرَى، فَلَمَّا قَرَأَهُ كِسْرَى مَزَّقَهُ، فَحَسِبْتُ أَنَّ ابْنَ الْمُسَيَّبِ قَالَ فَدَعَا عَلَيْهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُمَزَّقُوا كُلَّ مُمَزَّقٍ‏.‏",
        "grade": ""
      },
      "collectionId": "bukhari",
      "bookId": 95,
      "bookName": "95Accepting Information Given by a Truthful Personكتاب أخبار الآحاد",
      "bookReference": 7264
    },
    {
      "hadithNumber": 7265,
      "english": {
        "narrated": "Narrated Salama bin Al-Akwa`:",
        "hadith": "Allah's Messenger (ﷺ) said to a man from the tribe of Al-Aslam, \"Proclaim among your people (or the \npeople) on the day of 'Ashura' (tenth of Muharram), 'Whosoever has eaten anything should fast for the \nrest of the day; and whoever has not eaten anything, should complete his fast.' \"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ أَذِّنْ فِي قَوْمِكَ ـ أَوْ فِي النَّاسِ ـ يَوْمَ عَاشُورَاءَ أَنَّ مَنْ أَكَلَ فَلْيُتِمَّ بَقِيَّةَ يَوْمِهِ، وَمَنْ لَمْ يَكُنْ أَكَلَ فَلْيَصُمْ ‏\"",
        "grade": ""
      },
      "collectionId": "bukhari",
      "bookId": 95,
      "bookName": "95Accepting Information Given by a Truthful Personكتاب أخبار الآحاد",
      "bookReference": 7265
    },
    {
      "hadithNumber": 7266,
      "english": {
        "narrated": "Narrated Ibn `Abbas:",
        "hadith": "When the delegate of `Abd Al-Qais came to Allah's Messenger (ﷺ), he said, \"Who are the delegate?\" They \nsaid, \"The delegate are from the tribe of Rabi`a.\" The Prophet (ﷺ) said, \"Welcome, O the delegate, and \nwelcome! O people! Neither you will have any disgrace nor will you regret.\" They said, \"O Allah's \nApostle! Between you and us there are the infidels of the tribe of Mudar, so please order us to do \nsomething good (religious deeds) that by acting on them we may enter Paradise, and that we may \ninform (our people) whom we have left behind, about it.\" They also asked (the Prophet) about drinks. \nHe forbade them from four things and ordered them to do four things. He ordered them to believe in \nAllah, and asked them, \"Do you know what is meant by belief in Allah?\" They said, \"Allah and His \nApostle know best.\" He said, ''To testify that none has the right to be worshipped except Allah, the \nOne, Who has no partners with Him, and that Muhammad is Allah's Messenger (ﷺ); and to offer prayers \nperfectly and to pay Zakat.\" (the narrator thinks that fasting in Ramadan is included), \"and to give \none-fifth of the war booty (to the state).\" Then he forbade four (drinking utensils): Ad-Duba', Al56 \nHantam, Al-Mazaffat and An-Naqir, or probably, Al-Muqaiyar. And then the Prophet (ﷺ) said, \n\"Remember all these things by heart and preach it to those whom you have left behind.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا عَلِيُّ بْنُ الْجَعْدِ، أَخْبَرَنَا شُعْبَةُ،‏.‏ وَحَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا النَّضْرُ، أَخْبَرَنَا شُعْبَةُ، عَنْ أَبِي جَمْرَةَ، قَالَ كَانَ ابْنُ عَبَّاسٍ يُقْعِدُنِي عَلَى سَرِيرِهِ فَقَالَ إِنَّ وَفْدَ عَبْدِ الْقَيْسِ لَمَّا أَتَوْا رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنِ الْوَفْدُ ‏\"‏‏.‏ قَالُوا رَبِيعَةُ‏.‏ قَالَ ‏\"‏ مَرْحَبًا بِالْوَفْدِ وَالْقَوْمِ، غَيْرَ خَزَايَا وَلاَ نَدَامَى ‏\"‏‏.‏ قَالُوا يَا رَسُولَ اللَّهِ إِنَّ بَيْنَنَا وَبَيْنَكَ كُفَّارَ مُضَرَ، فَمُرْنَا بِأَمْرٍ نَدْخُلُ بِهِ الْجَنَّةَ، وَنُخْبِرُ بِهِ مَنْ وَرَاءَنَا فَسَأَلُوا عَنِ الأَشْرِبَةِ، فَنَهَاهُمْ عَنْ أَرْبَعٍ وَأَمَرَهُمْ بِأَرْبَعٍ أَمَرَهُمْ بِالإِيمَانِ بِاللَّهِ قَالَ ‏\"‏ هَلْ تَدْرُونَ مَا الإِيمَانُ بِاللَّهِ ‏\"‏‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ ‏\"‏ شَهَادَةُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَإِقَامُ الصَّلاَةِ، وَإِيتَاءُ الزَّكَاةِ ـ وَأَظُنُّ فِيهِ ـ صِيَامُ رَمَضَانَ، وَتُؤْتُوا مِنَ الْمَغَانِمِ الْخُمُسَ ‏\"‏‏.‏ وَنَهَاهُمْ عَنِ الدُّبَّاءِ، وَالْحَنْتَمِ، وَالْمُزَفَّتِ، وَالنَّقِيرِ، وَرُبَّمَا قَالَ الْمُقَيَّرِ‏.‏ قَالَ ‏\"‏ احْفَظُوهُنَّ، وَأَبْلِغُوهُنَّ مَنْ وَرَاءَكُمْ ‏\"‏‏.‏",
        "grade": ""
      },
      "collectionId": "bukhari",
      "bookId": 95,
      "bookName": "95Accepting Information Given by a Truthful Personكتاب أخبار الآحاد",
      "bookReference": 7266
    },
    {
      "hadithNumber": 7267,
      "english": {
        "narrated": "Narrated Tauba Al-`Anbari:",
        "hadith": "Ash-'Shu`bi asked me, \"Did you notice how Al-Hasan used to narrate Hadiths from the Prophets? I \r\nstayed with Ibn `Umar for about two or one-and-half years and I did not hear him narrating any thing \r\nfrom the Prophet (ﷺ) except his (Hadith): He (Ibn `Umar) said, \"Some of the companions of the Prophet (ﷺ) \r\nincluding Sa`d, were going to eat meat, but one of the wives of the Prophet (ﷺ) called them, saying, 'It is \r\nthe meat of a Mastigure.' The people then stopped eating it. On that Allah's Messenger (ﷺ) said, 'Carry on \r\neating, for it is lawful.' Or said, 'There is no harm in eating it, but it is not from my meals.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ كُلُوا ـ أَوِ اطْعَمُوا ـ فَإِنَّهُ حَلاَلٌ ـ أَوْ قَالَ لاَ بَأْسَ بِهِ‏.‏ شَكَّ فِيهِ ـ وَلَكِنَّهُ لَيْسَ مِنْ طَعَامِي ‏\"",
        "grade": ""
      },
      "collectionId": "bukhari",
      "bookId": 95,
      "bookName": "95Accepting Information Given by a Truthful Personكتاب أخبار الآحاد",
      "bookReference": 7267
    }
  ]
}