{
  "collectionId": "bukhari",
  "bookId": 38,
  "bookName": "38Transferance of a Debt from One Person to Another (Al-Hawaala)كتاب الحوالات",
  "hadithCount": 3,
  "hadiths": [
    {
      "hadithNumber": 2287,
      "english": {
        "narrated": "Narrated Abu Huraira:",
        "hadith": "The Prophet (ﷺ) said, \"Procrastination (delay) in paying debts by a wealthy man is injustice. So, if your \ndebt is transferred from your debtor to a rich debtor, you should agree.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مَطْلُ الْغَنِيِّ ظُلْمٌ، فَإِذَا أُتْبِعَ أَحَدُكُمْ عَلَى مَلِيٍّ فَلْيَتْبَعْ ‏\"",
        "grade": ""
      },
      "collectionId": "bukhari",
      "bookId": 38,
      "bookName": "38Transferance of a Debt from One Person to Another (Al-Hawaala)كتاب الحوالات",
      "bookReference": 2287
    },
    {
      "hadithNumber": 2288,
      "english": {
        "narrated": "Narrated Abu Huraira:",
        "hadith": "The Prophet (ﷺ) said, \"Procrastination (delay) in paying debts by a wealthy person is injustice. So, if your \ndebt is transferred from your debtor to a rich debtor, you should agree.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مَطْلُ الْغَنِيِّ ظُلْمٌ، وَمَنْ أُتْبِعَ عَلَى مَلِيٍّ فَلْيَتَّبِعْ ‏\"",
        "grade": ""
      },
      "collectionId": "bukhari",
      "bookId": 38,
      "bookName": "38Transferance of a Debt from One Person to Another (Al-Hawaala)كتاب الحوالات",
      "bookReference": 2288
    },
    {
      "hadithNumber": 2289,
      "english": {
        "narrated": "Narrated Salama bin Al-Akwa:",
        "hadith": "Once, while we were sitting in the company of Prophet, a dead man was \n     brought. The Prophet (ﷺ) was requested to lead the funeral prayer for the \n     deceased. He said, \"Is he in debt?\" The people replied in the \n     negative. He said, \"Has he left any wealth?\" They said, \"No.\" So, he \n     led his funeral prayer. Another dead man was brought and the people \n     said, \"O Allah's Messenger (ﷺ)! Lead his funeral prayer.\" The Prophet (ﷺ) said, \n     \"Is he in debt?\" They said, \"Yes.\" He said, \"Has he left any wealth?\" \n     They said, ''Three Dinars.\" So, he led the prayer. Then a third dead \n     man was brought and the people said (to the Prophet (ﷺ) ), Please lead his\n     funeral prayer.\" He said, \"Has he left any wealth?\" They said, \"No.\" \n     He asked, \"Is he in debt?\" They said, (\"Yes! He has to pay) three \n     Diners.', He (refused to pray and) said, \"Then pray for your (dead) \n     companion.\" Abu Qatada said, \"O Allah's Messenger (ﷺ)! Lead his funeral \n     prayer, and I will pay his debt.\" So, he led the prayer.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا يَزِيدُ بْنُ أَبِي عُبَيْدٍ، عَنْ سَلَمَةَ بْنِ الأَكْوَعِ ـ رضى الله عنه ـ قَالَ كُنَّا جُلُوسًا عِنْدَ النَّبِيِّ صلى الله عليه وسلم إِذْ أُتِيَ بِجَنَازَةٍ، فَقَالُوا صَلِّ عَلَيْهَا‏.‏ فَقَالَ ‏\"‏ هَلْ عَلَيْهِ دَيْنٌ ‏\"‏‏.‏ قَالُوا لاَ‏.‏ قَالَ ‏\"‏ فَهَلْ تَرَكَ شَيْئًا ‏\"‏‏.‏ قَالُوا لاَ‏.‏ فَصَلَّى عَلَيْهِ ثُمَّ أُتِيَ بِجَنَازَةٍ أُخْرَى، فَقَالُوا يَا رَسُولَ اللَّهِ، صَلِّ عَلَيْهَا‏.‏ قَالَ ‏\"‏ هَلْ عَلَيْهِ دَيْنٌ ‏\"‏‏.‏ قِيلَ نَعَمْ‏.‏ قَالَ ‏\"‏ فَهَلْ تَرَكَ شَيْئًا ‏\"‏‏.‏ قَالُوا ثَلاَثَةَ دَنَانِيرَ‏.‏ فَصَلَّى عَلَيْهَا، ثُمَّ أُتِيَ بِالثَّالِثَةِ، فَقَالُوا صَلِّ عَلَيْهَا‏.‏ قَالَ ‏\"‏ هَلْ تَرَكَ شَيْئًا ‏\"‏‏.‏ قَالُوا لاَ‏.‏ قَالَ ‏\"‏ فَهَلْ عَلَيْهِ دَيْنٌ ‏\"‏‏.‏ قَالُوا ثَلاَثَةُ دَنَانِيرَ‏.‏ قَالَ ‏\"‏ صَلُّوا عَلَى صَاحِبِكُمْ ‏\"‏‏.‏ قَالَ أَبُو قَتَادَةَ صَلِّ عَلَيْهِ يَا رَسُولَ اللَّهِ، وَعَلَىَّ دَيْنُهُ‏.‏ فَصَلَّى عَلَيْهِ‏.‏",
        "grade": ""
      },
      "collectionId": "bukhari",
      "bookId": 38,
      "bookName": "38Transferance of a Debt from One Person to Another (Al-Hawaala)كتاب الحوالات",
      "bookReference": 2289
    }
  ]
}