{
  "collectionId": "nasai",
  "bookId": 40,
  "bookName": "40The Book of al-'Aqiqah كتاب العقيقة",
  "hadithCount": 10,
  "hadiths": [
    {
      "hadithNumber": 4212,
      "english": {
        "narrated": "It was narrated from 'Amr bin Shuaib, from his fahther, that his grandfather said:",
        "hadith": "\"The messenger of Allah was asked about the 'Aqiqah and he said: \"Allah, the mighty and sublime, does not like Al-Uquq' as if he disliked the word (Al-Aqiqah). He said to the Messenger of Allah: 'But one of us may offer a sacrifice when a child is born to him.' He said: 'Whoever wants to offer a sacrifice for his child, let him do so, for a boy; two sheep, Mukafaatan, (of equal age), and for a girl, one.' (One of the narrators) Dawud said: 'I asked Ziad bin Aslam about the word Mukafaatan and he said: 'Two similar sheep that are slaughtered together.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا دَاوُدُ بْنُ قَيْسٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْعَقِيقَةِ فَقَالَ ‏\"‏ لاَ يُحِبُّ اللَّهُ عَزَّ وَجَلَّ الْعُقُوقَ ‏\"‏ ‏.‏ وَكَأَنَّهُ كَرِهَ الاِسْمَ قَالَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم إِنَّمَا نَسْأَلُكَ أَحَدُنَا يُولَدُ لَهُ ‏.‏ قَالَ ‏\"‏ مَنْ أَحَبَّ أَنْ يَنْسُكَ عَنْ وَلَدِهِ فَلْيَنْسُكْ عَنْهُ عَنِ الْغُلاَمِ شَاتَانِ مُكَافَأَتَانِ وَعَنِ الْجَارِيَةِ شَاةٌ ‏\"‏ ‏.‏ قَالَ دَاوُدُ سَأَلْتُ زَيْدَ بْنَ أَسْلَمَ عَنِ الْمُكَافَأَتَانِ قَالَ الشَّاتَانِ الْمُشَبَّهَتَانِ تُذْبَحَانِ جَمِيعًا ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 40,
      "bookName": "40The Book of al-'Aqiqah كتاب العقيقة",
      "bookReference": 4212
    },
    {
      "hadithNumber": 4213,
      "english": {
        "narrated": "It was narrated from 'Abdullah bin Buraidah, from his father, that:",
        "hadith": "the Messenger of Allah offered the 'Aqiqah for Al-Hasan and Al-Husain.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ، قَالَ حَدَّثَنَا الْفَضْلُ، عَنِ الْحُسَيْنِ بْنِ وَاقِدٍ، عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم عَقَّ عَنِ الْحَسَنِ وَالْحُسَيْنِ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 40,
      "bookName": "40The Book of al-'Aqiqah كتاب العقيقة",
      "bookReference": 4213
    },
    {
      "hadithNumber": 4214,
      "english": {
        "narrated": "It was narrated from Salman bin 'Amir Ad-Dabbi that the Messenger of Allah said:",
        "hadith": "\"For a boy there shoud be an 'Aqiqah, so shed blood for him, and remove the harm from him.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ فِي الْغُلاَمِ عَقِيقَةٌ فَأَهْرِيقُوا عَنْهُ دَمًا وَأَمِيطُوا عَنْهُ الأَذَى ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 40,
      "bookName": "40The Book of al-'Aqiqah كتاب العقيقة",
      "bookReference": 4214
    },
    {
      "hadithNumber": 4215,
      "english": {
        "narrated": "it was narrated from Um Kurz that the Messenger of Allah said:",
        "hadith": "\"for a boy two sheep, Mukafaatan (of equal age), and for a girl, one sheep.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ فِي الْغُلاَمِ شَاتَانِ مُكَافَأَتَانِ وَفِي الْجَارِيَةِ شَاةٌ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 40,
      "bookName": "40The Book of al-'Aqiqah كتاب العقيقة",
      "bookReference": 4215
    },
    {
      "hadithNumber": 4216,
      "english": {
        "narrated": "It was narrated from Umm Kurz that the Messenger of Allah said:",
        "hadith": "\"For a boy two sheep, Mukafaatan (of equal age), and for a girl, one sheep,",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ عَنِ الْغُلاَمِ شَاتَانِ مُكَافَأَتَانِ وَعَنِ الْجَارِيَةِ شَاةٌ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 40,
      "bookName": "40The Book of al-'Aqiqah كتاب العقيقة",
      "bookReference": 4216
    },
    {
      "hadithNumber": 4217,
      "english": {
        "narrated": "It was narrated that umm Kurz said:",
        "hadith": "\"I came to the Prophet and asked him about the sacrificial meat. I heard him say: 'For a boy, two sheep, and for a girl, one sheep, and it does not matter if they are male or female.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ عَلَى الْغُلاَمِ شَاتَانِ وَعَلَى الْجَارِيَةِ شَاةٌ لاَ يَضُرُّكُمْ ذُكْرَانًا كُنَّ أَمْ إِنَاثًا ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 40,
      "bookName": "40The Book of al-'Aqiqah كتاب العقيقة",
      "bookReference": 4217
    },
    {
      "hadithNumber": 4218,
      "english": {
        "narrated": "It was narrated from Umma Kurz that the Messenger of Allah said:",
        "hadith": "\"For a boy, two sheep, and or a girl, one sheep, and it does not matter if they are male or female",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ عَنِ الْغُلاَمِ شَاتَانِ وَعَنِ الْجَارِيَةِ شَاةٌ لاَ يَضُرُّكُمْ ذُكْرَانًا كُنَّ أَمْ إِنَاثًا ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 40,
      "bookName": "40The Book of al-'Aqiqah كتاب العقيقة",
      "bookReference": 4218
    },
    {
      "hadithNumber": 4219,
      "english": {
        "narrated": "It was narrated that Ibn 'Abbas said:",
        "hadith": "\"The Messenger of Allah offered an 'Aqiqah for Al-Hasan and Al-Husain, may Allah be please with them, two rams for each.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصِ بْنِ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي إِبْرَاهِيمُ، - هُوَ ابْنُ طَهْمَانَ - عَنِ الْحَجَّاجِ بْنِ الْحَجَّاجِ، عَنْ قَتَادَةَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ عَقَّ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْحَسَنِ وَالْحُسَيْنِ رضى الله عنهما بِكَبْشَيْنِ كَبْشَيْنِ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 40,
      "bookName": "40The Book of al-'Aqiqah كتاب العقيقة",
      "bookReference": 4219
    },
    {
      "hadithNumber": 4220,
      "english": {
        "narrated": "It was narrated from Qatadah, from Al-Hasan, from Samurh bin Jundab that the Messenger of Allah said:",
        "hadith": "\"Every boy is in pledge for his 'Aqiqah, so slaughter (the animal) for him on the seventh day, and shave his head, and a name\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ كُلُّ غُلاَمٍ رَهِينٌ بِعَقِيقَتِهِ تُذْبَحُ عَنْهُ يَوْمَ سَابِعِهِ وَيُحْلَقُ رَأْسُهُ وَيُسَمَّى ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 40,
      "bookName": "40The Book of al-'Aqiqah كتاب العقيقة",
      "bookReference": 4220
    },
    {
      "hadithNumber": 4221,
      "english": {
        "narrated": "It was narrated from Habib bin Ash-Shahid:",
        "hadith": "\"Muhammad bin Sirin said to me: 'Ask Al-Hasan (Al-Basri) from whom he heard this Hadith about the 'Aqiqah.' I asked him about that and he said: 'I heard it from Samurh.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا قُرَيْشُ بْنُ أَنَسٍ، عَنْ حَبِيبِ بْنِ الشَّهِيدِ، قَالَ لِي مُحَمَّدُ بْنُ سِيرِينَ سَلِ الْحَسَنَ مِمَّنْ سَمِعَ حَدِيثَهُ، فِي الْعَقِيقَةِ ‏.‏ فَسَأَلْتُهُ عَنْ ذَلِكَ، فَقَالَ سَمِعْتُهُ مِنْ، سَمُرَةَ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 40,
      "bookName": "40The Book of al-'Aqiqah كتاب العقيقة",
      "bookReference": 4221
    }
  ]
}