{
  "collectionId": "nasai",
  "bookId": 39,
  "bookName": "39The Book of al-Bay'ah كتاب البيعة",
  "hadithCount": 63,
  "hadiths": [
    {
      "hadithNumber": 4149,
      "english": {
        "narrated": "It was narrated that 'Ubadah bin As-Samit said:",
        "hadith": "\"We pledged to the Messenger of Allah to hear and obey, both in times of ease and hardship, when we felt energetic and when we felt tired, that we would not contend with the orders of whomever was entrusted with it, that we would was entrusted with it, that we would stand firm in the way of truth wherever we may be, and that we would not fear the blame of the blamers.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا الإِمَامُ أَبُو عَبْدِ الرَّحْمَنِ النَّسَائِيُّ، مِنْ لَفْظِهِ قَالَ أَنْبَأَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عُبَادَةَ بْنِ الْوَلِيدِ بْنِ عُبَادَةَ بْنِ الصَّامِتِ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ بَايَعْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى السَّمْعِ وَالطَّاعَةِ فِي الْيُسْرِ وَالْعُسْرِ وَالْمَنْشَطِ وَالْمَكْرَهِ وَأَنْ لاَ نُنَازِعَ الأَمْرَ أَهْلَهُ وَأَنْ نَقُومَ بِالْحَقِّ حَيْثُ كُنَّا لاَ نَخَافُ لَوْمَةَ لاَئِمٍ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4149
    },
    {
      "hadithNumber": 4150,
      "english": {
        "narrated": "It was narrated that 'Ubadah bin As-Samit said:",
        "hadith": "\"We pledged to the Messenger of Allah to hear and obey, both in times of hardship and ease.\" And he mentioned similarly.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا عِيسَى بْنُ حَمَّادٍ، قَالَ أَنْبَأَنَا اللَّيْثُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عُبَادَةَ بْنِ الْوَلِيدِ بْنِ عُبَادَةَ بْنِ الصَّامِتِ، عَنْ أَبِيهِ، أَنَّ عُبَادَةَ بْنَ الصَّامِتِ، قَالَ بَايَعْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى السَّمْعِ وَالطَّاعَةِ فِي الْعُسْرِ وَالْيُسْرِ ‏.‏ وَذَكَرَ مِثْلَهُ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4150
    },
    {
      "hadithNumber": 4151,
      "english": {
        "narrated": "It was narrated that 'Ubadah said:",
        "hadith": "\"We pledged to the Messenger of Allah to hear and obey both in times of hardship and ease, when we felt energetic and when we felt tired, that we would   not contend with the orders of whomever was entrusted with it, that we would speak the truth or stand firm in the way of truth wherever we may be, and that we would not fear the blame of the blamers.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ الْقَاسِمِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، قَالَ أَخْبَرَنِي عُبَادَةُ بْنُ الْوَلِيدِ بْنِ عُبَادَةَ، قَالَ حَدَّثَنِي أَبِي، عَنْ عُبَادَةَ، قَالَ بَايَعْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى السَّمْعِ وَالطَّاعَةِ فِي الْيُسْرِ وَالْعُسْرِ وَالْمَنْشَطِ وَالْمَكْرَهِ وَأَنْ لاَ نُنَازِعَ الأَمْرَ أَهْلَهُ وَأَنْ نَقُولَ - أَوْ نَقُومَ - بِالْحَقِّ حَيْثُمَا كُنَّا لاَ نَخَافُ لَوْمَةَ لاَئِمٍ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4151
    },
    {
      "hadithNumber": 4152,
      "english": {
        "narrated": "It was narrated from 'Ubadah bin Al-Walid bin 'Ubadah bin As-Samit, frim this father, that his grandfather said:",
        "hadith": "\"We pledged to the Messenger of Allah to hear and obey both in times of hardship and ease, when we felt energetic and when we felt tired, and when others are preferred over us, that we would not contend with the orders of whomever was entrusted with it, and that we would speak the truth wherever we may be.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ أَيُّوبَ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنِ ابْنِ إِسْحَاقَ، وَيَحْيَى بْنِ سَعِيدٍ، عَنْ عُبَادَةَ بْنِ الْوَلِيدِ بْنِ عُبَادَةَ بْنِ الصَّامِتِ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ بَايَعْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى السَّمْعِ وَالطَّاعَةِ فِي الْعُسْرِ وَالْيُسْرِ وَالْمَنْشَطِ وَالْمَكْرَهِ وَأَنْ لاَ نُنَازِعَ الأَمْرَ أَهْلَهُ وَعَلَى أَنْ نَقُولَ بِالْحَقِّ حَيْثُ كُنَّا ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4152
    },
    {
      "hadithNumber": 4153,
      "english": {
        "narrated": "It was narrated that 'Ubadah bin As-Samit said:",
        "hadith": "\"We pledged to the Messenger of Allah to hear and obey during our hardship and our ease, when we felt energetic and when we felt tired, that we would not contend with the orders of  whomever was entrusted with it, that we would stand for justice wherever we may be, and that we would not fear the blame of any blamer for the sake of Allah.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ حَدَّثَنِي الْوَلِيدُ بْنُ كَثِيرٍ، قَالَ حَدَّثَنِي عُبَادَةُ بْنُ الْوَلِيدِ، أَنَّ أَبَاهُ الْوَلِيدَ، حَدَّثَهُ عَنْ جَدِّهِ، عُبَادَةَ بْنِ الصَّامِتِ قَالَ بَايَعْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى السَّمْعِ وَالطَّاعَةِ فِي عُسْرِنَا وَيُسْرِنَا وَمَنْشَطِنَا وَمَكَارِهِنَا وَعَلَى أَنْ لاَ نُنَازِعَ الأَمْرَ أَهْلَهُ وَعَلَى أَنْ نَقُولَ بِالْعَدْلِ أَيْنَ كُنَّا لاَ نَخَافُ فِي اللَّهِ لَوْمَةَ لاَئِمٍ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4153
    },
    {
      "hadithNumber": 4154,
      "english": {
        "narrated": "It was narrated from Shu'bah, from Sayyar and Yahya bin Sa'eed that they heard 'Ubadah bin Al-Walid narrating from his father. Sayyar said:",
        "hadith": "\"From his father,\" and Yahya said: \"From his father,\" from his grandfather, whom said: 'We pledged to the Messenger of Allah to hear and obey during our hardship and our ease, when we felt energetic and when we felt tired, and when others are preferred over us, that we would not contend with the orders of whomever was entrusted with it, that we would stand firm for the truth wherever it may be, and that we would not fear the blame of any blamer for the sake of Allah.\" (Sahih)\nShu'bah said: \"Sayyar did not mention this statement: 'Wherever it may be' while Yahya mentioned it.\" Shu'bah said: \"If I have added anything to it, then it is from Sayyar or from Yahya.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْوَلِيدِ، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ سَيَّارٍ، وَيَحْيَى بْنِ سَعِيدٍ، أَنَّهُمَا سَمِعَا عُبَادَةَ بْنَ الْوَلِيدِ، يُحَدِّثُ عَنْ أَبِيهِ، - أَمَّا سَيَّارٌ فَقَالَ عَنْ أَبِيهِ، وَأَمَّا، يَحْيَى فَقَالَ عَنْ أَبِيهِ، عَنْ جَدِّهِ، - قَالَ بَايَعْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى السَّمْعِ وَالطَّاعَةِ فِي عُسْرِنَا وَيُسْرِنَا وَمَنْشَطِنَا وَمَكْرَهِنَا وَأَثَرَةٍ عَلَيْنَا وَأَنْ لاَ نُنَازِعَ الأَمْرَ أَهْلَهُ وَأَنْ نَقُومَ بِالْحَقِّ حَيْثُمَا كَانَ لاَ نَخَافُ فِي اللَّهِ لَوْمَةَ لاَئِمٍ ‏.‏ قَالَ شُعْبَةُ سَيَّارٌ لَمْ يَذْكُرْ هَذَا الْحَرْفَ حَيْثُمَا كَانَ وَذَكَرَهُ يَحْيَى ‏.‏ قَالَ شُعْبَةُ إِنْ كُنْتُ زِدْتُ فِيهِ شَيْئًا فَهُوَ عَنْ سَيَّارٍ أَوْ عَنْ يَحْيَى ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4154
    },
    {
      "hadithNumber": 4155,
      "english": {
        "narrated": "It was narrated from Abu Hurairah that the Messenger of Allah said:",
        "hadith": "\"You have to obey when you feel energetic and when you feel tired, during your ease and your hardship, and when others are preferred over you.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ عَلَيْكَ بِالطَّاعَةِ فِي مَنْشَطِكَ وَمَكْرَهِكَ وَعُسْرِكَ وَيُسْرِكَ وَأَثَرَةٍ عَلَيْكَ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4155
    },
    {
      "hadithNumber": 4156,
      "english": {
        "narrated": "It was narrated that Jarir said:",
        "hadith": "\"I pledged to the Messenger of Allah to be sincere toward ever Muslim.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ زِيَادِ بْنِ عِلاَقَةَ، عَنْ جَرِيرٍ، قَالَ بَايَعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى النُّصْحِ لِكُلِّ مُسْلِمٍ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4156
    },
    {
      "hadithNumber": 4157,
      "english": {
        "narrated": "Jarir said:",
        "hadith": "\"I pledged to the Prophet to hear and obey and to be sincere toward every Muslim.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ، عَنْ يُونُسَ، عَنْ عَمْرِو بْنِ سَعِيدٍ، عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ، قَالَ جَرِيرٌ بَايَعْتُ النَّبِيَّ صلى الله عليه وسلم عَلَى السَّمْعِ وَالطَّاعَةِ وَأَنْ أَنْصَحَ لِكُلِّ مُسْلِمٍ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4157
    },
    {
      "hadithNumber": 4158,
      "english": {
        "narrated": "Jabir said:",
        "hadith": "\"We did not give our pledge to the Messenger of Allah for death, rather we pledged not to flee (from battle).\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزُّبَيْرِ، سَمِعَ جَابِرًا، يَقُولُ لَمْ نُبَايِعْ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى الْمَوْتِ إِنَّمَا بَايَعْنَاهُ عَلَى أَنْ لاَ نَفِرَّ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4158
    },
    {
      "hadithNumber": 4159,
      "english": {
        "narrated": "It was narrated that Yazid bin Abi 'Ubaid said:",
        "hadith": "\"I said to Salamah bin Al-Akwa': 'What pledge did you make to the Prophet on the Day of Al-Hudaibiyyah?' He said: 'For death.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، قَالَ قُلْتُ لِسَلَمَةَ بْنِ الأَكْوَعِ عَلَى أَىِّ شَىْءٍ بَايَعْتُمُ النَّبِيَّ صلى الله عليه وسلم يَوْمَ الْحُدَيْبِيَةِ قَالَ عَلَى الْمَوْتِ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4159
    },
    {
      "hadithNumber": 4160,
      "english": {
        "narrated": "It was narrated that Ya'la bin Umayyah said:",
        "hadith": "\"I came to the Messenger of Allah with my father Umayyah on the Day of the Conquest (of Makkah) and said: 'O Messenger of Allah, accept my father's pledge for emigration (Al-Hijrah).' The Messenger of Allah said: 'I will accept his pledge to fight in Jihad, for the emigration (Al-Hijrah) has ceased.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ أُبَايِعُهُ عَلَى الْجِهَادِ وَقَدِ انْقَطَعَتِ الْهِجْرَةُ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4160
    },
    {
      "hadithNumber": 4161,
      "english": {
        "narrated": "It was narrated that 'Ubadah bin As-Samit said:",
        "hadith": "\"While there was a group of his companions around him, the Messenger of Allah said: 'Pledge to me, that you will not associate anything with Allah, nor steal, nor commit unlawful sexual relations, nor kill your children; you will not utter slander, fabricating from between your hands and feet, and you will not disobey me in goodness (Ma'ruf). Whoever fulfills (this pledge), his reward will be with Allah, and whoever commits any of these actions and is punished for it, it will be an expiation for him. Whoever commits any of these actions then Allah conceals him, then his affair is up to Allah; if He wills He will forgive him, and if He wills punish him.\"' (Sahih)\nAhmed bin Sa'eed contradicted him.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ تُبَايِعُونِي عَلَى أَنْ لاَ تُشْرِكُوا بِاللَّهِ شَيْئًا وَلاَ تَسْرِقُوا وَلاَ تَزْنُوا وَلاَ تَقْتُلُوا أَوْلاَدَكُمْ وَلاَ تَأْتُوا بِبُهْتَانٍ تَفْتَرُونَهُ بَيْنَ أَيْدِيكُمْ وَأَرْجُلِكُمْ وَلاَ تَعْصُونِي فِي مَعْرُوفٍ فَمَنْ وَفَّى فَأَجْرُهُ عَلَى اللَّهِ وَمَنْ أَصَابَ مِنْكُمْ شَيْئًا فَعُوقِبَ بِهِ فَهُوَ لَهُ كَفَّارَةٌ وَمَنْ أَصَابَ مِنْ ذَلِكَ شَيْئًا ثُمَّ سَتَرَهُ اللَّهُ فَأَمْرُهُ إِلَى اللَّهِ إِنْ شَاءَ عَفَا عَنْهُ وَإِنْ شَاءَ عَاقَبَهُ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4161
    },
    {
      "hadithNumber": 4162,
      "english": {
        "narrated": "It was narrated from 'Ubadah bin As-Samit that the Messenger of Allah said:",
        "hadith": "\"Why don't you pledge to me upon that which the women have pledged: That you will not associate anything with Allah, that you will not steal, that you will not have unlawful sexual relations, that you will not utter slander, fabricating from between your hands and feet, and that you will not disobey me in goodness (Ma'ruf)?\" We said: \"yes, O Messenger of Allah.\" So we gave him our pledge, on that basis. The Messenger of Allah said: \"Whoever commits any of these actions after that, and is punished, that will be an expiation. Whoever is not punished, then his affair is up to Allah; if He wills, He will forgive him, and if He wills, He will punish him.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنِي أَحْمَدُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا يَعْقُوبُ، قَالَ حَدَّثَنَا أَبِي، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنِ الْحَارِثِ بْنِ فُضَيْلٍ، أَنَّ ابْنَ شِهَابٍ، حَدَّثَهُ عَنْ عُبَادَةَ بْنِ الصَّامِتِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ أَلاَ تُبَايِعُونِي عَلَى مَا بَايَعَ عَلَيْهِ النِّسَاءُ أَنْ لاَ تُشْرِكُوا بِاللَّهِ شَيْئًا وَلاَ تَسْرِقُوا وَلاَ تَزْنُوا وَلاَ تَقْتُلُوا أَوْلاَدَكُمْ وَلاَ تَأْتُوا بِبُهْتَانٍ تَفْتَرُونَهُ بَيْنَ أَيْدِيكُمْ وَأَرْجُلِكُمْ وَلاَ تَعْصُونِي فِي مَعْرُوفٍ ‏\"‏ ‏.‏ قُلْنَا بَلَى يَا رَسُولَ اللَّهِ فَبَايَعْنَاهُ عَلَى ذَلِكَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَمَنْ أَصَابَ بَعْدَ ذَلِكَ شَيْئًا فَنَالَتْهُ عُقُوبَةٌ فَهُوَ كَفَّارَةٌ وَمَنْ لَمْ تَنَلْهُ عُقُوبَةٌ فَأَمْرُهُ إِلَى اللَّهِ إِنْ شَاءَ غَفَرَ لَهُ وَإِنْ شَاءَ عَاقَبَهُ ‏\"‏ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4162
    },
    {
      "hadithNumber": 4163,
      "english": {
        "narrated": "It was narrated from 'Abdullah bin 'Amr that a man came to the Prophet and said:",
        "hadith": "\"I have come pledging to emigrate (Hijrah), and I have left my parents weeping.\" He said: \"Go back to them, and make them smile as you made them weep.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ ارْجِعْ إِلَيْهِمَا فَأَضْحِكْهُمَا كَمَا أَبْكَيْتَهُمَا ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4163
    },
    {
      "hadithNumber": 4164,
      "english": {
        "narrated": "It was narrated from Abu Sa'eed that:",
        "hadith": "a Bedouin asked the Messenger of Allah about emigration (Hijrah). He said: \"Woe to you, emigration is very important. Do you have any camels?\" He said: \"Yes. He said: \"Do you pay Sadaqah on them?\" He said: \"Yes.\" He said: \"Do righteous deeds no matter how far away you are from the Muslims, for Allah, the Mighty and sublime, will never cause any of your deeds tobe lost.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ، قَالَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، عَنِ الزُّهْرِيِّ، عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ، عَنْ أَبِي سَعِيدٍ، أَنَّ أَعْرَابِيًّا، سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الْهِجْرَةِ فَقَالَ ‏\"‏ وَيْحَكَ إِنَّ شَأْنَ الْهِجْرَةِ شَدِيدٌ فَهَلْ لَكَ مِنْ إِبِلٍ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ فَهَلْ تُؤَدِّي صَدَقَتَهَا ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ فَاعْمَلْ مِنْ وَرَاءِ الْبِحَارِ فَإِنَّ اللَّهَ عَزَّ وَجَلَّ لَنْ يَتِرَكَ مِنْ عَمَلِكَ شَيْئًا ‏\"‏ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4164
    },
    {
      "hadithNumber": 4165,
      "english": {
        "narrated": "It was narrated that 'Abdullah bin 'Amr said:",
        "hadith": "\"A man said: 'O Messenger of Allah! Which emigration (Hijrah) is best?' He said: 'To leave what your Lord, the Mighty and Sublime, dislikes.' He said: 'There are two kinds of emigration, the emigration of the town dweller and the emigration of the Bedouin. As for the Bedouin, when he is called (to fight in Jihad) he must respond, and he must obey when he is commanded, and as for the town dweller, he is the one who is more severely tested and more greatly rewarded.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ، عَنْ أَبِي كَثِيرٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَىُّ الْهِجْرَةِ أَفْضَلُ قَالَ ‏\"‏ أَنْ تَهْجُرَ مَا كَرِهَ رَبُّكَ عَزَّ وَجَلَّ ‏\"‏ ‏.‏ وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ الْهِجْرَةُ هِجْرَتَانِ هِجْرَةُ الْحَاضِرِ وَهِجْرَةُ الْبَادِي فَأَمَّا الْبَادِي فَيُجِيبُ إِذَا دُعِيَ وَيُطِيعُ إِذَا أُمِرَ وَأَمَّا الْحَاضِرُ فَهُوَ أَعْظَمُهُمَا بَلِيَّةً وَأَعْظَمُهُمَا أَجْرًا ‏\"‏ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4165
    },
    {
      "hadithNumber": 4166,
      "english": {
        "narrated": "It was narrated that Jabir bin Zaid said:",
        "hadith": "\"Ibn 'Abbas said:\n'The Messenger of Allah (ﷺ), Abu Bakr and 'Umar were among the Muhajirin (emigrants), because they forsook (hajaru) the idolators, and\nsome of the Ansar were Muhajirun because Al-Madinah was a land of shirk, and they came to the Messenger of Allah (ﷺ) on the Night of Al-'Aqabah.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا الْحُسَيْنُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا مُبَشِّرُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا سُفْيَانُ بْنُ حُسَيْنٍ، عَنْ يَعْلَى بْنِ مُسْلِمٍ، عَنْ جَابِرِ بْنِ زَيْدٍ، قَالَ قَالَ ابْنُ عَبَّاسٍ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم وَأَبَا بَكْرٍ وَعُمَرَ كَانُوا مِنَ الْمُهَاجِرِينَ لأَنَّهُمْ هَجَرُوا الْمُشْرِكِينَ وَكَانَ مِنَ الأَنْصَارِ مُهَاجِرُونَ لأَنَّ الْمَدِينَةَ كَانَتْ دَارَ شِرْكٍ فَجَاءُوا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم لَيْلَةَ الْعَقَبَةِ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4166
    },
    {
      "hadithNumber": 4167,
      "english": {
        "narrated": "It was narrated from Kathir bin Murrah that Abu Fatimah told him that he said:",
        "hadith": "\"O Messenger of Allah, tell me of an action that I may do and persist in it.\" The Messenger of Allah said to him: \"You should emigrate, for there is nothing like it.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ عَلَيْكَ بِالْهِجْرَةِ فَإِنَّهُ لاَ مِثْلَ لَهَا ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4167
    },
    {
      "hadithNumber": 4168,
      "english": {
        "narrated": "It was narrated from 'Amr bin 'Abdur-Rahman bin Umayyah that his father told him that Ya'la said:",
        "hadith": "\"I came to the Messenger of Allah with my father on the day of the Conquest (of Makkah) and said: 'O Messenger of Allah, accept my father's pledge to emigrate.' The Messenger of Allah said: 'I will accept his pledge for Jihad, for the emigration (Hijrah) has ceased.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ أُبَايِعُهُ عَلَى الْجِهَادِ وَقَدِ انْقَطَعَتِ الْهِجْرَةُ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4168
    },
    {
      "hadithNumber": 4169,
      "english": {
        "narrated": "It was narrated that Safwan bin Umayyah said:",
        "hadith": "\"I said: 'O Messenger of Allah, they are saying that no one will enter Paradise except a Muhajir.\"' He said: \"There is no more emigration  (Hijrah) after the Conquest of Makkah, rather there is Jihad and intention. When you are called to moblize (for Jihad) then do so.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لاَ هِجْرَةَ بَعْدَ فَتْحِ مَكَّةَ وَلَكِنْ جِهَادٌ وَنِيَّةٌ فَإِذَا اسْتُنْفِرْتُمْ فَانْفِرُوا ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4169
    },
    {
      "hadithNumber": 4170,
      "english": {
        "narrated": "It was narrated that Ibn 'Abbas said:",
        "hadith": "\"The Messenger of Allah said on the Day of the Conquest (of Makkah): \"There is no more emigration (Hijrah), rather there is Jihad and intention. When you are called to moblize (for Jihad) then do so.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لاَ هِجْرَةَ وَلَكِنْ جِهَادٌ وَنِيَّةٌ فَإِذَا اسْتُنْفِرْتُمْ فَانْفِرُوا ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4170
    },
    {
      "hadithNumber": 4171,
      "english": {
        "narrated": "It was narrated that Nu'aim bin Dijajah said:",
        "hadith": "\"I heard 'Umar bin Al-Khattab say: 'There is no more emigration (Hijrah) after the death of the Messenger of Allah.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، عَنْ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ يَحْيَى بْنِ هَانِئٍ، عَنْ نُعَيْمِ بْنِ دِجَاجَةَ، قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ، يَقُولُ لاَ هِجْرَةَ بَعْدَ وَفَاةِ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4171
    },
    {
      "hadithNumber": 4172,
      "english": {
        "narrated": "It was narrated that 'Abdullah bin Waqdan As-Sa'di said:",
        "hadith": "\"We came in a delegation to the messenger of Allah, each of us with a question to ask him. I was the last of them to come in to the Messenger of Allah, and I said: 'O Messenger of Allah, I have left people behind me, and they are saying that emigration (Hijrah) has ceased.' He said: 'Emigration will not cease so long as the disbelievers are being fought.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لاَ تَنْقَطِعُ الْهِجْرَةُ مَا قُوتِلَ الْكُفَّارُ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4172
    },
    {
      "hadithNumber": 4173,
      "english": {
        "narrated": "It was narrated that 'Abdullah bin As-Sa'di said:",
        "hadith": "\"We came in a delegation to the Messenger of Allah and my companions entered and asked their questions. I was the last of them to enter, and he said: 'What is you question?' I said: 'O Messenger of Allah, when will emigration end?' The Messenger of Allah said: 'Emigration will not cease so long as the disbelievers are being fought.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا مَحْمُودُ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْعَلاَءِ بْنِ زَبْرٍ، قَالَ حَدَّثَنِي بُسْرُ بْنُ عُبَيْدِ اللَّهِ، عَنْ أَبِي إِدْرِيسَ الْخَوْلاَنِيِّ، عَنْ حَسَّانَ بْنِ عَبْدِ اللَّهِ الضَّمْرِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ السَّعْدِيِّ، قَالَ وَفَدْنَا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَدَخَلَ أَصْحَابِي فَقَضَى حَاجَتَهُمْ وَكُنْتُ آخِرَهُمْ دُخُولاً فَقَالَ ‏\"‏ حَاجَتُكَ ‏\"‏ ‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ مَتَى تَنْقَطِعُ الْهِجْرَةُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَنْقَطِعُ الْهِجْرَةُ مَا قُوتِلَ الْكُفَّارُ ‏\"‏ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4173
    },
    {
      "hadithNumber": 4174,
      "english": {
        "narrated": "Jarir said:",
        "hadith": "\"I came to the Prophet and said to him: 'I pledge to you to hear and obey in what I like and what I dislike.' The Prophet said: 'Can you do that, O Jarir,' or, 'Are you able for that?' He said: Say: As much as I can.' So he accepted my pledge (for that), and that I be sincere toward every Muslim.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنِي مُحَمَّدُ بْنُ قُدَامَةَ، عَنْ جَرِيرٍ، عَنْ مُغِيرَةَ، عَنْ أَبِي وَائِلٍ، وَالشَّعْبِيِّ، قَالاَ قَالَ جَرِيرٌ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَقُلْتُ لَهُ أُبَايِعُكَ عَلَى السَّمْعِ وَالطَّاعَةِ فِيمَا أَحْبَبْتُ وَفِيمَا كَرِهْتُ ‏.‏ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَوَتَسْتَطِيعُ ذَلِكَ يَا جَرِيرُ أَوَتُطِيقُ ذَلِكَ ‏\"‏ ‏.‏ قَالَ ‏\"‏ قُلْ فِيمَا اسْتَطَعْتُ ‏\"‏ ‏.‏ فَبَايَعَنِي وَالنُّصْحِ لِكُلِّ مُسْلِمٍ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4174
    },
    {
      "hadithNumber": 4175,
      "english": {
        "narrated": "It was narrated that Jarir said:",
        "hadith": "I pledged to the Messenger of Allah (ﷺ) to perform Salah, pay the Zakah, be sincere toward every Muslim and forsake the idolaters.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا بِشْرُ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، عَنْ أَبِي وَائِلٍ، عَنْ جَرِيرٍ، قَالَ بَايَعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى إِقَامِ الصَّلاَةِ وَإِيتَاءِ الزَّكَاةِ وَالنُّصْحِ لِكُلِّ مُسْلِمٍ وَعَلَى فِرَاقِ الْمُشْرِكِ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4175
    },
    {
      "hadithNumber": 4176,
      "english": {
        "narrated": "It was narrated that Jarir said:",
        "hadith": "\"I came to the Messenger of Allah\" and he mentioned something similar.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنِي مُحَمَّدُ بْنُ يَحْيَى بْنِ مُحَمَّدٍ، قَالَ حَدَّثَنَا الْحَسَنُ بْنُ الرَّبِيعِ، قَالَ حَدَّثَنَا أَبُو الأَحْوَصِ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ أَبِي نُخَيْلَةَ، عَنْ جَرِيرٍ، قَالَ أَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَذَكَرَ نَحْوَهُ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4176
    },
    {
      "hadithNumber": 4177,
      "english": {
        "narrated": "Jarir said:",
        "hadith": "\"I came to the Prophet when he was accepting (the people's) pledge, and said: 'O Messenger of Allah, extend you hand so that I may give you my pledge, and state your terms, for you know best.' He said: 'I accept you pledge that you will worship Allah, establish Salah, pay the Zakah, be sincere toward the Muslims, and forsake the idolaters.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ أُبَايِعُكَ عَلَى أَنْ تَعْبُدَ اللَّهَ وَتُقِيمَ الصَّلاَةَ وَتُؤْتِيَ الزَّكَاةَ وَتُنَاصِحَ الْمُسْلِمِينَ وَتُفَارِقَ الْمُشْرِكِينَ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4177
    },
    {
      "hadithNumber": 4178,
      "english": {
        "narrated": "It was narrated that Abu Idris Al-Khawlani said:",
        "hadith": "\"I heard 'Ubadah bin As-Samit say: 'I pledged to the Messenger of Allah among a group of people, and he said: I accept your pledge that you will not associate anything with Allah, you will not steal, you will not have unlawful sexual relations, you will not kill you children, you will not utter slander, fabricating from between your hands and feet, and you will not disobey me when commanded with goodness. Whoever fulfills (this pledge), his reward will be with Allah, and whoever commits any of these actions and is punished for it, it will be purification for him. Whoever (commits any of these action then) Allah conceals him, it is up to Allah; if He wills He will forgive him, and if He wills, He will punish him.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ أُبَايِعُكُمْ عَلَى أَنْ لاَ تُشْرِكُوا بِاللَّهِ شَيْئًا وَلاَ تَسْرِقُوا وَلاَ تَزْنُوا وَلاَ تَقْتُلُوا أَوْلاَدَكُمْ وَلاَ تَأْتُوا بِبُهْتَانٍ تَفْتَرُونَهُ بَيْنَ أَيْدِيكُمْ وَأَرْجُلِكُمْ وَلاَ تَعْصُونِي فِي مَعْرُوفٍ فَمَنْ وَفَّى مِنْكُمْ فَأَجْرُهُ عَلَى اللَّهِ وَمَنْ أَصَابَ مِنْ ذَلِكَ شَيْئًا فَعُوقِبَ فِيهِ فَهُوَ طَهُورُهُ وَمَنْ سَتَرَهُ اللَّهُ فَذَاكَ إِلَى اللَّهِ إِنْ شَاءَ عَذَّبَهُ وَإِنْ شَاءَ غَفَرَ لَهُ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4178
    },
    {
      "hadithNumber": 4179,
      "english": {
        "narrated": "It was narrated that Umm 'Atiyyah said:",
        "hadith": "\"When I wanted to give pledge to the Messenger of Allah, I said: 'O Messenger of Allah, women helped me (in wailing for the dead) during the Jahiliyyah; shall I go and help her (in wailing) and then come to you and give you my oath of allegiance?' He said: 'Go and help her.' So I went and helped her, then I came, and gave my pledge to the Messenger of Allah.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ اذْهَبِي فَأَسْعِدِيهَا ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4179
    },
    {
      "hadithNumber": 4180,
      "english": {
        "narrated": "It was narrated that Umm 'Atiyyah said:",
        "hadith": "\"The Messenger of Allah accepted our pledge that we would not wail (for the dead).\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا الْحَسَنُ بْنُ أَحْمَدَ، قَالَ حَدَّثَنَا أَبُو الرَّبِيعِ، قَالَ أَنْبَأَنَا حَمَّادٌ، قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدٍ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ أَخَذَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم الْبَيْعَةَ عَلَى أَنْ لاَ نَنُوحَ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4180
    },
    {
      "hadithNumber": 4181,
      "english": {
        "narrated": "It was narrated that Umaimah bint Ruqaiqah said:",
        "hadith": "\"I came to the Prophet with some other Ansari women to give our pledge. We said: 'O Messenger of Allah, we give you our pledge that we will not associate anything with Allah, we will not steal, we will not have unlawful sexual relations, we will not utter slander, fabricating from between our hands and feet, and we will not disobey you in goodness.' He said: 'As much as you can and are able.' We said: 'Allah and His Messenger are more merciful toward us. Com, let us give you our pledge, O Messenger of Allah! The Messenger of Allah said: 'I do not shake hands with women. Rather my word to a hundred women is like my word to one woman.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ أُمَيْمَةَ بِنْتِ رُقَيْقَةَ، أَنَّهَا قَالَتْ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فِي نِسْوَةٍ مِنَ الأَنْصَارِ نُبَايِعُهُ فَقُلْنَا يَا رَسُولَ اللَّهِ نُبَايِعُكَ عَلَى أَنْ لاَ نُشْرِكَ بِاللَّهِ شَيْئًا وَلاَ نَسْرِقَ وَلاَ نَزْنِيَ وَلاَ نَأْتِيَ بِبُهْتَانٍ نَفْتَرِيهِ بَيْنَ أَيْدِينَا وَأَرْجُلِنَا وَلاَ نَعْصِيَكَ فِي مَعْرُوفٍ ‏.‏ قَالَ ‏\"‏ فِيمَا اسْتَطَعْتُنَّ وَأَطَقْتُنَّ ‏\"‏ ‏.‏ قَالَتْ قُلْنَا اللَّهُ وَرَسُولُهُ أَرْحَمُ بِنَا هَلُمَّ نُبَايِعْكَ يَا رَسُولَ اللَّهِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنِّي لاَ أُصَافِحُ النِّسَاءَ إِنَّمَا قَوْلِي لِمِائَةِ امْرَأَةٍ كَقَوْلِي لاِمْرَأَةٍ وَاحِدَةٍ أَوْ مِثْلِ قَوْلِي لاِمْرَأَةٍ وَاحِدَةٍ ‏\"‏ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4181
    },
    {
      "hadithNumber": 4182,
      "english": {
        "narrated": "It was narrted from a man from Al Ash-Sharid, who was called 'Amr, that his father said:",
        "hadith": "\"Among the delegation of Thaqif there was a man who suffered from leprosy. The Prophet sent word to him saying: 'Go back, for I have accepted your pledge.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ ارْجِعْ فَقَدْ بَايَعْتُكَ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4182
    },
    {
      "hadithNumber": 4183,
      "english": {
        "narrated": "It was narrated that Al-Hirmas bin Ziyad said:",
        "hadith": "\"I stretched forth my hand to the Prophet for him to accept my pledge, when I was a child, but he did not accept my pledge.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنِ مُحَمَّدِ بْنِ سَلاَّمٍ، قَالَ حَدَّثَنَا عُمَرُ بْنُ يُونُسَ، عَنْ عِكْرِمَةَ بْنِ عَمَّارٍ، عَنِ الْهِرْمَاسِ بْنِ زِيَادٍ، قَالَ مَدَدْتُ يَدِي إِلَى النَّبِيِّ صلى الله عليه وسلم وَأَنَا غُلاَمٌ لِيُبَايِعَنِي فَلَمْ يُبَايِعْنِي ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4183
    },
    {
      "hadithNumber": 4184,
      "english": {
        "narrated": "It was narrated that jabir said:",
        "hadith": "\"A slave came and pledged to the Prophet to emigrate, and the Prophet did not realize that he was a slave. Then his master came looking for him. The Prophet said: 'Sell him to me,' and he bought him for two black slaves. Then he did not accept the pledge from anyone until he asked: 'Is he a slave?\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ بِعْنِيهِ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4184
    },
    {
      "hadithNumber": 4185,
      "english": {
        "narrated": "It was narrated from Jabir bin 'Abdullah that:",
        "hadith": "a Bedouin pledged Islam to the Messenger of Allah, then the Bedouin was stricken with the fever in Al-Madinah. So he came to the Messenger of Allah and said: \"O Messenger of Allah, cancel my pledge,\" but he refused. Then he came to him again and said: \"Cancel my pledge,\" but he refused. Then he came to him again and said: \"Cancel my pledge,\" but he refused. Then the Bedouin left (Al-Madinah) and the Messenger of Allah sadi: \"Al-Madinah his like the bellows; it expels its dross and brightness its good.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنَّمَا الْمَدِينَةُ كَالْكِيرِ تَنْفِي خَبَثَهَا وَتَنْصَعُ طَيِّبَهَا ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4185
    },
    {
      "hadithNumber": 4186,
      "english": {
        "narrated": "It was narrated from Salamah bin Al-Akwa ' that he entered upon Al-Hajjaj who said:",
        "hadith": "O son of Al-Akwa, you have turned on your heels (i.e., deserted Islam) by staying in the desert with the Bedouins.\" He said: \"No; the Messenger of Allah gave me permission to stay in the desert with the Bedouins.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، عَنْ سَلَمَةَ بْنِ الأَكْوَعِ، أَنَّهُ دَخَلَ عَلَى الْحَجَّاجِ فَقَالَ يَا ابْنَ الأَكْوَعِ ارْتَدَدْتَ عَلَى عَقِبَيْكَ وَذَكَرَ كَلِمَةً مَعْنَاهَا وَبَدَوْتَ ‏.‏ قَالَ لاَ وَلَكِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَذِنَ لِي فِي الْبُدُوِّ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4186
    },
    {
      "hadithNumber": 4187,
      "english": {
        "narrated": "It was narrated that Ibn 'Umar said:",
        "hadith": "\"We used to pledge to the Messenger of Allah to hear and obey, the he said: 'In as much as you can.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، ح وَأَخْبَرَنِي عَلِيُّ بْنُ حُجْرٍ، عَنْ إِسْمَاعِيلَ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، قَالَ كُنَّا نُبَايِعُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى السَّمْعِ وَالطَّاعَةِ ثُمَّ يَقُولُ ‏\"‏ فِيمَا اسْتَطَعْتَ ‏\"‏ ‏.‏ وَقَالَ عَلِيٌّ ‏\"‏ فِيمَا اسْتَطَعْتُمْ ‏\"‏ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4187
    },
    {
      "hadithNumber": 4188,
      "english": {
        "narrated": "Ibn 'Umar said:",
        "hadith": "\"When we gave our pledge to the Messenger of Allah to hear and obey, he would say to us: 'In as much as you can\".",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ فِيمَا اسْتَطَعْتُمْ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4188
    },
    {
      "hadithNumber": 4189,
      "english": {
        "narrated": "It was narrated that Jarir bin 'Abdullah said:",
        "hadith": "\"I gave my pledge to the Prophet to hear and obey, and he told me to add the words.' In as much as you can, and to be since toward every Muslim\"'. (Sahih) '",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ فِيمَا اسْتَطَعْتَ وَالنُّصْحِ لِكُلِّ مُسْلِمٍ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4189
    },
    {
      "hadithNumber": 4190,
      "english": {
        "narrated": "It was narrated that Umaimah bin Ruqaiqah said:",
        "hadith": "\"We gave pledge to the Messenger of Allah among a group of women, and he said to us: 'In as much as you can and are able .\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ فِيمَا اسْتَطَعْتُنَّ وَأَطَقْتُنَّ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4190
    },
    {
      "hadithNumber": 4191,
      "english": {
        "narrated": "It was narrated that 'Abdur-Rahman bin 'Abd Rabb Al-Kabah said:",
        "hadith": "\" I came to 'Abdullah bin Amr bin Al-As while he was sitting in the shade of Kabah, and the people were gathered around him, and I heard him say: 'While we were with the Messenger of Allah on a journey, we stopped to camp, and some of us were pitching tents, some were competing in shooting arrows, and some were taking the animals out to race them. Then the caller of the Prophet called out: As-Salatu Jamiah (prayer is about to begin). So we gathered, and the Messenger of Allah stood up and addressed us. He said: There has a never been a prophet before me who was not obliged to tell his nation of what he knew was good for them, and to warn against that he knew was bad for them. With regard to Ummah of yours, soundness (of religious commitment) has been placed in its earlier generations, and the last of them will be afflicted with calamities and things that you dislike. Then there will come tribulations which will make the earlier ones pale into significances, and the believer will say: This will be then end of me, then relief will come. Then (more) tribulations will come and the believer will say: this will be the end of me, then relief will come. Whoever would like to be taken far away from the Fire and admitted to Paradise, let him die believing in Allah and the Last Day, and let him treat people as he would like to be treated. Whoever pledges to a ruler and gives him the grasp of his hand and the sincerity of his heart, the let him obey him as much as he can, and if another comes and challenges him, let them strike the neck of (i.e., kill) the second one.\"'\nHe said: \" I drew near to him and said: 'Did you hear the Messenger of Allah say that? He 'Yes, and quoted the Hadith without interruption (in the chain)",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنَّهُ لَمْ يَكُنْ نَبِيٌّ قَبْلِي إِلاَّ كَانَ حَقًّا عَلَيْهِ أَنْ يَدُلَّ أُمَّتَهُ عَلَى مَا يَعْلَمُهُ خَيْرًا لَهُمْ وَيُنْذِرَهُمْ مَا يَعْلَمُهُ شَرًّا لَهُمْ وَإِنَّ أُمَّتَكُمْ هَذِهِ جُعِلَتْ عَافِيَتُهَا فِي أَوَّلِهَا وَإِنَّ آخِرَهَا سَيُصِيبُهُمْ بَلاَءٌ وَأُمُورٌ يُنْكِرُونَهَا تَجِيءُ فِتَنٌ فَيُدَقِّقُ بَعْضُهَا لِبَعْضٍ فَتَجِيءُ الْفِتْنَةُ فَيَقُولُ الْمُؤْمِنُ هَذِهِ مُهْلِكَتِي ثُمَّ تَنْكَشِفُ ثُمَّ تَجِيءُ فَيَقُولُ هَذِهِ مُهْلِكَتِي ثُمَّ تَنْكَشِفُ فَمَنْ أَحَبَّ مِنْكُمْ أَنْ يُزَحْزَحَ عَنِ النَّارِ وَيُدْخَلَ الْجَنَّةَ فَلْتُدْرِكْهُ مَوْتَتُهُ وَهُوَ مُؤْمِنٌ بِاللَّهِ وَالْيَوْمِ الآخِرِ وَلْيَأْتِ إِلَى النَّاسِ مَا يُحِبُّ أَنْ يُؤْتَى إِلَيْهِ وَمَنْ بَايَعَ إِمَامًا فَأَعْطَاهُ صَفْقَةَ يَدِهِ وَثَمَرَةَ قَلْبِهِ فَلْيُطِعْهُ مَا اسْتَطَاعَ فَإِنْ جَاءَ أَحَدٌ يُنَازِعُهُ فَاضْرِبُوا رَقَبَةَ الآخَرِ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4191
    },
    {
      "hadithNumber": 4192,
      "english": {
        "narrated": "It was narrated that Yahya bin Husain said:",
        "hadith": "\"I heard my grandmother say: 'I heard the Messenger of Allah say, during the Farewell Pilgrimage: If an Ethiopian slave is appointed over you who rules according to the Book of Allah, then listen to him and obey.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ وَلَوِ اسْتُعْمِلَ عَلَيْكُمْ عَبْدٌ حَبَشِيٌّ يَقُودُكُمْ بِكِتَابِ اللَّهِ فَاسْمَعُوا لَهُ وَأَطِيعُوا ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4192
    },
    {
      "hadithNumber": 4193,
      "english": {
        "narrated": "Abu Hurairah said:",
        "hadith": "\"The Messenger of Allah said: 'Whoever obeys me, obeys Allah, and whoever disobeys me, disobeys Allah. Whoever obeys my governor (Amir), he has obeyed me, and whoever disobeys my governor, he has disobeyed me.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مَنْ أَطَاعَنِي فَقَدْ أَطَاعَ اللَّهَ وَمَنْ عَصَانِي فَقَدْ عَصَى اللَّهَ وَمَنْ أَطَاعَ أَمِيرِي فَقَدْ أَطَاعَنِي وَمَنْ عَصَى أَمِيرِي فَقَدْ عَصَانِي ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4193
    },
    {
      "hadithNumber": 4194,
      "english": {
        "narrated": "It was narrated from Ibn 'Abbas (concerning the Verse):",
        "hadith": "\"O you who believe! Obey Allah and obey the Messenger (Muhammad). That he said: This was revealed concerning 'Abdullah bin Hudhaifah bin Qais bin 'Adiyy, whom the Messenger of Allah appointed in charge of an expedition\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا الْحَسَنُ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا حَجَّاجٌ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي يَعْلَى بْنُ مُسْلِمٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، ‏{‏ يَا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ ‏}‏ قَالَ نَزَلَتْ فِي عَبْدِ اللَّهِ بْنِ حُذَافَةَ بْنِ قَيْسِ بْنِ عَدِيٍّ بَعَثَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي سَرِيَّةٍ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4194
    },
    {
      "hadithNumber": 4195,
      "english": {
        "narrated": "It was narrated from Muadah bin Jabal that the Messenger of Allah said:",
        "hadith": "\"Military campaigns are of two types: as for the one who seeks the Face of Allah, obeys the imam, spends what is precious and avoids mischief, whether he is asleep or awake, he is earning reward. But as for the one who fights in order to show off and gain a reputation, and disobeys the imam and spreads mischief in the land, he comes back empty-handed.\" (Da 'if)",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ الْغَزْوُ غَزْوَانِ فَأَمَّا مَنِ ابْتَغَى وَجْهَ اللَّهِ وَأَطَاعَ الإِمَامَ وَأَنْفَقَ الْكَرِيمَةَ وَاجْتَنَبَ الْفَسَادَ فَإِنَّ نَوْمَهُ وَنُبْهَتَهُ أَجْرٌ كُلُّهُ وَأَمَّا مَنْ غَزَا رِيَاءً وَسُمْعَةً وَعَصَى الإِمَامَ وَأَفْسَدَ فِي الأَرْضِ فَإِنَّهُ لاَ يَرْجِعُ بِالْكَفَافِ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4195
    },
    {
      "hadithNumber": 4196,
      "english": {
        "narrated": "Abu Hurairah narrated that the Messenger of Allah said:",
        "hadith": "\"The Imam is like a shield whose orders should be obeyed when they (the Muslims) fight, and where they should seek protection. If he enjoins fear of Allah and behaves justly, then he will be rewarded, but if he enjoins otherwise, then it will be a burden (of sin) on him.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنَّمَا الإِمَامُ جُنَّةٌ يُقَاتَلُ مِنْ وَرَائِهِ وَيُتَّقَى بِهِ فَإِنْ أَمَرَ بِتَقْوَى اللَّهِ وَعَدَلَ فَإِنَّ لَهُ بِذَلِكَ أَجْرًا وَإِنْ أَمَرَ بِغَيْرِهِ فَإِنَّ عَلَيْهِ وِزْرًا ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4196
    },
    {
      "hadithNumber": 4197,
      "english": {
        "narrated": "It was narrated that Tamim Ad-Dari said:",
        "hadith": "\"The Messenger of Allah said: 'Religion is sincerity (An-Nasihah).' They said: 'To whom, O Messenger of Allah?' he said: 'To Allah, to His Book, to His Messenger, to the imams of the Muslims, and to their common folk.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ سَأَلْتُ سُهَيْلَ بْنَ أَبِي صَالِحٍ قُلْتُ حَدَّثَنَا عَمْرٌو، عَنِ الْقَعْقَاعِ، عَنْ أَبِيكَ، قَالَ أَنَا سَمِعْتُهُ مِنَ الَّذِي، حَدَّثَ أَبِي، حَدَّثَهُ رَجُلٌ، مِنْ أَهْلِ الشَّامِ يُقَالُ لَهُ عَطَاءُ بْنُ يَزِيدَ عَنْ تَمِيمٍ الدَّارِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّمَا الدِّينُ النَّصِيحَةُ ‏\"‏ ‏.‏ قَالُوا لِمَنْ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ لِلَّهِ وَلِكِتَابِهِ وَلِرَسُولِهِ وَلأَئِمَّةِ الْمُسْلِمِينَ وَعَامَّتِهِمْ ‏\"‏ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4197
    },
    {
      "hadithNumber": 4198,
      "english": {
        "narrated": "It was narrated that Tamim Ad-Dari said:",
        "hadith": "\"The Messenger of Allah said: 'Religion is sincerity (An-Nasihah).' They said: 'To whom, O Messenger of Allah? He said: 'To Allah, to His Book, to His Messenger, to the imams of the Muslims and to their common folk\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ عَطَاءِ بْنِ يَزِيدَ، عَنْ تَمِيمٍ الدَّارِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّمَا الدِّينُ النَّصِيحَةُ ‏\"‏ ‏.‏ قَالُوا لِمَنْ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ لِلَّهِ وَلِكِتَابِهِ وَلِرَسُولِهِ وَلأَئِمَّةِ الْمُسْلِمِينَ وَعَامَّتِهِمْ ‏\"‏ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4198
    },
    {
      "hadithNumber": 4199,
      "english": {
        "narrated": "It was narrated from Abu Hurairah that the Messenger of Allah said:",
        "hadith": "\"Religion is sincerity, religion is sincerity (Al-Nasihah), religion is sincerity.\" They said; \"To whom, O Messenger of Allah?\" He said: \"To Allah, to His Book, to His Messenger, to the imams of the Muslims and to their common folk.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا شُعَيْبُ بْنُ اللَّيْثِ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ عَجْلاَنَ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنِ الْقَعْقَاعِ بْنِ حَكِيمٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ الدِّينَ النَّصِيحَةُ إِنَّ الدِّينَ النَّصِيحَةُ إِنَّ الدِّينَ النَّصِيحَةُ ‏\"‏ ‏.‏ قَالُوا لِمَنْ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ لِلَّهِ وَلِكِتَابِهِ وَلِرَسُولِهِ وَلأَئِمَّةِ الْمُسْلِمِينَ وَعَامَّتِهِمْ ‏\"‏ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4199
    },
    {
      "hadithNumber": 4200,
      "english": {
        "narrated": "It was narrated from Abu Hurairah that the Messenger of Allah said:",
        "hadith": "\"Religion is sincerity (An-Nasihah).\" The said: \"To whom, O Messenger of Allah?\" he said: \"To Allah, to His Book, to His Messenger, to the imams of the Muslims and to their common folk.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا عَبْدُ الْقُدُّوسِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الْكَبِيرِ بْنِ شُعَيْبِ بْنِ الْحَبْحَابِ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَهْضَمٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنِ ابْنِ عَجْلاَنَ، عَنِ الْقَعْقَاعِ بْنِ حَكِيمٍ، وَعَنْ سُمَىٍّ، وَعَنْ عُبَيْدِ اللَّهِ بْنِ مِقْسَمٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ الدِّينُ النَّصِيحَةُ ‏\"‏ ‏.‏ قَالُوا لِمَنْ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ لِلَّهِ وَلِكِتَابِهِ وَلِرَسُولِهِ وَلأَئِمَّةِ الْمُسْلِمِينَ وَعَامَّتِهِمْ ‏\"‏ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4200
    },
    {
      "hadithNumber": 4201,
      "english": {
        "narrated": "It was narrated that Abu Hurairah said \" The Messenger of Allah said:",
        "hadith": "'No ruler is appointed but he has tow groups of advisers: A group which urges him to do good and tells him not to do evil, and a group which does its best to corrupt  him. Whoever is protected from their evil is indeed protected. And he (the ruler) belongs to the group that has the greater influence over him.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مَا مِنْ وَالٍ إِلاَّ وَلَهُ بِطَانَتَانِ بِطَانَةٌ تَأْمُرُهُ بِالْمَعْرُوفِ وَتَنْهَاهُ عَنِ الْمُنْكَرِ وَبِطَانَةٌ لاَ تَأْلُوهُ خَبَالاً فَمَنْ وُقِيَ شَرَّهَا فَقَدْ وُقِيَ وَهُوَ مِنَ الَّتِي تَغْلِبُ عَلَيْهِ مِنْهُمَا ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4201
    },
    {
      "hadithNumber": 4202,
      "english": {
        "narrated": "It was narrated from Abu Saeed tht the Messenger of Allah said:",
        "hadith": "\"Allah never sends a prophet or appoints a Khalifah but he has two groups of advisers: A group that tells him to do good and a group that tells him to do evil and urges him to do it. And the one who is truly protected is the one who is protected by Allah, the Mighty and Sublime.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مَا بَعَثَ اللَّهُ مِنْ نَبِيٍّ وَلاَ اسْتَخْلَفَ مِنْ خَلِيفَةٍ إِلاَّ كَانَتْ لَهُ بِطَانَتَانِ بِطَانَةٌ تَأْمُرُهُ بِالْخَيْرِ وَبِطَانَةٌ تَأْمُرُهُ بِالشَّرِّ وَتَحُضُّهُ عَلَيْهِ وَالْمَعْصُومُ مَنْ عَصَمَ اللَّهُ عَزَّ وَجَلَّ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4202
    },
    {
      "hadithNumber": 4203,
      "english": {
        "narrated": "It was narrated that Abu Ayyub said;\n\"I heard the Messenger of Allah say:",
        "hadith": "'No prophet has eve been sent, nor has there been any Khalifah after him, but he has two groups of advisers, a group that tells him to do good and a group that tells him to do evil. Whoever is protected from the evil group, then he is indeed protected.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مَا بُعِثَ مِنْ نَبِيٍّ وَلاَ كَانَ بَعْدَهُ مِنْ خَلِيفَةٍ إِلاَّ وَلَهُ بِطَانَتَانِ بِطَانَةٌ تَأْمُرُهُ بِالْمَعْرُوفِ وَتَنْهَاهُ عَنِ الْمُنْكَرِ وَبِطَانَةٌ لاَ تَأْلُوهُ خَبَالاً فَمَنْ وُقِيَ بِطَانَةَ السُّوءِ فَقَدْ وُقِيَ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4203
    },
    {
      "hadithNumber": 4204,
      "english": {
        "narrated": "It was narrated that Al-Qasim bin Muhammad said:",
        "hadith": "\" I heard my paternal aunt say: 'The Messenger of Allah said; \"Whoever among you is appointed to a position of authority. If Allah wills good for him. He will give him a righteous minister who will remind him if he forgets and help him if he remembers",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مَنْ وَلِيَ مِنْكُمْ عَمَلاً فَأَرَادَ اللَّهُ بِهِ خَيْرًا جَعَلَ لَهُ وَزِيرًا صَالِحًا إِنْ نَسِيَ ذَكَّرَهُ وَإِنْ ذَكَرَ أَعَانَهُ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4204
    },
    {
      "hadithNumber": 4205,
      "english": {
        "narrated": "It was narrated from Abu 'Adur-Rahman from Ali that:",
        "hadith": "the Messenger of Allah  sent an army and appointed a man in charge of them. He lit a fire and said: \"Enter it.\" Some people wanted to enter it, and other said: \"We are trying to keep away from it.\" They mentioned that to the Messenger of Allah, and he said to those who had wanted to enter if: \"If you had entered it you would have stayed there until the Day of Resurrection.\" And he spoke good words to the others. And he said: \"There is no obedience if it involves disobedience toward Allah. Rather obedience is only (required) in that which is good.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالاَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ زُبَيْدٍ الإِيَامِيِّ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ عَلِيٍّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ جَيْشًا وَأَمَّرَ عَلَيْهِمْ رَجُلاً فَأَوْقَدَ نَارًا فَقَالَ ادْخُلُوهَا ‏.‏ فَأَرَادَ نَاسٌ أَنْ يَدْخُلُوهَا وَقَالَ الآخَرُونَ إِنَّمَا فَرَرْنَا مِنْهَا ‏.‏ فَذَكَرُوا ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ لِلَّذِينَ أَرَادُوا أَنْ يَدْخُلُوهَا ‏\"‏ لَوْ دَخَلْتُمُوهَا لَمْ تَزَالُوا فِيهَا إِلَى يَوْمِ الْقِيَامَةِ ‏\"‏ ‏.‏ وَقَالَ لِلآخَرِينَ خَيْرًا ‏.‏ وَقَالَ أَبُو مُوسَى فِي حَدِيثِهِ قَوْلاً حَسَنًا ‏.‏ وَقَالَ ‏\"‏ لاَ طَاعَةَ فِي مَعْصِيَةِ اللَّهِ إِنَّمَا الطَّاعَةُ فِي الْمَعْرُوفِ ‏\"‏ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4205
    },
    {
      "hadithNumber": 4206,
      "english": {
        "narrated": "It was narrated that Ibn 'Umar said:",
        "hadith": "\"The Messenger of Allah said: 'The Muslim must hear and obey whether he likes it or not, unless he is commanded to commit an act of disobedience. If he is commanded to commit an act of disobedience, then he is not required to hear and obey.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ عَلَى الْمَرْءِ الْمُسْلِمِ السَّمْعُ وَالطَّاعَةُ فِيمَا أَحَبَّ وَكَرِهَ إِلاَّ أَنْ يُؤْمَرَ بِمَعْصِيَةٍ فَإِذَا أُمِرَ بِمَعْصِيَةٍ فَلاَ سَمْعَ وَلاَ طَاعَةَ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4206
    },
    {
      "hadithNumber": 4207,
      "english": {
        "narrated": "It was narrated that Kab bin Ujrah said:",
        "hadith": "\"The Messenger of Allah came out to us, and there were nine of us. He said; 'After me there will be rulers, whoever believes in their lies and helps them in their wrongdoing is not of me, and I am not of him, and he will not come to me at the Cistern. Whoever does not believe their lies and does not help them in their wrongdoing, he is of me, and I am of hi, and he will come to me at the Cistern.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنَّهُ سَتَكُونُ بَعْدِي أُمَرَاءُ مَنْ صَدَّقَهُمْ بِكَذِبِهِمْ وَأَعَانَهُمْ عَلَى ظُلْمِهِمْ فَلَيْسَ مِنِّي وَلَسْتُ مِنْهُ وَلَيْسَ بِوَارِدٍ عَلَىَّ الْحَوْضَ وَمَنْ لَمْ يُصَدِّقْهُمْ بِكَذِبِهِمْ وَلَمْ يُعِنْهُمْ عَلَى ظُلْمِهِمْ فَهُوَ مِنِّي وَأَنَا مِنْهُ وَهُوَ وَارِدٌ عَلَىَّ الْحَوْضَ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4207
    },
    {
      "hadithNumber": 4208,
      "english": {
        "narrated": "It was narrated that Kab bin Ujrah said:",
        "hadith": "\"The Messenger of Allah came out to us and we were nine, fie and four, some 'Arabs and some non- 'Arabs. He said: 'Listen. Have you heard that after me there will be rulers, whoever enters upon them and believes their lies and help them in their wrongdoing is not of me, and I am not of him, and he will not come to me at the Cistern? Whoever does not enter upon them or belive their lies or help them in their wrongdoing is of me and I am of him, and he will come to me at the Cistern.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ اسْمَعُوا هَلْ سَمِعْتُمْ أَنَّهُ سَتَكُونُ بَعْدِي أُمَرَاءُ مَنْ دَخَلَ عَلَيْهِمْ فَصَدَّقَهُمْ بِكَذِبِهِمْ وَأَعَانَهُمْ عَلَى ظُلْمِهِمْ فَلَيْسَ مِنِّي وَلَسْتُ مِنْهُ وَلَيْسَ يَرِدُ عَلَىَّ الْحَوْضَ وَمَنْ لَمْ يَدْخُلْ عَلَيْهِمْ وَلَمْ يُصَدِّقْهُمْ بِكَذِبِهِمْ وَلَمْ يُعِنْهُمْ عَلَى ظُلْمِهِمْ فَهُوَ مِنِّي وَأَنَا مِنْهُ وَسَيَرِدُ عَلَىَّ الْحَوْضَ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4208
    },
    {
      "hadithNumber": 4209,
      "english": {
        "narrated": "It was narrated from Tariq bin Shihab that:",
        "hadith": "a man asked the Prophet, when he had put his leg in the stirrup: \"Which kind of Jihad is best?'\" He said: \" a word of truth spoken before an unjust rulers.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ كَلِمَةُ حَقٍّ عِنْدَ سُلْطَانٍ جَائِرٍ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4209
    },
    {
      "hadithNumber": 4210,
      "english": {
        "narrated": "It was narrated that 'Ubadah bin As-Samit said:",
        "hadith": "\"We were with the Prophet in a gathering and he said: 'Pledge to me that you will not associate anything with Allah, you will not steal, and you will not have unlawful sexual relations.' He recited the Verse to them (and said) Whoever does any of these things, and Allah conceals him then it is up to Allah, the mighty and Sublime: If He wills, He will punish him, and if He wills, He will forgive him.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي إِدْرِيسَ الْخَوْلاَنِيِّ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ كُنَّا عِنْدَ النَّبِيِّ صلى الله عليه وسلم فِي مَجْلِسٍ فَقَالَ ‏\"‏ بَايِعُونِي عَلَى أَنْ لاَ تُشْرِكُوا بِاللَّهِ شَيْئًا وَلاَ تَسْرِقُوا وَلاَ تَزْنُوا ‏\"‏ ‏.‏ وَقَرَأَ عَلَيْهِمُ الآيَةَ ‏\"‏ فَمَنْ وَفَّى مِنْكُمْ فَأَجْرُهُ عَلَى اللَّهِ وَمَنْ أَصَابَ مِنْ ذَلِكَ شَيْئًا فَسَتَرَ اللَّهُ عَلَيْهِ فَهُوَ إِلَى اللَّهِ عَزَّ وَجَلَّ إِنْ شَاءَ عَذَّبَهُ وَإِنْ شَاءَ غَفَرَ لَهُ ‏\"‏ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4210
    },
    {
      "hadithNumber": 4211,
      "english": {
        "narrated": "it was narrated from Abu Hurairah that the Prophet said:",
        "hadith": "\"You will become keen for positions of authority, but that will become a regret and loss. What a good life they will live, but how hard it will be for them when they die.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنَّكُمْ سَتَحْرِصُونَ عَلَى الإِمَارَةِ وَإِنَّهَا سَتَكُونُ نَدَامَةً وَحَسْرَةً فَنِعْمَتِ الْمُرْضِعَةُ وَبِئْسَتِ الْفَاطِمَةُ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 39,
      "bookName": "39The Book of al-Bay'ah كتاب البيعة",
      "bookReference": 4211
    }
  ]
}