{
  "collectionId": "nasai",
  "bookId": 41,
  "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
  "hadithCount": 41,
  "hadiths": [
    {
      "hadithNumber": 4222,
      "english": {
        "narrated": "It was narrated from Abu Hurairah that the Messenger of Allah said:",
        "hadith": "\"There is no fara' and no' Atirah.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لاَ فَرَعَ وَلاَ عَتِيرَةَ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4222
    },
    {
      "hadithNumber": 4223,
      "english": {
        "narrated": "It was narrated that Abu Hurairah that:",
        "hadith": "the Messenger of Allah forbade Fara' and 'Atirah.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لاَ فَرَعَ وَلاَ عَتِيرَةَ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4223
    },
    {
      "hadithNumber": 4224,
      "english": {
        "narrated": "Mikhnaf bin Sulaim said:",
        "hadith": "\"While we were standing with the Messenger of Allah at 'Arafat, he said: 'O people, it is upon each family to offer a sacrifice (Udhiyah) and an 'Atirah each year.\" (One of the narrators) Muadh said: \"Ibn 'Awn used to offer slaughter the 'Atirah, and I saw that with my own eyes during Rajab.\" (Daif)",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ يَا أَيُّهَا النَّاسُ إِنَّ عَلَى أَهْلِ بَيْتٍ فِي كُلِّ عَامٍ أَضْحَاةً وَعَتِيرَةً ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4224
    },
    {
      "hadithNumber": 4225,
      "english": {
        "narrated": "'Amr bin Shu'aib bin Muhammad bin 'Abdullah bin 'Amr (narrated) that his father and Zaid bin Aslam said:",
        "hadith": "\"O Messenger of Allah! (What about) the Fara'?\" He said: \"It is a duty, but if you leave it (the animal) until it becomes half-grown and you load upon it (in Jihad) in the cause of Allah or give it to a widow, that is better than if you slaughter it (when it is just born) and its flesh is difficult to separate from its skin, then you turn your vessel upside down (because you will no longer be able to get milk from the mother) and you cause your she-camel to grieve (at the loss of its young).\" They said: \"O Messenger of Allah, (what about) the 'Atirah?\" He said: \"The 'Atirah is a duty.\" (Hasan)\nAbu 'Abdur-Rahman (An-Nasa'i) said:  Abu 'Ali Al-Hanafi (one of the narrators); they are four brothers: One of them is Abu Bakr, and Bishr, and Sharik, and the other.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يَعْقُوبَ بْنِ إِسْحَاقَ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ أَبُو عَلِيٍّ الْحَنَفِيُّ، قَالَ حَدَّثَنَا دَاوُدُ بْنُ قَيْسٍ، قَالَ سَمِعْتُ عَمْرَو بْنَ شُعَيْبِ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ عَمْرٍو، عَنْ أَبِيهِ، ‏{‏ عَنْ أَبِيهِ، ‏}‏ وَزَيْدِ بْنِ أَسْلَمَ قَالُوا يَا رَسُولَ اللَّهِ الْفَرَعَ ‏.‏ قَالَ ‏\"‏ حَقٌّ فَإِنْ تَرَكْتَهُ حَتَّى يَكُونَ بَكْرًا فَتَحْمِلَ عَلَيْهِ فِي سَبِيلِ اللَّهِ أَوْ تُعْطِيَهُ أَرْمَلَةً خَيْرٌ مِنْ أَنْ تَذْبَحَهُ فَيَلْصَقَ لَحْمُهُ بِوَبَرِهِ فَتُكْفِئَ إِنَاءَكَ وَتُوَلِّهَ نَاقَتَكَ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ فَالْعَتِيرَةُ قَالَ ‏\"‏ الْعَتِيرَةُ حَقٌّ ‏\"‏ ‏.‏ قَالَ أَبُو عَبْدِ الرَّحْمَنِ أَبُو عَلِيٍّ الْحَنَفِيُّ هُمْ أَرْبَعَةُ إِخْوَةٍ أَحَدُهُمْ أَبُو بَكْرٍ وَبِشْرٌ وَشَرِيكٌ وَآخَرُ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4225
    },
    {
      "hadithNumber": 4226,
      "english": {
        "narrated": "It was narrated that Yahya bin Zurarah bin Karim bin Al-Harith bin 'Amr Al-Bahili said:",
        "hadith": "\"I heard my father say, that he heard his grandfather Al-Harith bin 'Amr, that he met the Messenger of Allah during the Farewell Pilgrimage, when he was atop his slit-eared camel. (He said): 'I said: O Messenger of Allah, May my father and mother be ransomed for you; pray for forgiveness for me. He said: May Allah forgive you (plural). Then I came to him from the other side, hoping that he would supplicate just for me alone, and not them. I said: O Messenger of Allah, pray for forgiveness for me. He said: May Allah forgive you (plural). Then a man among the people said: O Messenger of Allah, (what about) the 'Atirah and Fara'? He said: Whoever wishes to offer and 'Atirah may do so, and whoever does not wish to, may not. Whoever wishes to offer a Fara' may do so, and whoever does not wish to, may not. And with regard to sheep, a sacrifice should be offered. And he clasped between his fingers except for one.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، - يَعْنِي ابْنَ الْمُبَارَكِ - عَنْ يَحْيَى، - وَهُوَ ابْنُ زُرَارَةَ بْنِ كُرَيْمِ بْنِ الْحَارِثِ بْنِ عَمْرٍو الْبَاهِلِيُّ - قَالَ سَمِعْتُ أَبِي يَذْكُرُ، أَنَّهُ سَمِعَ جَدَّهُ الْحَارِثَ بْنَ عَمْرٍو، يُحَدِّثُ أَنَّهُ لَقِيَ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ وَهُوَ عَلَى نَاقَتِهِ الْعَضْبَاءِ فَأَتَيْتُهُ مِنْ أَحَدِ شِقَّيْهِ فَقُلْتُ يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ وَأُمِّي اسْتَغْفِرْ لِي ‏.‏ فَقَالَ ‏\"‏ غَفَرَ اللَّهُ لَكُمْ ‏\"‏ ‏.‏ ثُمَّ أَتَيْتُهُ مِنَ الشِّقِّ الآخَرِ أَرْجُو أَنْ يَخُصَّنِي دُونَهُمْ فَقُلْتُ يَا رَسُولَ اللَّهِ اسْتَغْفِرْ لِي ‏.‏ فَقَالَ بِيَدِهِ ‏\"‏ غَفَرَ اللَّهُ لَكُمْ ‏\"‏ ‏.‏ فَقَالَ رَجُلٌ مِنَ النَّاسِ يَا رَسُولَ اللَّهِ الْعَتَائِرُ وَالْفَرَائِعُ ‏.‏ قَالَ ‏\"‏ مَنْ شَاءَ عَتَرَ وَمَنْ شَاءَ لَمْ يَعْتِرْ وَمَنْ شَاءَ فَرَّعَ وَمَنْ شَاءَ لَمْ يُفَرِّعْ فِي الْغَنَمِ أُضْحِيَتُهَا ‏\"‏ ‏.‏ وَقَبَضَ أَصَابِعَهُ إِلاَّ وَاحِدَةً ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4226
    },
    {
      "hadithNumber": 4227,
      "english": {
        "narrated": "Yahya bin Zurarah As-Sahmi said:",
        "hadith": "\"My father narrated to me from his grandfather, Al-Harith bin 'Amr that he met the Messenger of Allah during the Farewell Pilgrimage and said: 'May my father and mother be sacrificed for you! O Messenger of Allah; pray for forgiveness for me.' He said: 'May Allah forgive you (plural).' He was atop his slit-eared camel and I came around to the other side\"' and he quoted the Hadith.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ غَفَرَ اللَّهُ لَكُمْ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4227
    },
    {
      "hadithNumber": 4228,
      "english": {
        "narrated": "It was narrated that Nubaishah said:",
        "hadith": "\"It was said to the prophet: 'During the Jahiliyyah we used to offer the 'Atirah.' He said: 'Slaughter for the sake of Allah, the Mighty and sublime, no matter what month it is; do good for the sake of Allah, the Mighty and sublime, and feed the poor.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ اذْبَحُوا لِلَّهِ عَزَّ وَجَلَّ فِي أَىِّ شَهْرٍ مَا كَانَ وَبَرُّوا اللَّهَ عَزَّ وَجَلَّ وَأَطْعِمُوا ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4228
    },
    {
      "hadithNumber": 4229,
      "english": {
        "narrated": "It was narrated that Nubaishah said:",
        "hadith": "\"A man called out while he was in Mina and said: 'O Messenger of Allah, we used to sacrifice the 'Atirah during the Jahiliyyah in Rajab; what do you command us to do?' He said: 'Sacrifice during whatever month it is, do good for the sake of Allah, the Mighty and Sublime, and feed (the poor).' They said: 'O Messenger of Allah, we used to sacrifice the Fara' during the Jahiliyyah; what do you command us to do?' He said: 'For every flock of grazing animals, feed the firstborn as you feed the rest of you flock until it reaches an age where it could be used carry loads, then sacrifice it, and give its meat in charity.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا بِشْرٌ، - وَهُوَ ابْنُ الْمُفَضَّلِ - عَنْ خَالِدٍ، وَرُبَّمَا، قَالَ عَنْ أَبِي الْمَلِيحِ، وَرُبَّمَا، ذَكَرَ أَبَا قِلاَبَةَ عَنْ نُبَيْشَةَ، قَالَ نَادَى رَجُلٌ وَهُوَ بِمِنًى فَقَالَ يَا رَسُولَ اللَّهِ إِنَّا كُنَّا نَعْتِرُ عَتِيرَةً فِي الْجَاهِلِيَّةِ فِي رَجَبٍ فَمَا تَأْمُرُنَا يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ اذْبَحُوا فِي أَىِّ شَهْرٍ مَا كَانَ وَبَرُّوا اللَّهَ عَزَّ وَجَلَّ وَأَطْعِمُوا ‏\"‏ ‏.‏ قَالَ إِنَّا كُنَّا نُفْرِعُ فَرَعًا فَمَا تَأْمُرُنَا قَالَ ‏\"‏ فِي كُلِّ سَائِمَةٍ فَرَعٌ تَغْذُوهُ مَاشِيَتُكَ حَتَّى إِذَا اسْتَحْمَلَ ذَبَحْتَهُ وَتَصَدَّقْتَ بِلَحْمِهِ ‏\"‏ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4229
    },
    {
      "hadithNumber": 4230,
      "english": {
        "narrated": "It was narrated from Nubaishah, a man of Hudhail, that the Prophet said:",
        "hadith": "\"I used to forbid you to store the meat of the sacrifices for more than three days so that there would be enough for everyone. But now Allah, the mighty and sublime, has bestowed plenty upon us, so eat some, give some in charity and store some, For these days are the days of eating, drinking and remembering Allah.\" A man said: \"O Messenger of Allah, we used to sacrifice the 'Atirah during the Jahiliyyah in Rajab; what do you command us to do?\" He said: \"Sacrifice to Allah, the Mighty and Sublime, whatever month it is, do good for the sake of Allah, the Mighty and Sublime, and feed (the poor).\" He said: \"O Messenger of Allah, we used to sacrifice the Fara' during the Jahiliyyah; what do you command us to do?\" He said: \"For every flock of grazing animals, feed the firstborn as you feed the rest of your flock, until it reaches an age where it could be used to carry loads, then sacrifice it, and give its meat in charity to the wayfarer, for that is good.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، عَنْ خَالِدٍ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي الْمَلِيحِ، وَأَحْسَبُنِي، قَدْ سَمِعْتُهُ مِنَ أَبِي الْمَلِيحِ، عَنْ نُبَيْشَةَ، - رَجُلٌ مِنْ هُذَيْلٍ - عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ إِنِّي كُنْتُ نَهَيْتُكُمْ عَنْ لُحُومِ الأَضَاحِي فَوْقَ ثَلاَثٍ كَيْمَا تَسَعَكُمْ فَقَدْ جَاءَ اللَّهُ عَزَّ وَجَلَّ بِالْخَيْرِ فَكُلُوا وَتَصَدَّقُوا وَادَّخِرُوا وَإِنَّ هَذِهِ الأَيَّامَ أَيَّامُ أَكْلٍ وَشُرْبٍ وَذِكْرِ اللَّهِ عَزَّ وَجَلَّ ‏\"‏ ‏.‏ فَقَالَ رَجُلٌ إِنَّا كُنَّا نَعْتِرُ عَتِيرَةً فِي الْجَاهِلِيَّةِ فِي رَجَبٍ فَمَا تَأْمُرُنَا قَالَ ‏\"‏ اذْبَحُوا لِلَّهِ عَزَّ وَجَلَّ فِي أَىِّ شَهْرٍ مَا كَانَ وَبَرُّوا اللَّهَ عَزَّ وَجَلَّ وَأَطْعِمُوا ‏\"‏ ‏.‏ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ إِنَّا كُنَّا نُفَرِّعُ فَرَعًا فِي الْجَاهِلِيَّةِ فَمَا تَأْمُرُنَا قَالَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فِي كُلِّ سَائِمَةٍ مِنَ الْغَنَمِ فَرَعٌ تَغْذُوهُ غَنَمُكَ حَتَّى إِذَا اسْتَحْمَلَ ذَبَحْتَهُ وَتَصَدَّقْتَ بِلَحْمِهِ عَلَى ابْنِ السَّبِيلِ فَإِنَّ ذَلِكَ هُوَ خَيْرٌ ‏\"‏ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4230
    },
    {
      "hadithNumber": 4231,
      "english": {
        "narrated": "It was narrated that Nubaishah said:",
        "hadith": "\"A man called out to the Prophet and said: 'We used to sacrifice the 'Atirah - i.e., during the Jahiliyyah - in Rajab; what do you command us to do?' He said: 'Sacrifice, whatever month it is, do good for the sake of Allah, the Mighty and Sublime, and feed (the poor).' He said: 'We used to sacrifice the Fara' during the Jahiliyyah; what do you command us to do?' He said: 'For every flock of grazing animals, feed the firstborn as you feed the rest of your flock until it reaches an age where it could be used to carry loads, then sacrifice it, and give its meat in charity, for that is good.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا أَبُو الأَشْعَثِ، أَحْمَدُ بْنُ الْمِقْدَامِ قَالَ حَدَّثَنَا يَزِيدُ، - وَهُوَ ابْنُ زُرَيْعٍ - قَالَ أَنْبَأَنَا خَالِدٌ، عَنْ أَبِي الْمَلِيحِ، عَنْ نُبَيْشَةَ، قَالَ نَادَى النَّبِيَّ صلى الله عليه وسلم رَجُلٌ فَقَالَ إِنَّا كُنَّا نَعْتِرُ عَتِيرَةً يَعْنِي فِي الْجَاهِلِيَّةِ فِي رَجَبٍ فَمَا تَأْمُرُنَا قَالَ ‏\"‏ اذْبَحُوهَا فِي أَىِّ شَهْرٍ كَانَ وَبَرُّوا اللَّهَ عَزَّ وَجَلَّ وَأَطْعِمُوا ‏\"‏ ‏.‏ قَالَ إِنَّا كُنَّا نُفْرِعُ فَرَعًا فِي الْجَاهِلِيَّةِ ‏.‏ قَالَ ‏\"‏ فِي كُلِّ سَائِمَةٍ فَرَعٌ حَتَّى إِذَا اسْتَحْمَلَ ذَبَحْتَهُ وَتَصَدَّقْتَ بِلَحْمِهِ فَإِنَّ ذَلِكَ هُوَ خُيْرٌ ‏\"‏ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4231
    },
    {
      "hadithNumber": 4232,
      "english": {
        "narrated": "It was narrated that Nubaishah Al-Hudhaili said:",
        "hadith": "\"A man said: 'O Messenger of Allah, we used to sacrifice the 'Atirah during the Jahiliyyah in Rajab; what do you command us to do?' He said: 'Sacrifice to Allah, the Mighty and Sublime, whatever month it is, do good for the sake of Allah, the Mighty and Sublime, and feed (the poor).\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ اذْبَحُوا لِلَّهِ عَزَّ وَجَلَّ فِي أَىِّ شَهْرٍ مَا كَانَ وَبَرُّوا اللَّهَ عَزَّ وَجَلَّ وَأَطْعِمُوا ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4232
    },
    {
      "hadithNumber": 4233,
      "english": {
        "narrated": "It was narrated that Abu Razin Laqit bin 'Amir Al-Uqaili said:",
        "hadith": "\"I said: 'O Messenger of Allah, we used to offer sacrifices during the Jahiliyyah in Rajab, and eat of (their meat) and offer some to those who came to us.' The Messenger of Allah said: 'There is nothing wrong with that.\"' (One of the narrators) Waki bin 'Udus said: \"I will not leave it.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لاَ بَأْسَ بِهِ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4233
    },
    {
      "hadithNumber": 4234,
      "english": {
        "narrated": "It was narrated from Ibn 'Abbas, from Maimunah, that:",
        "hadith": "the Prophet passed by a dead sheep that had been thrown aside. He said: \"Who does this belong to?\" They said: \"Maimunah.\" He said: \"Why did she not make use of its skin?\" They said: \"It is dead meat (i.e., it was not slaughtered properly).\" He said: \"Allah, the Mighty and Sublime, has only forbidden us to eat  it.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، عَنْ مَيْمُونَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم مَرَّ عَلَى شَاةٍ مَيِّتَةٍ مُلْقَاةٍ فَقَالَ ‏\"‏ لِمَنْ هَذِهِ ‏\"‏ ‏.‏ فَقَالُوا لِمَيْمُونَةَ ‏.‏ فَقَالَ ‏\"‏ مَا عَلَيْهَا لَوِ انْتَفَعَتْ بِإِهَابِهَا ‏\"‏ ‏.‏ قَالُوا إِنَّهَا مَيْتَةٌ ‏.‏ فَقَالَ ‏\"‏ إِنَّمَا حَرَّمَ اللَّهُ عَزَّ وَجَلَّ أَكْلَهَا ‏\"‏ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4234
    },
    {
      "hadithNumber": 4235,
      "english": {
        "narrated": "It was narrated that Ibn 'Abbas said:",
        "hadith": "\"The Messenger of Allah passed by a dead sheep that he had given to a freed slave woman of Maimunah, the wife of the Prophet. He said: 'Why don't you make use of its hide?' They said: 'O Messenger of Allah, it is dead meat.' The Messenger of Allah said: 'It is only forbidden to eat it.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، - وَاللَّفْظُ لَهُ - عَنِ ابْنِ الْقَاسِمِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ مَرَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بِشَاةٍ مَيِّتَةٍ كَانَ أَعْطَاهَا مَوْلاَةً لِمَيْمُونَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏\"‏ هَلاَّ انْتَفَعْتُمْ بِجِلْدِهَا ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ إِنَّهَا مَيْتَةٌ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّمَا حُرِّمَ أَكْلُهَا ‏\"‏ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4235
    },
    {
      "hadithNumber": 4236,
      "english": {
        "narrated": "Ibn'Abbas said:",
        "hadith": "\"The Messenger of Allah saw a dead sheep that belonged to the freed slave woman of Maimunah, and had come from the Sadaqah.\" He said: \"Why don't you take off its hide and make use of it?\" They said: \"It is dead meat.\" He said: \"It is only unlawful to eat it.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ بْنِ سَعْدٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ جَدِّي، عَنِ ابْنِ أَبِي حَبِيبٍ، - يَعْنِي يَزِيدَ - عَنْ حَفْصِ بْنِ الْوَلِيدِ، عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، حَدَّثَهُ أَنَّ ابْنَ عَبَّاسٍ حَدَّثَهُ قَالَ أَبْصَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم شَاةً مَيِّتَةً لِمَوْلاَةٍ لِمَيْمُونَةَ وَكَانَتْ مِنَ الصَّدَقَةِ فَقَالَ ‏\"‏ لَوْ نَزَعُوا جِلْدَهَا فَانْتَفَعُوا بِهِ ‏\"‏ ‏.‏ قَالُوا إِنَّهَا مَيْتَةٌ ‏.‏ قَالَ ‏\"‏ إِنَّمَا حُرِّمَ أَكْلُهَا ‏\"‏ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4236
    },
    {
      "hadithNumber": 4237,
      "english": {
        "narrated": "It was narrated from Ibn 'Abbas:",
        "hadith": "\"Maimunah told me that a sheep died, and the Prophet said: 'Why don't you tan its skin and make use of it'?\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ أَلاَّ دَفَعْتُمْ إِهَابَهَا فَاسْتَمْتَعْتُمْ بِهِ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4237
    },
    {
      "hadithNumber": 4238,
      "english": {
        "narrated": "Ibn 'Abbas said:",
        "hadith": "\"The Prophet passed by a sheep belonging to Maimunah that had died and said: 'Why don't you take its skin and tan it and make use of it'?\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ أَلاَّ أَخَذْتُمْ إِهَابَهَا فَدَبَغْتُمْ فَانْتَفَعْتُمْ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4238
    },
    {
      "hadithNumber": 4239,
      "english": {
        "narrated": "Ibn 'Abbas said:",
        "hadith": "\"The Prophet passed by a dead sheep and said: 'Why don't you make use of its skin'?\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ أَلاَّ انْتَفَعْتُمْ بِإِهَابِهَا ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4239
    },
    {
      "hadithNumber": 4240,
      "english": {
        "narrated": "It was narrated that Sawdah, the wife of the Prophet, said:",
        "hadith": "\"A sheep of ours died, and we tanned its skin, and continued to make Nabidh in it until it wore out.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ بْنِ أَبِي رِزْمَةَ، قَالَ أَنْبَأَنَا الْفَضْلُ بْنُ مُوسَى، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنِ الشَّعْبِيِّ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، عَنْ سَوْدَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ مَاتَتْ شَاةٌ لَنَا فَدَبَغْنَا مَسْكَهَا فَمَازِلْنَا نَنْبِذُ فِيهَا حَتَّى صَارَتْ شَنًّا ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4240
    },
    {
      "hadithNumber": 4241,
      "english": {
        "narrated": "It was narrated that Ibn 'Abbas said:",
        "hadith": "\"The Messenger of Allah said: 'Any skin that is tanned has been purified.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ أَيُّمَا إِهَابٍ دُبِغَ فَقَدْ طَهُرَ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4241
    },
    {
      "hadithNumber": 4242,
      "english": {
        "narrated": "It was narrated from Ibn Wa'lah that he asked Ibn 'Abbas:",
        "hadith": "\"We are attacking the Maghrib, and they are people who worship idols, and they have waterskins in which they keep milk and water.\" Ibn 'Abbas said: \"Tanning is purification.\" Ibn Wa'lah said: \"Is this your own opinion, or something that you heard from the Messenger of Allah?\" He said: \"No, (I heard it) from the Messneger of Allah.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنِي الرَّبِيعُ بْنُ سُلَيْمَانَ بْنِ دَاوُدَ، قَالَ حَدَّثَنَا إِسْحَاقُ بْنُ بَكْرٍ، - وَهُوَ ابْنُ مُضَرَ - قَالَ حَدَّثَنِي أَبِي، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، أَنَّهُ سَمِعَ أَبَا الْخَيْرِ، عَنِ ابْنِ وَعْلَةَ، أَنَّهُ سَأَلَ ابْنَ عَبَّاسٍ فَقَالَ إِنَّا نَغْزُو هَذَا الْمَغْرِبَ وَإِنَّهُمْ أَهْلُ وَثَنٍ وَلَهُمْ قِرَبٌ يَكُونُ فِيهَا اللَّبَنُ وَالْمَاءُ فَقَالَ ابْنُ عَبَّاسٍ الدِّبَاغُ طَهُورٌ ‏.‏ قَالَ ابْنُ وَعْلَةَ عَنْ رَأْيِكَ أَوْ شَىْءٍ سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ بَلْ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4242
    },
    {
      "hadithNumber": 4243,
      "english": {
        "narrated": "It was narrated from Salamah bin Al-Muhabbaq that:",
        "hadith": "during the campaign of Tabuk, the Prophet of Allah called for water from a woman. She said: \"I only have a waterskin of mine made from an (unslaughtered) dead animal.\" He said: \"Didn't you tan it?\" She said: \"Of course.\" He said: \"Then it's tanning is its slaughter\". (Daif)",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ جَوْنِ بْنِ قَتَادَةَ، عَنْ سَلَمَةَ بْنِ الْمُحَبِّقِ، أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةِ تَبُوكَ دَعَا بِمَاءٍ مِنْ عِنْدِ امْرَأَةٍ قَالَتْ مَا عِنْدِي إِلاَّ فِي قِرْبَةٍ لِي مَيْتَةٍ ‏.‏ قَالَ ‏\"‏ أَلَيْسَ قَدْ دَبَغْتِهَا ‏\"‏ ‏.‏ قَالَتْ بَلَى ‏.‏ قَالَ ‏\"‏ فَإِنَّ دِبَاغَهَا ذَكَاتُهَا ‏\"‏ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4243
    },
    {
      "hadithNumber": 4244,
      "english": {
        "narrated": "It was narrated that 'Aishah said:",
        "hadith": "\"The Prophet was asked about the hides of dead animals.\" He said: \"Tanning it purifies it.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ دِبَاغُهَا طَهُورُهَا ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4244
    },
    {
      "hadithNumber": 4245,
      "english": {
        "narrated": "It was narrated that 'Aishah said:",
        "hadith": "\"The Messenger of Allah was asked about the hides of dead animals.\" He said: \"Tanning it purifies it.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ دِبَاغُهَا ذَكَاتُهَا ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4245
    },
    {
      "hadithNumber": 4246,
      "english": {
        "narrated": "It was narrated from 'Aishah that the Prophet said:",
        "hadith": "\"The dead animal is purified by tanning it.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ ذَكَاةُ الْمَيْتَةِ دِبَاغُهَا ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4246
    },
    {
      "hadithNumber": 4247,
      "english": {
        "narrated": "It was narrated that 'Aishah said:",
        "hadith": "\"The Prophet said: 'The dead animal is purified by tanning it.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ ذَكَاةُ الْمَيْتَةِ دِبَاغُهَا ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4247
    },
    {
      "hadithNumber": 4248,
      "english": {
        "narrated": "It was narrated from Maimunah, the wife of the Prophet, that:",
        "hadith": "some men of Quraish passed by the Messenger of Allah dragging a sheep the size of a donkey. He said to them: \"Why don't you take its skin?\" They said: \"It is dead meat.\" The Messenger of Allah said: \"Purify it with water and Qaraz.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ، عَنِ ابْنِ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، وَاللَّيْثُ بْنُ سَعْدٍ، عَنْ كَثِيرِ بْنِ فَرْقَدٍ، أَنَّ عَبْدَ اللَّهِ بْنَ مَالِكِ بْنِ حُذَافَةَ، حَدَّثَهُ عَنِ الْعَالِيَةِ بِنْتِ سُبَيْعٍ، أَنَّ مَيْمُونَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم حَدَّثَتْهَا أَنَّهُ مَرَّ بِرَسُولِ اللَّهِ صلى الله عليه وسلم رِجَالٌ مِنْ قُرَيْشٍ يَجُرُّونَ شَاةً لَهُمْ مِثْلَ الْحِصَانِ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَوْ أَخَذْتُمْ إِهَابَهَا ‏\"‏ ‏.‏ قَالُوا إِنَّهَا مَيْتَةٌ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يُطَهِّرُهَا الْمَاءُ وَالْقَرَظُ ‏\"‏ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4248
    },
    {
      "hadithNumber": 4249,
      "english": {
        "narrated": "It was narrated that 'Abdullah bin 'Ukaim said:",
        "hadith": "\"The letter of the Messenger of Allah was read to us when I was a young boy: 'Do not make use of the skins and sinew of dead animals.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ أَنْ لاَ تَنْتَفِعُوا مِنَ الْمَيْتَةِ بِإِهَابٍ وَلاَ عَصَبٍ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4249
    },
    {
      "hadithNumber": 4250,
      "english": {
        "narrated": "It was narrated that'Abdullah bin 'Ukaim said:",
        "hadith": "\"The Messenger of Allah wrote to us: 'Do not make use of the skins and sinew of dead animals.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ أَنْ لاَ تَسْتَمْتِعُوا مِنَ الْمَيْتَةِ بِإِهَابٍ وَلاَ عَصَبٍ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4250
    },
    {
      "hadithNumber": 4251,
      "english": {
        "narrated": "It was narrated that 'Abdullah bin 'Ukaim said:",
        "hadith": "\"The Messenger of Allah wrote to Juhainah: 'Do not make use of the skin and sinew of dead animals.\"' (Hasan)\nAbu 'Abdur-Rahman )An-Nasa'i) said: The most correct about this topic, regarding the skins of the dead animal when it is tanned, is the narration of Az-Zuhri, from 'Ubaidullah bin 'Abdullah, from Ibn 'Abbas, from Maimunah, and Allah knows best.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ أَنْ لاَ تَنْتَفِعُوا مِنَ الْمَيْتَةِ بِإِهَابٍ وَلاَ عَصَبٍ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4251
    },
    {
      "hadithNumber": 4252,
      "english": {
        "narrated": "It was narrated from 'Aishah that:",
        "hadith": "the Messenger of Allah ordered that the hides of dead animals be made use of if they had been tanned. (Daif)",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا بِشْرُ بْنُ عُمَرَ، قَالَ حَدَّثَنَا مَالِكٌ، ح وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ الْقَاسِمِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ قُسَيْطٍ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أُمِّهِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ أَنْ يُسْتَمْتَعَ بِجُلُودِ الْمَيْتَةِ إِذَا دُبِغَتْ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4252
    },
    {
      "hadithNumber": 4253,
      "english": {
        "narrated": "It was narrated from Abu Al-Malih, from his father, that:",
        "hadith": "the Prophet forbade (the use of) the hides of Predators. (Hassan)",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، عَنْ يَحْيَى، عَنِ ابْنِ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ أَبِي الْمَلِيحِ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ جُلُودِ السِّبَاعِ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4253
    },
    {
      "hadithNumber": 4254,
      "english": {
        "narrated": "It was narrated that Al-Miqdam bin Ma di Karib said:",
        "hadith": "\"The Messenger of Allah forbade silk, gold and saddlecloths (Miyathir) made of leopard skin.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ، قَالَ حَدَّثَنَا بَقِيَّةُ، عَنْ بَحِيرٍ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنِ الْمِقْدَامِ بْنِ مَعْدِيكَرِبَ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْحَرِيرِ وَالذَّهَبِ وَمَيَاثِرِ النُّمُورِ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4254
    },
    {
      "hadithNumber": 4255,
      "english": {
        "narrated": "It was narrated that Khalid said:",
        "hadith": "\"Al-Miqdam bi8n Ma di Karib came to visit Mu awiyah and said to him: I adjure you by Allah, do you know that the messenger of Allah forbade wearing the Hides of predators and riding on them? He said: 'yes.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ، قَالَ حَدَّثَنَا بَقِيَّةُ، عَنْ بَحِيرٍ، عَنْ خَالِدٍ، قَالَ وَفَدَ الْمِقْدَامُ بْنُ مَعْدِيكَرِبَ عَلَى مُعَاوِيَةَ فَقَالَ لَهُ أَنْشُدُكَ بِاللَّهِ هَلْ تَعْلَمُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ لُبُوسِ جُلُودِ السِّبَاعِ وَالرُّكُوبِ عَلَيْهَا قَالَ نَعَمْ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4255
    },
    {
      "hadithNumber": 4256,
      "english": {
        "narrated": "It was narraterd from Jabir bin 'Abdullah that, during the year of the Conquest, while he was in Makkah, he heard the Messenger of Allah say:",
        "hadith": "\"Allah, the Mighty and Sublime, and His Messenger have forbidden the sale of alcohol, dead meat, pigs and idols.\" It was said to him: \"O Messenger of Allah, what do you think of their fat of dead animals, for it is used to caulk ships, it is daubed on animal skins, and people use it to light their lamps?\" He said: \"No, it is unlawful.\" Then the Messenger of Allah said: \"May Allah, the Mighty and Sublime, curse the Jews, for Allah forbade them the fat (of dead animals) but they rendered it, sold it, and consumed its price.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَامَ الْفَتْحِ وَهُوَ بِمَكَّةَ يَقُولُ ‏\"‏ إِنَّ اللَّهَ عَزَّ وَجَلَّ وَرَسُولَهُ حَرَّمَ بَيْعَ الْخَمْرِ وَالْمَيْتَةِ وَالْخِنْزِيرِ وَالأَصْنَامِ ‏\"‏ ‏.‏ فَقِيلَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ شُحُومَ الْمَيْتَةِ فَإِنَّهُ يُطْلَى بِهَا السُّفُنُ وَيُدَّهَنُ بِهَا الْجُلُودُ وَيَسْتَصْبِحُ بِهَا النَّاسُ ‏.‏ فَقَالَ ‏\"‏ لاَ هُوَ حَرَامٌ ‏\"‏ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم عِنْدَ ذَلِكَ ‏\"‏ قَاتَلَ اللَّهُ الْيَهُودَ إِنَّ اللَّهَ عَزَّ وَجَلَّ لَمَّا حَرَّمَ عَلَيْهِمُ الشُّحُومَ جَمَّلُوهُ ثُمَّ بَاعُوهُ فَأَكَلُوا ثَمَنَهُ ‏\"‏ ‏.‏",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4256
    },
    {
      "hadithNumber": 4257,
      "english": {
        "narrated": "It was narrated that Ibn'Abbas said:",
        "hadith": "\"It reached 'Umar that Samurah had sold some wine, and he said: 'May Allah ruin Samurah! Does he not know that the Messenger of Allah said: May Allah curse the Jews, for animal fat was forbidden to them, but they rendered it.' Sufyan (one of the narrators) said: \"Meaning: They melted it down.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ قَاتَلَ اللَّهُ الْيَهُودَ حُرِّمَتْ عَلَيْهِمُ الشُّحُومُ فَجَمَّلُوهَا ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4257
    },
    {
      "hadithNumber": 4258,
      "english": {
        "narrated": "It was narrated from Ibn 'Abbas, form Maimunah, that:",
        "hadith": "a mouse fell into some cooking fat and died. The Prophet was asked (about that) and he said: \"Throw it away, and whatever  is around it, and eat (the rest).\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ أَلْقُوهَا وَمَا حَوْلَهَا وَكُلُوهُ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4258
    },
    {
      "hadithNumber": 4259,
      "english": {
        "narrated": "It was narrated from Ibn' Abbas, from Maimunah, that:",
        "hadith": "the Prophet was asked about a mouse that had fallen into some solid cooking fat. He said. \"Take it, and whatever is around it, and throw it away.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ خُذُوهَا وَمَا حَوْلَهَا فَأَلْقُوهُ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4259
    },
    {
      "hadithNumber": 4260,
      "english": {
        "narrated": "It was narrated from Ibn' Abbas, from Maimunah, that:",
        "hadith": "the Prophet was asked about a mouse that fell into the cooking fat. He said: \"If it (the fat) is solid, then throw it away, and whatever is around it. If it is liquid then do not use it at all.\"(Daif)",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنْ كَانَ جَامِدًا فَأَلْقُوهَا وَمَا حَوْلَهَا وَإِنْ كَانَ مَائِعًا فَلاَ تَقْرَبُوهُ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4260
    },
    {
      "hadithNumber": 4261,
      "english": {
        "narrated": "Ibn ' Abbas said:",
        "hadith": "\" I heard Sa'eed bin Jubair say: 'The Messenger of Allah passed by a dead goat and said: \"Why didn't the owners of this sheep makes use of its skin?\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مَا كَانَ عَلَى أَهْلِ هَذِهِ الشَّاةِ لَوِ انْتَفَعُوا بِإِهَابِهَا ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4261
    },
    {
      "hadithNumber": 4262,
      "english": {
        "narrated": "It was narrated from Abu Sa'eed Al-Khudri that the Prophet said:",
        "hadith": "\"If a fly falls into the vessel of one of you, let him dip it in,\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِذَا وَقَعَ الذُّبَابُ فِي إِنَاءِ أَحَدِكُمْ فَلْيَمْقُلْهُ ‏\"",
        "grade": ""
      },
      "collectionId": "nasai",
      "bookId": 41,
      "bookName": "41The Book of al-Fara' and al-'Atirah كتاب الفرع والعتيرة",
      "bookReference": 4262
    }
  ]
}