{
  "collectionId": "tirmidhi",
  "bookId": 43,
  "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
  "hadithCount": 135,
  "hadiths": [
    {
      "hadithNumber": 2736,
      "english": {
        "narrated": "Narrated 'Ali:",
        "hadith": "that the Messenger of Allah (ﷺ) said: \"There are six courtesies due from a Muslim to another Muslim: To give Salam to him when he meets him, to accept his invitation when he invites him, to reply to him when he sneezes, to visit him when he is ill, to follow his funeral when he dies, and to love for him what he loves for himself.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لِلْمُسْلِمِ عَلَى الْمُسْلِمِ سِتٌّ بِالْمَعْرُوفِ يُسَلِّمُ عَلَيْهِ إِذَا لَقِيَهُ وَيُجِيبُهُ إِذَا دَعَاهُ وَيُشَمِّتُهُ إِذَا عَطَسَ وَيَعُودُهُ إِذَا مَرِضَ وَيَتْبَعُ جَنَازَتَهُ إِذَا مَاتَ وَيُحِبُّ لَهُ مَا يُحِبُّ لِنَفْسِهِ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2736
    },
    {
      "hadithNumber": 2737,
      "english": {
        "narrated": "Narrated Abu Hurairah:",
        "hadith": "that the Messenger of Allah (ﷺ) said: \"There are six things due from the believer to another believer: Visiting him when he is ill, attending (his funeral) to him when he dies, accepting his invitation when he invites, giving him Salam when he meets him, replying to him when he sneezes, and wishing him well when he is absent and when he is present.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لِلْمُؤْمِنِ عَلَى الْمُؤْمِنِ سِتُّ خِصَالٍ يَعُودُهُ إِذَا مَرِضَ وَيَشْهَدُهُ إِذَا مَاتَ وَيُجِيبُهُ إِذَا دَعَاهُ وَيُسَلِّمُ عَلَيْهِ إِذَا لَقِيَهُ وَيُشَمِّتُهُ إِذَا عَطَسَ وَيَنْصَحُ لَهُ إِذَا غَابَ أَوْ شَهِدَ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2737
    },
    {
      "hadithNumber": 2738,
      "english": {
        "narrated": "Narrated Hadrami, the freed slave of the family of Al-Jarud:",
        "hadith": "from Nafi: \"A man sneezed beside Ibn 'Umar and said: 'Al-Hamdulillah Was-Salamu 'Ala Rasulillah. (All praise is due to Allah, and peace upon the Messenger of Allah)'. So Ibn 'Umar said: 'I too say Al-Hamdulillah Was-Salamu 'Ala Rasulillah, but this is not what the Messenger of Allah (ﷺ) taught us. He taught us to say: \"Al-Hamdulillah 'Ala Kulli Hal (All praise is due to Allah in every circumstance).\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، حَدَّثَنَا زِيَادُ بْنُ الرَّبِيعِ، حَدَّثَنَا حَضْرَمِيٌّ، مَوْلَى آلِ الْجَارُودِ عَنْ نَافِعٍ، أَنَّ رَجُلاً، عَطَسَ إِلَى جَنْبِ ابْنِ عُمَرَ فَقَالَ الْحَمْدُ لِلَّهِ وَالسَّلاَمُ عَلَى رَسُولِ اللَّهِ ‏.‏ قَالَ ابْنُ عُمَرَ وَأَنَا أَقُولُ الْحَمْدُ لِلَّهِ وَالسَّلاَمُ عَلَى رَسُولِ اللَّهِ وَلَيْسَ هَكَذَا عَلَّمَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَّمَنَا أَنْ نَقُولَ الْحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ زِيَادِ بْنِ الرَّبِيعِ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2738
    },
    {
      "hadithNumber": 2739,
      "english": {
        "narrated": "Narrated Abu Musa:",
        "hadith": "The Jews used to sneeze in the presence of the Prophet (ﷺ) hoping that he would say: 'Yarhamukumullah (May Allah have mercy upon you).' So he said: 'Yahdikumullahu Wa Yuslihu Balakum (May Allah guide you and rectify your affairs).'\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ يَهْدِيكُمُ اللَّهُ وَيُصْلِحُ بَالَكُمْ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2739
    },
    {
      "hadithNumber": 2740,
      "english": {
        "narrated": "Narrated Salim bin 'Ubaid:",
        "hadith": "that he was with some people on a journey, and a man among the people sneezed and he said: \"As-Salamu Alaikum (peace be upon you).\" So he (Salim) said: \"'Alaika Wa 'Ala Ummik (upon you and upon your mother).\" It seemed as if that bothered the man, so he said: \"Indeed I have not said except what the Prophet (ﷺ) said; a man sneezed in the presence of the Prophet (ﷺ) and said: 'As-Salamu 'Alaikum (peace be upon you)' so the Prophet (ﷺ) said: ''Alaika Wa 'Ala Ummik (upon you and upon your mother). When one of you sneezes let him say: \"Al-Hamdulillahi Rabbil-'Alamin (All praise is due to the Lord of all that exists)\" and let the one responding to him say: Yarhamukallah (May Allah have mercy upon you)\" and let him reply: Yaghfirullah Li Walakum (May Allah forgive me and you both).\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ عَلَيْكَ وَعَلَى أُمِّكَ إِذَا عَطَسَ أَحَدُكُمْ فَلْيَقُلِ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ وَلْيَقُلْ لَهُ مَنْ يَرُدُّ عَلَيْهِ يَرْحَمُكَ اللَّهُ وَلْيَقُلْ يَغْفِرُ اللَّهُ لَنَا وَلَكُمْ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2740
    },
    {
      "hadithNumber": 2741,
      "english": {
        "narrated": "Narrated Abu Ayyub:",
        "hadith": "that the Messenger of Allah (ﷺ) said: \"When one of you sneezes let him say: 'Al-Hamdulillahi 'Ala Kulli Hal (All praise is due to Allah in every circumstance).' And let the one replying to him say: \"Yarhamukallah (May Allah have mercy upon you).' And let him say to him: 'Yahdikumullah Wa Yuslihu Balakum (May Allah guide you and rectify your affairs).'\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِذَا عَطَسَ أَحَدُكُمْ فَلْيَقُلِ الْحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ وَلْيَقُلِ الَّذِي يَرُدُّ عَلَيْهِ يَرْحَمُكَ اللَّهُ وَلْيَقُلْ هُوَ يَهْدِيكُمُ اللَّهُ وَيُصْلِحُ بَالَكُمْ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2741
    },
    {
      "hadithNumber": 2741,
      "english": {
        "narrated": "(Another chain) with similar narration.\nHe [At-Tirmidhi] said:",
        "hadith": "This is how Shu'bah reported this Hadith from IbnAbi Laila, and he said: \"From Abu  Ayyub from the Prophet (ﷺ).\" Ibn Abi Laila was confused in this narration, sometimes he would say: \"From Abu Ayyub from the Prophet (ﷺ)\" and sometimes he would say: \"From 'Ali from the Prophet (ﷺ)\" similarly in meaning.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنِ ابْنِ أَبِي لَيْلَى، بِهَذَا الإِسْنَادِ نَحْوَهُ ‏.‏ قَالَ هَكَذَا رَوَى شُعْبَةُ، هَذَا الْحَدِيثَ عَنِ ابْنِ أَبِي لَيْلَى، عَنْ أَبِي أَيُّوبَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَكَانَ ابْنُ أَبِي لَيْلَى يَضْطَرِبُ فِي هَذَا الْحَدِيثِ يَقُولُ أَحْيَانًا عَنْ أَبِي أَيُّوبَ عَنِ النَّبِيِّ صلى الله عليه وسلم وَيَقُولُ أَحْيَانًا عَنْ عَلِيٍّ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2741
    },
    {
      "hadithNumber": 2741,
      "english": {
        "narrated": "",
        "hadith": "(Another chain) from 'Ali from the Prophet (ﷺ) with similar meaning.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَمُحَمَّدُ بْنُ يَحْيَى الثَّقَفِيُّ الْمَرْوَزِيُّ، قَالاَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، عَنِ ابْنِ أَبِي لَيْلَى، عَنْ أَخِيهِ، عِيسَى عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ عَلِيٍّ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2741
    },
    {
      "hadithNumber": 2742,
      "english": {
        "narrated": "Narrated Anas bin Malik:",
        "hadith": "that two men sneezed in the presence of the Prophet (ﷺ); he responded to one of them and did not respond to the other. The one who was not responded to said: \"O Messenger of Allah! You responded to this person and did not respond to me?' So the Messenger of Allah (ﷺ) said: \"He praised Allah while you did not praise Him.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنَّهُ حَمِدَ اللَّهَ وَإِنَّكَ لَمْ تَحْمَدِ اللَّهَ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2742
    },
    {
      "hadithNumber": 2743,
      "english": {
        "narrated": "Narrated Iyas bin Salamah:",
        "hadith": "from his father: \"A man sneezed in the presence of the Messenger of Allah (ﷺ) while I was present, so the Messenger of Allah (ﷺ) said: 'Yarhamukallah (May Allah have mercy upon you).' Then he sneezed a second and third time. So the Messenger of Allah (ﷺ) said: \"This man is suffering from a cold.'\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا عِكْرِمَةُ بْنُ عَمَّارٍ، عَنْ إِيَاسِ بْنِ سَلَمَةَ بْنِ الأَكْوَعِ، عَنْ أَبِيهِ، قَالَ عَطَسَ رَجُلٌ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَنَا شَاهِدٌ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَرْحَمُكَ اللَّهُ ‏\"‏ ‏.‏ ثُمَّ عَطَسَ الثَّانِيَةَ وَالثَّالِثَةَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَذَا رَجُلٌ مَزْكُومٌ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2743
    },
    {
      "hadithNumber": 2743,
      "english": {
        "narrated": "(Another chain) from Iyas bin Salamah from his father, from the Prophet (ﷺ) with similar narration, except that he said to him the third time:",
        "hadith": "\"You are suffering from a cold.\"\n[He said:] And this is more correct than the narration of Ibn Al-Mubarak.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ أَنْتَ مَزْكُومٌ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2743
    },
    {
      "hadithNumber": 2743,
      "english": {
        "narrated": "",
        "hadith": "Shu'bah reported this Hadith from 'Ikrimah bin 'Ammar and it is similar to the narration of Yahya bin Sa'eed. (A chain to support that).",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وَقَدْ رَوَى شُعْبَةُ، عَنْ عِكْرِمَةَ بْنِ عَمَّارٍ، هَذَا الْحَدِيثَ نَحْوَ رِوَايَةِ يَحْيَى بْنِ سَعِيدٍ حَدَّثَنَا بِذَلِكَ، أَحْمَدُ بْنُ الْحَكَمِ الْبَصْرِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عِكْرِمَةَ بْنِ عَمَّارٍ، بِهَذَا ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2743
    },
    {
      "hadithNumber": 2743,
      "english": {
        "narrated": "And 'Abdur-Rahman bin Mahdi reported it from 'Ikrimah bin 'Ammar and it is similar to the narration of Ibn Al-Mubarak, but he said to him the third time:",
        "hadith": "\"You are suffering from a cold.\" (A chain to support that)",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ أَنْتَ مَزْكُومٌ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2743
    },
    {
      "hadithNumber": 2744,
      "english": {
        "narrated": "Narrated 'Umar bin Ishaq bin Abi Talhah:",
        "hadith": "from his mother, from her father, who said: \"The Messenger of Allah (ﷺ) said: 'Reply three times to the sneezing person. If he (sneezes) more, then if you wish reply and if you do not then do not.'\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ يُشَمَّتُ الْعَاطِسُ ثَلاَثًا فَإِنْ زَادَ فَإِنْ شِئْتَ فَشَمِّتْهُ وَإِنْ شِئْتَ فَلاَ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2744
    },
    {
      "hadithNumber": 2745,
      "english": {
        "narrated": "Narrated Abu Hurairah:",
        "hadith": "that when the Prophet (ﷺ) would sneeze, he would cover his face with his hand or with his garment, and muffle the sound with it.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا مُحَمَّدُ بْنُ وَزِيرٍ الْوَاسِطِيُّ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ عَجْلاَنَ، عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا عَطَسَ غَطَّى وَجْهَهُ بِيَدِهِ أَوْ بِثَوْبِهِ وَغَضَّ بِهَا صَوْتَهُ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2745
    },
    {
      "hadithNumber": 2746,
      "english": {
        "narrated": "Narrated Abu Hurairah:",
        "hadith": "that the Messenger of Allah (ﷺ) said: \"The sneeze is from Allah and the yawn is from Ash-Shaitan. So when one of you yawns let him cover his mouth with his hand. For when he says 'Ah, Ah' Ash-Shaitan laughs from inside his opening.\" [And indeed Allah loves the sneeze and He dislikes the Yawn, so when a man says Ah, Ah when yawning, indeed Ash-Shaitan laughs from inside his opening.\"]",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ الْعُطَاسُ مِنَ اللَّهِ وَالتَّثَاؤُبُ مِنَ الشَّيْطَانِ فَإِذَا تَثَاءَبَ أَحَدُكُمْ فَلْيَضَعْ يَدَهُ عَلَى فِيهِ وَإِذَا قَالَ آهْ آهْ فَإِنَّ الشَّيْطَانَ يَضْحَكُ مِنْ جَوْفِهِ وَإِنَّ اللَّهَ يُحِبُّ الْعُطَاسَ وَيَكْرَهُ التَّثَاؤُبَ فَإِذَا قَالَ الرَّجُلُ آهْ آهْ إِذَا تَثَاءَبَ فَإِنَّ الشَّيْطَانَ يَضْحَكُ فِي جَوْفِهِ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2746
    },
    {
      "hadithNumber": 2747,
      "english": {
        "narrated": "Narrated Abu Hurairah:",
        "hadith": "that the Messenger of Allah (ﷺ) said: \"Indeed Allah loves sneezing and He dislikes the yawn. So when one of you sneezes and says 'Al-Hamdulillah (All praise is due to Allah),' then it is a right due from every one who hears him to say: 'Yarhamukallah (May Allah have mercy upon you)' As for yawning then when one of you yawns let him suppress it as much as possible and not say: \"Hah Hah' for that is only from Ash-Shaitan laughing at him.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنَّ اللَّهَ يُحِبُّ الْعُطَاسَ وَيَكْرَهُ التَّثَاؤُبَ فَإِذَا عَطَسَ أَحَدُكُمْ فَقَالَ الْحَمْدُ لِلَّهِ فَحَقٌّ عَلَى كُلِّ مَنْ سَمِعَهُ أَنْ يَقُولَ يَرْحَمُكَ اللَّهُ وَأَمَّا التَّثَاؤُبُ فَإِذَا تَثَاءَبَ أَحَدُكُمْ فَلْيَرُدَّهُ مَا اسْتَطَاعَ وَلاَ يَقُولَنَّ هَاهْ هَاهْ فَإِنَّمَا ذَلِكَ مِنَ الشَّيْطَانِ يَضْحَكُ مِنْهُ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2747
    },
    {
      "hadithNumber": 2748,
      "english": {
        "narrated": "Narrated Abu Yaqzan:",
        "hadith": "from 'Adi - and he is Ibn Thabit - from his father, from his grandfather - [from the Prophet (ﷺ)]: \"Sneezing, dozing and yawning during Salat, and menstruation, regurgitation and nosebleeds are from Ash-Shaitan.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ الْعُطَاسُ وَالنُّعَاسُ وَالتَّثَاؤُبُ فِي الصَّلاَةِ وَالْحَيْضُ وَالْقَىْءُ وَالرُّعَافُ مِنَ الشَّيْطَانِ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2748
    },
    {
      "hadithNumber": 2749,
      "english": {
        "narrated": "Narrated Ibn 'Umar:",
        "hadith": "that the Messenger of Allah (ﷺ) said: \"Let one of you not have his brother stand from his seat then sit in it.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لاَ يُقِمْ أَحَدُكُمْ أَخَاهُ مِنْ مَجْلِسِهِ ثُمَّ يَجْلِسُ فِيهِ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2749
    },
    {
      "hadithNumber": 2750,
      "english": {
        "narrated": "Narrated Ibn 'Umar:",
        "hadith": "that the Messenger of Allah (ﷺ) said: \"Let one of you not have his brother stand from his seat then sit in it.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لاَ يُقِمْ أَحَدُكُمْ أَخَاهُ مِنْ مَجْلِسِهِ ثُمَّ يَجْلِسُ فِيهِ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2750
    },
    {
      "hadithNumber": 2751,
      "english": {
        "narrated": "Narrated Wahb bin Hudaifah:",
        "hadith": "that the Messenger of Allah (ﷺ) said: \"A man has more right to his seat. If he leaves for some need of his, then he returns, then he has more right to his seat.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ الرَّجُلُ أَحَقُّ بِمَجْلِسِهِ وَإِنْ خَرَجَ لِحَاجَتِهِ ثُمَّ عَادَ فَهُوَ أَحَقُّ بِمَجْلِسِهِ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2751
    },
    {
      "hadithNumber": 2752,
      "english": {
        "narrated": "Narrated 'Abdullah bin 'Amr:",
        "hadith": "that the Messenger of Allah (ﷺ) said: \"It is not lawful for a man to separate two people except with their permission.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لاَ يَحِلُّ لِلرَّجُلِ أَنْ يُفَرِّقَ بَيْنَ اثْنَيْنِ إِلاَّ بِإِذْنِهِمَا ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2752
    },
    {
      "hadithNumber": 2753,
      "english": {
        "narrated": "Narrated Abu Miljaz:",
        "hadith": "that a man sat in the middle of a circle so Hudhaifah said: \"Cursed upon the tongue of Muhammad - or - Cursed, by Allah upon the tongue of Muhammad (ﷺ), is he who sits in the middle of a the circle.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا سُوَيْدٌ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَبِي مِجْلَزٍ، أَنَّ رَجُلاً، قَعَدَ وَسْطَ حَلْقَةٍ فَقَالَ حُذَيْفَةُ مَلْعُونٌ عَلَى لِسَانِ مُحَمَّدٍ أَوْ لَعَنَ اللَّهُ عَلَى لِسَانِ مُحَمَّدٍ صلى الله عليه وسلم - مَنْ قَعَدَ وَسْطَ الْحَلْقَةِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَأَبُو مِجْلَزٍ اسْمُهُ لاَحِقُ بْنُ حُمَيْدٍ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2753
    },
    {
      "hadithNumber": 2754,
      "english": {
        "narrated": "Narrated Anas:",
        "hadith": "\"There was no person more beloved to them than the Messenger of Allah (ﷺ).\" [He said:] \"And they would not stand when they saw him because they knew that he disliked that.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ، أَخْبَرَنَا عَفَّانُ، أَخْبَرَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، قَالَ لَمْ يَكُنْ شَخْصٌ أَحَبَّ إِلَيْهِمْ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ وَكَانُوا إِذَا رَأَوْهُ لَمْ يَقُومُوا لِمَا يَعْلَمُونَ مِنْ كَرَاهِيَتِهِ لِذَلِكَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2754
    },
    {
      "hadithNumber": 2755,
      "english": {
        "narrated": "Narrated Abu Miljaz:",
        "hadith": "that Mu'awiyah came out and 'Abdullah bin Az-Zubair and Ibn Safwan stood for him when they saw him, so he said: \"Sit, I heard the Messenger of Allah (ﷺ) saying: 'Whoever wishes that he be received by men standing then, let him take his seat in the Fire.'\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مَنْ سَرَّهُ أَنْ يَتَمَثَّلَ لَهُ الرِّجَالُ قِيَامًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2755
    },
    {
      "hadithNumber": 2756,
      "english": {
        "narrated": "Narrated Abu Hurairah:",
        "hadith": "that the Messenger of Allah (ﷺ) said: \"Five are from the Fitrah: Cutting the pubic hair, circumcision, paring the mustache, plucking the under arm hair and trimming the fingernails.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ خَمْسٌ مِنَ الْفِطْرَةِ الاِسْتِحْدَادُ وَالْخِتَانُ وَقَصُّ الشَّارِبِ وَنَتْفُ الإِبْطِ وَتَقْلِيمُ الأَظْفَارِ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2756
    },
    {
      "hadithNumber": 2757,
      "english": {
        "narrated": "Narrated 'Aishah:",
        "hadith": "that the Prophet (ﷺ) said: \"Ten are from the Fitrah: Paring the mustache, leaving the beard to grow, Siwak, cleaning the nose with water, paring the fingernails, washing the knuckles, plucking the underarm hair, shaving the pubic hairs, and Intiqas with water.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ عَشْرٌ مِنَ الْفِطْرَةِ قَصُّ الشَّارِبِ وَإِعْفَاءُ اللِّحْيَةِ وَالسِّوَاكُ وَالاِسْتِنْشَاقُ وَقَصُّ الأَظْفَارِ وَغَسْلُ الْبَرَاجِمِ وَنَتْفُ الإِبْطِ وَحَلْقُ الْعَانَةِ وَانْتِقَاصُ الْمَاءِ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2757
    },
    {
      "hadithNumber": 2758,
      "english": {
        "narrated": "Narrated Anas:",
        "hadith": "from the Prophet (ﷺ), that he (ﷺ) fixed the time as every forty nights for them to trimming the fingernails, taking from the mustache, and shaving the pubic hairs.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، حَدَّثَنَا صَدَقَةُ بْنُ مُوسَى أَبُو مُحَمَّدٍ، صَاحِبُ الدَّقِيقِ حَدَّثَنَا أَبُو عِمْرَانَ الْجَوْنِيُّ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ وَقَّتَ لَهُمْ فِي كُلِّ أَرْبَعِينَ لَيْلَةً تَقْلِيمَ الأَظْفَارِ وَأَخْذَ الشَّارِبِ وَحَلْقَ الْعَانَةِ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2758
    },
    {
      "hadithNumber": 2759,
      "english": {
        "narrated": "Narrated Anas bin Malik:",
        "hadith": "\"[The Messenger of Allah (ﷺ)] fixed the time for us paring the mustache, trimming the fingernails, shaving the pubic hairs and plucking the underarm hairs - that we not leave it for more than forty days.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ، عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ وَقَّتَ لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي قَصِّ الشَّارِبِ وَتَقْلِيمِ الأَظْفَارِ وَحَلْقِ الْعَانَةِ وَنَتْفِ الإِبْطِ أَنْ لاَ نَتْرُكَ أَكْثَرَ مِنْ أَرْبَعِينَ يَوْمًا ‏.‏ قَالَ هَذَا أَصَحُّ مِنْ حَدِيثِ الأَوَّلِ ‏.‏ وَصَدَقَةُ بْنُ مُوسَى لَيْسَ عِنْدَهُمْ بِالْحَافِظِ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2759
    },
    {
      "hadithNumber": 2760,
      "english": {
        "narrated": "Narrated Ibn 'Abbas:",
        "hadith": "\"The Prophet (ﷺ) would pare, or take from his mustache, and Ibrahim Khalilur-Rahman would do it (as well).\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا مُحَمَّدُ بْنُ عُمَرَ بْنِ الْوَلِيدِ الْكِنْدِيُّ الْكُوفِيُّ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ إِسْرَائِيلَ، عَنْ سِمَاكٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقُصُّ أَوْ يَأْخُذُ مِنْ شَارِبِهِ وَكَانَ إِبْرَاهِيمُ خَلِيلُ الرَّحْمَنِ يَفْعَلُهُ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2760
    },
    {
      "hadithNumber": 2761,
      "english": {
        "narrated": "Narrated Zaid bin Arqam:",
        "hadith": "that the Messenger of Allah (ﷺ) said: \"Whoever does not take from his mustache, then he is not from us.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مَنْ لَمْ يَأْخُذْ مِنْ شَارِبِهِ فَلَيْسَ مِنَّا ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2761
    },
    {
      "hadithNumber": 2762,
      "english": {
        "narrated": "Narrated 'Amr bin Shu'aib:",
        "hadith": "from his father, from his grandfather that he Prophet (ﷺ) would take from his beard; from its breadth and its length.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا عُمَرُ بْنُ هَارُونَ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَأْخُذُ مِنْ لِحْيَتِهِ مِنْ عَرْضِهَا وَطُولِهَا ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ ‏.‏ وَسَمِعْتُ مُحَمَّدَ بْنَ إِسْمَاعِيلَ يَقُولُ عُمَرُ بْنُ هَارُونَ مُقَارِبُ الْحَدِيثِ لاَ أَعْرِفُ لَهُ حَدِيثًا لَيْسَ إِسْنَادُهُ أَصْلاً أَوْ قَالَ يَنْفَرِدُ بِهِ إِلاَّ هَذَا الْحَدِيثَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَأْخُذُ مِنْ لِحْيَتِهِ مِنْ عَرْضِهَا وَطُولِهَا ‏.‏ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ عُمَرَ بْنِ هَارُونَ وَرَأَيْتُهُ حَسَنَ الرَّأْىِ فِي عُمَرَ بْنِ هَارُونَ ‏.‏ قَالَ أَبُو عِيسَى وَسَمِعْتُ قُتَيْبَةَ يَقُولُ عُمَرُ بْنُ هَارُونَ كَانَ صَاحِبَ حَدِيثٍ وَكَانَ يَقُولُ الإِيمَانُ قَوْلٌ وَعَمَلٌ ‏.‏ \n\n قَالَ سَمِعْتُ قُتَيْبَةَ، حَدَّثَنَا وَكِيعُ بْنُ الْجَرَّاحِ، عَنْ رَجُلٍ، عَنْ ثَوْرِ بْنِ يَزِيدَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَصَبَ الْمَنْجَنِيقَ عَلَى أَهْلِ الطَّائِفِ ‏.‏ قَالَ قُتَيْبَةُ قُلْتُ لِوَكِيعٍ مَنْ هَذَا قَالَ صَاحِبُكُمْ عُمَرُ بْنُ هَارُونَ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2762
    },
    {
      "hadithNumber": 2763,
      "english": {
        "narrated": "Narrated Ibn 'Umar:",
        "hadith": "that the Messenger of Allah (ﷺ) said: \"Trim the mustache and leave the beard to grow.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ أَحْفُوا الشَّوَارِبَ وَأَعْفُوا اللِّحَى ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2763
    },
    {
      "hadithNumber": 2764,
      "english": {
        "narrated": "Narrated Ibn 'Umar:",
        "hadith": "that the Messenger of Allah (ﷺ) ordered trimming the mustache and leaving the beard to grow.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا الأَنْصَارِيُّ، حَدَّثَنَا مَعْنٌ، حَدَّثَنَا مَالِكٌ، عَنْ أَبِي بَكْرِ بْنِ نَافِعٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَنَا بِإِحْفَاءِ الشَّوَارِبِ وَإِعْفَاءِ اللِّحَى ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَأَبُو بَكْرِ بْنُ نَافِعٍ هُوَ مَوْلَى ابْنِ عُمَرَ ثِقَةٌ وَعُمَرُ بْنُ نَافِعٍ ثِقَةٌ وَعَبْدُ اللَّهِ بْنُ نَافِعٍ مَوْلَى ابْنِ عُمَرَ يُضَعَّفُ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2764
    },
    {
      "hadithNumber": 2765,
      "english": {
        "narrated": "Narrated 'Abbad bin Tamim:",
        "hadith": "from his paternal uncle, that he saw the Prophet (ﷺ) reclining in the Masjid, and placing one of his feet atop another.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ، وَغَيْرُ، وَاحِدٍ، قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عن عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَمِّهِ، أَنَّهُ رَأَى النَّبِيَّ صلى الله عليه وسلم مُسْتَلْقِيًا فِي الْمَسْجِدِ وَاضِعًا إِحْدَى رِجْلَيْهِ عَلَى الأُخْرَى ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَعَمُّ عَبَّادِ بْنِ تَمِيمٍ هُوَ عَبْدُ اللَّهِ بْنُ زَيْدِ بْنِ عَاصِمٍ الْمَازِنِيُّ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2765
    },
    {
      "hadithNumber": 2766,
      "english": {
        "narrated": "Narrated Jabir:",
        "hadith": "\"The Messenger of Allah (ﷺ) prohibited Ishtimal As-Samma, Al-Ihtiba in one garment, and that a man raise one of his feet atop the other while he is reclining on his back.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِذَا اسْتَلْقَى أَحَدُكُمْ عَلَى ظَهْرِهِ فَلاَ يَضَعْ إِحْدَى رِجْلَيْهِ عَلَى الأُخْرَى ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2766
    },
    {
      "hadithNumber": 2767,
      "english": {
        "narrated": "Narrated Jabir:",
        "hadith": "\"The Messenger of Allah (ﷺ) prohibited Ishtimal As-Samma, Al-Ihtiba in one garment, and that a man raise one of his feet atop the other while he is reclining on his back.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ اشْتِمَالِ الصَّمَّاءِ وَالاِحْتِبَاءِ فِي ثَوْبٍ وَاحِدٍ وَأَنْ يَرْفَعَ الرَّجُلُ إِحْدَى رِجْلَيْهِ عَلَى الأُخْرَى وَهُوَ مُسْتَلْقٍ عَلَى ظَهْرِهِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2767
    },
    {
      "hadithNumber": 2768,
      "english": {
        "narrated": "Narrated Abu Hurairah:",
        "hadith": "that the Messenger of Allah (ﷺ) saw a man laying on his stomach so he said: \"Indeed such laying is not loved by Allah.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنَّ هَذِهِ ضَجْعَةٌ لاَ يُحِبُّهَا اللَّهُ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2768
    },
    {
      "hadithNumber": 2769,
      "english": {
        "narrated": "Narrated Bahz bin Hakim:",
        "hadith": "\"My father narrated to me from my grandfather, who said: 'I said: \"O Messenger of Allah! Regarding our 'Awrah, what of it must we cover and what of it may we leave?\" He said: \"Protect your 'Awrah except from your wife or what your right hand possesses.\"' He said: \"What about a man with another man?\" He said: \"If you are able to not let anyone see it, then do so.\" I said: \"What about a man when he is alone?\" He said: \"Allah is most deserving of being shy from Him.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا بَهْزُ بْنُ حَكِيمٍ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ عَوْرَاتُنَا مَا نَأْتِي مِنْهَا وَمَا نَذَرُ قَالَ ‏\"‏ احْفَظْ عَوْرَتَكَ إِلاَّ مِنْ زَوْجَتِكَ أَوْ مِمَّا مَلَكَتْ يَمِينُكَ ‏\"‏ ‏.‏ فَقَالَ الرَّجُلُ يَكُونُ مَعَ الرَّجُلِ قَالَ ‏\"‏ إِنِ اسْتَطَعْتَ أَنْ لاَ يَرَاهَا أَحَدٌ فَافْعَلْ ‏\"‏ ‏.‏ قُلْتُ وَالرَّجُلُ يَكُونُ خَالِيًا ‏.‏ قَالَ ‏\"‏ فَاللَّهُ أَحَقُّ أَنْ يُسْتَحْيَا مِنْهُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏ وَجَدُّ بَهْزٍ اسْمُهُ مُعَاوِيَةُ بْنُ حَيْدَةَ الْقُشَيْرِيُّ وَقَدْ رَوَى الْجُرَيْرِيُّ عَنْ حَكِيمِ بْنِ مُعَاوِيَةَ وَهُوَ وَالِدُ بَهْزٍ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2769
    },
    {
      "hadithNumber": 2770,
      "english": {
        "narrated": "Narrated Jabir bin Samurah:",
        "hadith": "\"I saw the Messenger of Allah (ﷺ) reclining upon as pillow, on his left side.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا عَبَّاسُ بْنُ مُحَمَّدٍ الدُّورِيُّ الْبَغْدَادِيُّ، حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ الْكُوفِيُّ، أَخْبَرَنَا إِسْرَائِيلُ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم مُتَّكِئًا عَلَى وِسَادَةٍ عَلَى يَسَارِهِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَرَوَى غَيْرُ وَاحِدٍ هَذَا الْحَدِيثَ عَنْ إِسْرَائِيلَ عَنْ سِمَاكٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم مُتَّكِئًا عَلَى وِسَادَةٍ ‏.‏ وَلَمْ يَذْكُرْ عَلَى يَسَارِهِ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2770
    },
    {
      "hadithNumber": 2771,
      "english": {
        "narrated": "Narrated Jabir bin Samurah:",
        "hadith": "\"I saw the Prophet (ﷺ) reclining upon a pillow.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا يُوسُفُ بْنُ عِيسَى، حَدَّثَنَا وَكِيعٌ، عَنْ إِسْرَائِيلَ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم مُتَّكِئًا عَلَى وِسَادَةٍ ‏.‏ هَذَا حَدِيثٌ صَحِيحٌ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2771
    },
    {
      "hadithNumber": 2772,
      "english": {
        "narrated": "Narrated Abu Mas'ud:",
        "hadith": "that the Messenger of Allah (ﷺ) said: \"A man is not lead in his dominion, and his seat of honor in his house is not sat in without his permission.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لاَ يُؤَمُّ الرَّجُلُ فِي سُلْطَانِهِ وَلاَ يُجْلَسُ عَلَى تَكْرِمَتِهِ فِي بَيْتِهِ إِلاَّ بِإِذْنِهِ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2772
    },
    {
      "hadithNumber": 2773,
      "english": {
        "narrated": "Narrated 'Abdullah bin Buraidah:",
        "hadith": "\"I heard my father Buraidah saying: 'I was walking with the Prophet (ﷺ) when a man came to him with a donkey, so he said: \"O Messenger of Allah! Ride\" and the man moved toward the back. The Messenger of Allah (ﷺ) said: \"No, you have more right to the front of your beast, unless you allot it for me.\" He said: \"I have allotted it for you.'\" He said: 'So he rode.'\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لأَنْتَ أَحَقُّ بِصَدْرِ دَابَّتِكَ إِلاَّ أَنْ تَجْعَلَهُ لِي ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2773
    },
    {
      "hadithNumber": 2774,
      "english": {
        "narrated": "Narrated Jabir:",
        "hadith": "that the Messenger of Allah (ﷺ) said: \"Do you have Anmat?\" I said: \"Where would we get Anmat from?\" He said: \"Soon you will have Anmat\" He said: \"I would say to my wife: 'Remove your Anmat from my sight.' But she would say: 'Did not the Messenger of Allah (ﷺ) say: \"Indeed you shall soon have Anmat?\" He said: \"So I left it.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلْ لَكُمْ أَنْمَاطٌ ‏\"‏ ‏.‏ قُلْتُ وَأَنَّى تَكُونُ لَنَا أَنْمَاطٌ قَالَ ‏\"‏ أَمَا إِنَّهَا سَتَكُونُ لَكُمْ أَنْمَاطٌ ‏\"‏ ‏.‏ قَالَ فَأَنَا أَقُولُ لاِمْرَأَتِي أَخِّرِي عَنِّي أَنْمَاطَكِ فَتَقُولُ أَلَمْ يَقُلِ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّهَا سَتَكُونُ لَكُمْ أَنْمَاطٌ ‏\"‏ ‏.‏ قَالَ فَأَدَعُهَا ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2774
    },
    {
      "hadithNumber": 2775,
      "english": {
        "narrated": "Narrated Iyas bin Salamah:",
        "hadith": "from his father who said: \"I guided Allah's Prophet (ﷺ) and Al-Hasan and Al-Husain, on his gray mule until I brought him to the apartment of the Prophet (ﷺ), this one was in front of him, and this one behind him.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا عَبَّاسٌ الْعَنْبَرِيُّ بْنُ عَبْدِ الْعَظِيمِ، حَدَّثَنَا النَّضْرُ بْنُ مُحَمَّدٍ، هُوَ الْجُرَشِيُّ الْيَمَامِيُّ حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ، عَنْ إِيَاسِ بْنِ سَلَمَةَ، عَنْ أَبِيهِ، قَالَ لَقَدْ قُدْتُ نَبِيَّ اللَّهِ صلى الله عليه وسلم وَالْحَسَنَ وَالْحُسَيْنَ عَلَى بَغْلَتِهِ الشَّهْبَاءِ حَتَّى أَدْخَلْتُهُ حُجْرَةَ النَّبِيِّ صلى الله عليه وسلم هَذَا قُدَّامُهُ وَهَذَا خَلْفُهُ ‏.‏ وَفِي الْبَابِ عَنِ ابْنِ عَبَّاسٍ وَعَبْدِ اللَّهِ بْنِ جَعْفَرٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2775
    },
    {
      "hadithNumber": 2776,
      "english": {
        "narrated": "Narrated Jabir bin 'Abdullah:",
        "hadith": "\"I asked the Messenger Of Allah (ﷺ) about the unintentional glance, so he ordered me that I divert my sight.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا يُونُسُ بْنُ عُبَيْدٍ، عَنْ عَمْرِو بْنِ سَعِيدٍ، عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ، عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ نَظْرَةِ الْفَجْأَةِ فَأَمَرَنِي أَنْ أَصْرِفَ بَصَرِي ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَأَبُو زُرْعَةَ بْنُ عَمْرٍو اسْمُهُ هَرِمٌ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2776
    },
    {
      "hadithNumber": 2777,
      "english": {
        "narrated": "Narrated Ibn Buraidah:",
        "hadith": "from his father (from the Prophet (ﷺ)) who said: \"O 'Ali! Do not follow a look with a look, the first is for you, but the next is not for you.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ يَا عَلِيُّ لاَ تُتْبِعِ النَّظْرَةَ النَّظْرَةَ فَإِنَّ لَكَ الأُولَى وَلَيْسَتْ لَكَ الآخِرَةُ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2777
    },
    {
      "hadithNumber": 2778,
      "english": {
        "narrated": "Narrated Nabhan the freed slave of Umm Salamah:",
        "hadith": "to Ibn Shihab, that Umm Salamah narrated to him, that she and Maimunah were with the Messenger of Allah (ﷺ), she said: \"So when we were with him, Ibn Umm Maktum came, and he entered upon him, and that was after veiling had been ordered for us. So the Messenger of Allah (ﷺ) said: 'Veil yourselves from him.' So I said: 'O Messenger of Allah! Is he not blind such that he can not see us or recognize us?' So the Messenger of Allah (ﷺ) said: 'Are you two blind such that you can not see him?'\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا سُوَيْدٌ، حَدَّثَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا يُونُسُ بْنُ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، عَنْ نَبْهَانَ، مَوْلَى أُمِّ سَلَمَةَ أَنَّهُ حَدَّثَهُ أَنَّ أُمَّ سَلَمَةَ حَدَّثَتْهُ أَنَّهَا، كَانَتْ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَمَيْمُونَةُ قَالَتْ فَبَيْنَا نَحْنُ عِنْدَهُ أَقْبَلَ ابْنُ أُمِّ مَكْتُومٍ فَدَخَلَ عَلَيْهِ وَذَلِكَ بَعْدَ مَا أُمِرْنَا بِالْحِجَابِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ احْتَجِبَا مِنْهُ ‏\"‏ ‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ أَلَيْسَ هُوَ أَعْمَى لاَ يُبْصِرُنَا وَلاَ يَعْرِفُنَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَفَعَمْيَاوَانِ أَنْتُمَا أَلَسْتُمَا تُبْصِرَانِهِ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2778
    },
    {
      "hadithNumber": 2779,
      "english": {
        "narrated": "Narrated Dhakwan:",
        "hadith": "from the freed slave of 'Amr bin Al-'As that 'Amr bin Al-'As sent him to 'Ali seeking his permission to enter upon Asma bint Umais, so he permitted him. When he was finished from what he needed, the freed slave of 'Amr bin Al-'As asked about that, so he said: \"Indeed the Prophet (ﷺ) prohibited us - or - prohibited that we enter upon women, without the permission of their husbands.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ، حَدَّثَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ ذَكْوَانَ، عَنْ مَوْلَى، عَمْرِو بْنِ الْعَاصِي أَنَّ عَمْرَو بْنَ الْعَاصِي، أَرْسَلَهُ إِلَى عَلِيٍّ يَسْتَأْذِنُهُ عَلَى أَسْمَاءَ بِنْتِ عُمَيْسٍ فَأَذِنَ لَهُ حَتَّى إِذَا فَرَغَ مِنْ حَاجَتِهِ سَأَلَ الْمَوْلَى عَمْرَو بْنَ الْعَاصِي عَنْ ذَلِكَ فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَانَا أَنْ نَدْخُلَ عَلَى النِّسَاءِ بِغَيْرِ إِذْنِ أَزْوَاجِهِنَّ ‏.‏ وَفِي الْبَابِ عَنْ عُقْبَةَ بْنِ عَامِرٍ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو وَجَابِرٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2779
    },
    {
      "hadithNumber": 2780,
      "english": {
        "narrated": "Narrated Usamah bin Zaid, and Sa'eed bin Zaid bin 'Amr bin Nufail:",
        "hadith": "that the Prophet (ﷺ) said: \"I have not left among the people after me, a Fitnah more harmful upon men than women.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مَا تَرَكْتُ بَعْدِي فِي النَّاسِ فِتْنَةً أَضَرَّ عَلَى الرِّجَالِ مِنَ النِّسَاءِ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2780
    },
    {
      "hadithNumber": 2780,
      "english": {
        "narrated": "",
        "hadith": "Another chain with a similar narration",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ أَبِي عُثْمَانَ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2780
    },
    {
      "hadithNumber": 2781,
      "english": {
        "narrated": "Narrated Humaid bin 'Abdur-Rahman:",
        "hadith": "that he heard Mu'awiyah giving a Khutbah in Al-Madinah, and saying: \"Where are your scholars, O people of Al-Madinah? [Indeed] I heard the Messenger of Allah (ﷺ) forbidding from these locks (of hair), and saying: 'The Children of Isra'il were only ruined when their women used them.'\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنَّمَا هَلَكَتْ بَنُو إِسْرَائِيلَ حِينَ اتَّخَذَهَا نِسَاؤُهُمْ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2781
    },
    {
      "hadithNumber": 2782,
      "english": {
        "narrated": "Narrated 'Abdullah:",
        "hadith": "that the Prophet (ﷺ) cursed the women who practice tattooing and those who seek to be tattooed, the women who remove hair from their faces seeking beautification by changing the creation of Allah.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا عَبِيدَةُ بْنُ حُمَيْدٍ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم لَعَنَ الْوَاشِمَاتِ وَالْمُسْتَوْشِمَاتِ وَالْمُتَنَمِّصَاتِ مُبْتَغِيَاتٍ لِلْحُسْنِ مُغَيِّرَاتٍ خَلْقَ اللَّهِ ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رَوَاهُ شُعْبَةُ وَغَيْرُ وَاحِدٍ مِنَ الأَئِمَّةِ عَنْ مَنْصُورٍ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2782
    },
    {
      "hadithNumber": 2783,
      "english": {
        "narrated": "Narrated Ibn 'Umar:",
        "hadith": "that the Prophet (ﷺ) said: \"Allah's curse is upon the woman who lengthens hair and the women who seeks to have her hair lengthened, and the woman who tattoos and the woman who seeks to have her herself tattooed.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لَعَنَ اللَّهُ الْوَاصِلَةَ وَالْمُسْتَوْصِلَةَ وَالْوَاشِمَةَ وَالْمُسْتَوْشِمَةَ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2783
    },
    {
      "hadithNumber": 2783,
      "english": {
        "narrated": "",
        "hadith": "(Another chain) with a similar narration",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ وَلَمْ يَذْكُرْ فِيهِ يَحْيَى قَوْلَ نَافِعٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2783
    },
    {
      "hadithNumber": 2784,
      "english": {
        "narrated": "Narrated Ibn 'Abbas:",
        "hadith": "\"The Messenger of Allah (ﷺ) cursed the women who imitate men and the men who imitate women.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ، حَدَّثَنَا شُعْبَةُ، وَهَمَّامٌ، عَنْ قَتَادَةَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمُتَشَبِّهَاتِ بِالرِّجَالِ مِنَ النِّسَاءِ وَالْمُتَشَبِّهِينَ بِالنِّسَاءِ مِنَ الرِّجَالِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2784
    },
    {
      "hadithNumber": 2785,
      "english": {
        "narrated": "Narrated Ibn 'Abbas:",
        "hadith": "\"The Messenger of Allah (ﷺ) cursed those men who behave effeminately and those women whose behavior is masculine.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، وَأَيُّوبَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمُخَنَّثِينَ مِنَ الرِّجَالِ وَالْمُتَرَجِّلاَتِ مِنَ النِّسَاءِ ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَفِي الْبَابِ عَنْ عَائِشَةَ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2785
    },
    {
      "hadithNumber": 2786,
      "english": {
        "narrated": "Narrated Abu Musa:",
        "hadith": "that the Prophet (ﷺ) said: \"Every eye commits adultery, and when the woman uses perfume and she passes by a gathering, then she is like this and that.'\" Meaning an adulteress.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ كُلُّ عَيْنٍ زَانِيَةٌ وَالْمَرْأَةُ إِذَا اسْتَعْطَرَتْ فَمَرَّتْ بِالْمَجْلِسِ فَهِيَ كَذَا وَكَذَا يَعْنِي زَانِيَةً ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2786
    },
    {
      "hadithNumber": 2787,
      "english": {
        "narrated": "Narrated Abu Hurairah:",
        "hadith": "that the Messenger of Allah (ﷺ) said: \"Fragrance for men is that which its scent is apparent and its color is hidden, and fragrance for women is that which its color is visible and its scent is hidden.\" (Meaning when leaving the home as indicated by the previous chapter. As far as in the presence of the husband, then the woman may wear fragrant perfume.)",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ طِيبُ الرِّجَالِ مَا ظَهَرَ رِيحُهُ وَخَفِيَ لَوْنُهُ وَطِيبُ النِّسَاءِ مَا ظَهَرَ لَوْنُهُ وَخَفِيَ رِيحُهُ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2787
    },
    {
      "hadithNumber": 2887,
      "english": {
        "narrated": "",
        "hadith": "Another chain of narration similar in meaning.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي نَضْرَةَ، عَنِ الطُّفَاوِيِّ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ بِمَعْنَاهُ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ إِلاَّ أَنَّ الطُّفَاوِيَّ لاَ نَعْرِفُهُ إِلاَّ فِي هَذَا الْحَدِيثِ وَلاَ نَعْرِفُ اسْمَهُ ‏.‏ وَحَدِيثُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ أَتَمُّ وَأَطْوَلُ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2887
    },
    {
      "hadithNumber": 2788,
      "english": {
        "narrated": "Narrated 'Imran bin Husain:",
        "hadith": "\"The Prophet (ﷺ) said [to me]: 'Indeed the best fragrance for men is what's scent is apparent and its color is hidden, and the best fragrance for women is what's color is visible and its scent is hidden.' And he prohibited Mitharatil-Urjawan (Mitharah was some type of saddle cloth. Some of the people of knowledge say it was a certain kind of cloth made of silk, and it preceded earlier under no. 1760. They disagree over Al-Urjawan, and perhaps it means whatever is red, meaning the Red Mitahrah, see Tuhfat Al-Ahwadhi).\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنَّ خَيْرَ طِيبِ الرَّجُلِ مَا ظَهَرَ رِيحُهُ وَخَفِيَ لَوْنُهُ وَخَيْرَ طِيبِ النِّسَاءِ مَا ظَهَرَ لَوْنُهُ وَخَفِيَ رِيحُهُ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2788
    },
    {
      "hadithNumber": 2789,
      "english": {
        "narrated": "Narrated Thumamah bin 'Abdullah:",
        "hadith": "\"Anas would not refuse perfume, and Anas said: 'Indeed the Prophet (ﷺ) would not refuse perfume.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا عَزْرَةُ بْنُ ثَابِتٍ، عَنْ ثُمَامَةَ بْنِ عَبْدِ اللَّهِ، قَالَ كَانَ أَنَسٌ لاَ يَرُدُّ الطِّيبَ ‏.‏ وَقَالَ أَنَسٌ إِنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ لاَ يَرُدُّ الطِّيبَ ‏.‏ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2789
    },
    {
      "hadithNumber": 2790,
      "english": {
        "narrated": "Narrated Ibn 'Umar:",
        "hadith": "that the Messenger of Allah (ﷺ) said: \"There are three that are not refused: Cushions, oils [Duhn (fragrance)], and milk.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ ثَلاَثٌ لاَ تُرَدُّ الْوَسَائِدُ وَالدُّهْنُ وَاللَّبَنُ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2790
    },
    {
      "hadithNumber": 2791,
      "english": {
        "narrated": "Narrated Abu 'Uthman An-Nahdi:",
        "hadith": "\"The Messenger of Allah (ﷺ) said: 'When one of you is given some fragrance then do not refuse it, for indeed it comes from Paradise.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِذَا أُعْطِيَ أَحَدُكُمُ الرَّيْحَانَ فَلاَ يَرُدَّهُ فَإِنَّهُ خَرَجَ مِنَ الْجَنَّةِ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2791
    },
    {
      "hadithNumber": 2792,
      "english": {
        "narrated": "Narrated 'Abdullah:",
        "hadith": "that the Messenger of Allah (ﷺ) said: \"A woman is not to touch a woman such that she can describe her to her husband as if he is looking at her.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لاَ تُبَاشِرُ الْمَرْأَةُ الْمَرْأَةَ حَتَّى تَصِفَهَا لِزَوْجِهَا كَأَنَّمَا يَنْظُرُ إِلَيْهَا ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2792
    },
    {
      "hadithNumber": 2793,
      "english": {
        "narrated": "Narrated 'Abdur-Rahman bin Abi Sa'eed [Al-Khudri]\nfrom his father who said:",
        "hadith": "\"The Messenger of Allah (ﷺ) said: 'A man is not to look at the 'Awrah of a man, and a woman is not to look at the 'Awrah of a woman. A man is not to be alone with a man under one garment, and a woman is not to be alone with a woman under one garment.'\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لاَ يَنْظُرُ الرَّجُلُ إِلَى عَوْرَةِ الرَّجُلِ وَلاَ تَنْظُرُ الْمَرْأَةُ إِلَى عَوْرَةِ الْمَرْأَةِ وَلاَ يُفْضِي الرَّجُلُ إِلَى الرَّجُلِ فِي الثَّوْبِ الْوَاحِدِ وَلاَ تُفْضِي الْمَرْأَةُ إِلَى الْمَرْأَةِ فِي الثَّوْبِ الْوَاحِدِ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2793
    },
    {
      "hadithNumber": 2794,
      "english": {
        "narrated": "Narrated Bahz bin Hakim:",
        "hadith": "from his father, from his grandfather, who said: \"I said: 'O Prophet of Allah! Regarding our 'Awrah, what of it must we cover and what of it may we leave?' He said: 'Protect your 'Awrah except from your wife or what your right hand possesses.' He said: \"I said: 'O Messenger of Allah! What about when some people are with others?' He said: 'If you are able to not let anyone see it then do not let them see it.'\" He said: \"I said: 'O Prophet of Allah! What about when one of us is alone?' He said: 'Allah is more deserving of being shy from Him than the people.'\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ، وَيَزِيدُ بْنُ هَارُونَ، قَالاَ حَدَّثَنَا بَهْزُ بْنُ حَكِيمٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قُلْتُ يَا نَبِيَّ اللَّهِ عَوْرَاتُنَا مَا نَأْتِي مِنْهَا وَمَا نَذَرُ قَالَ ‏\"‏ احْفَظْ عَوْرَتَكَ إِلاَّ مِنْ زَوْجَتِكَ أَوْ مَا مَلَكَتْ يَمِينُكَ ‏\"‏ ‏.‏ قُلْتُ يَا رَسُولَ اللَّهِ إِذَا كَانَ الْقَوْمُ بَعْضُهُمْ فِي بَعْضٍ قَالَ ‏\"‏ إِنِ اسْتَطَعْتَ أَنْ لاَ يَرَاهَا أَحَدٌ فَلاَ يَرَيَنَّهَا ‏\"‏ ‏.‏ قَالَ قُلْتُ يَا نَبِيَّ اللَّهِ إِذَا كَانَ أَحَدُنَا خَالِيًا قَالَ ‏\"‏ فَاللَّهُ أَحَقُّ أَنْ يَسْتَحْيِيَ مِنْهُ النَّاسُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2794
    },
    {
      "hadithNumber": 2795,
      "english": {
        "narrated": "Narrated Zur'ah bin Muslim bin Jardah Al-Aslami:",
        "hadith": "about his grandfather Jarhad, he said: \"The Prophet (ﷺ) passed by Jarhad in the Masjid and his thigh was exposed, so he said: 'Indeed the thigh is 'Awrah.'\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنَّ الْفَخِذَ عَوْرَةٌ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2795
    },
    {
      "hadithNumber": 2796,
      "english": {
        "narrated": "Narrated 'Abdullah bin Jardah Al-Aslami:",
        "hadith": "from his father, from the Prophet (ﷺ) who said: \"The thigh is 'Awrah.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ الْفَخِذُ عَوْرَةٌ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2796
    },
    {
      "hadithNumber": 2797,
      "english": {
        "narrated": "Narrated Ibn 'Abbas:",
        "hadith": "that the Prophet (ﷺ) said: \"The thigh is 'Awrah.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ الْفَخِذُ عَوْرَةٌ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2797
    },
    {
      "hadithNumber": 2798,
      "english": {
        "narrated": "Narrated Abu Az-Zinad:",
        "hadith": "\"Ibn Jarhad informed me from his father, that the Prophet (ﷺ) passed by him while his thigh was exposed, so the Prophet (ﷺ) said: 'Cover your thigh, for indeed it is 'Awrah.'\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ غَطِّ فَخِذَكَ فَإِنَّهَا مِنَ الْعَوْرَةِ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2798
    },
    {
      "hadithNumber": 2799,
      "english": {
        "narrated": "Narrated Salih bin Abi Hassan:",
        "hadith": "\"I heard Sa'eed bin Musayyab saying: 'Indeed Allah is Tayyib (good) and he loves Tayyib (what is good), and He is Nazif (clean) and He loves cleanliness, He is Karim (kind) and He loves kindness, He is Jawad (generous) and He loves generosity. So clean' - I think he said - 'your courtyards, and do not resemble the Jews.'\" He said: \"I mentioned that to Muhajir bin Mismar, and he said: \"Amir bin Sa'd [bin Abi Waqqas] narrated it to me from his father from the Prophet (ﷺ), similarly, except that he did not say: \"Clean your courtyards.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو عَامِرٍ الْعَقَدِيُّ، حَدَّثَنَا خَالِدُ بْنُ إِلْيَاسَ، وَيُقَالُ ابْنُ إِيَاسٍ، عَنْ صَالِحِ بْنِ أَبِي حَسَّانَ، قَالَ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ إِنَّ اللَّهَ طَيِّبٌ يُحِبُّ الطَّيِّبَ نَظِيفٌ يُحِبُّ النَّظَافَةَ كَرِيمٌ يُحِبُّ الْكَرَمَ جَوَادٌ يُحِبُّ الْجُودَ فَنَظِّفُوا أُرَاهُ قَالَ أَفْنِيَتَكُمْ وَلاَ تَشَبَّهُوا بِالْيَهُودِ ‏.‏ قَالَ فَذَكَرْتُ ذَلِكَ لِمُهَاجِرِ بْنِ مِسْمَارٍ فَقَالَ حَدَّثَنِيهِ عَامِرُ بْنُ سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنْ أَبِيهِ عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ إِلاَّ أَنَّهُ قَالَ نَظِّفُوا أَفْنِيَتَكُمْ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ ‏.‏ وَخَالِدُ بْنُ إِلْيَاسَ يُضَعَّفُ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2799
    },
    {
      "hadithNumber": 2800,
      "english": {
        "narrated": "Narrated Abu Muhayyah:",
        "hadith": "from Laith, from Nafi, from Ibn 'Umar that the Messenger of Allah (ﷺ) said: \"Beware of nakedness! For indeed there are with you, those who do not part from you except at the place of defecation, and when a man goes into his wife. So be shy of them and honor them.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِيَّاكُمْ وَالتَّعَرِّي فَإِنَّ مَعَكُمْ مَنْ لاَ يُفَارِقُكُمْ إِلاَّ عِنْدَ الْغَائِطِ وَحِينَ يُفْضِي الرَّجُلُ إِلَى أَهْلِهِ فَاسْتَحْيُوهُمْ وَأَكْرِمُوهُمْ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2800
    },
    {
      "hadithNumber": 2801,
      "english": {
        "narrated": "Narrated Jabir:",
        "hadith": "that the Prophet (ﷺ) said: \"Whoever believes in Allah and the Last Day, then he is not to let his wife enter the Hammam, and whoever believes in Allah and the Last Day, then he is not to enter the Hammam without an Izar. And whoever believes in Allah and the Last Day, then he is not to sit at a spread in which Khamr is circulated.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلاَ يَدْخُلِ الْحَمَّامَ بِغَيْرِ إِزَارٍ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلاَ يُدْخِلْ حَلِيلَتَهُ الْحَمَّامَ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلاَ يَجْلِسْ عَلَى مَائِدَةٍ يُدَارُ عَلَيْهَا بِالْخَمْرِ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2801
    },
    {
      "hadithNumber": 2802,
      "english": {
        "narrated": "Narrated Abu 'Udhrah [and he lived during the time of the Prophet (ﷺ)]:",
        "hadith": "from 'Aishah, that the Prophet (ﷺ) prohibitied the men and women from the Hammamat (plural of Hammam), then he permitted it for the men in Izar.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ الأَعْرَجِ، عَنْ أَبِي عُذْرَةَ، وَكَانَ، قَدْ أَدْرَكَ النَّبِيَّ صلى الله عليه وسلم عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى الرِّجَالَ وَالنِّسَاءَ عَنِ الْحَمَّامَاتِ ثُمَّ رَخَّصَ لِلرِّجَالِ فِي الْمَيَازِرِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ حَمَّادِ بْنِ سَلَمَةَ وَإِسْنَادُهُ لَيْسَ بِذَاكَ الْقَائِمِ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2802
    },
    {
      "hadithNumber": 2803,
      "english": {
        "narrated": "Narrated Abu Al-Malih Al-Hudhali:",
        "hadith": "that some women from the inhabitants of Hims, or from the inhabitants of Ash-Sham entered upon 'Aishah, so she said: \"Are you those whose women enter the Hammamat? I heard the Messenger of Allah (ﷺ) saying: 'No woman removes her garments in other than the house of her husband except that she has torn the screen between herself and her Lord.'\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مَا مِنِ امْرَأَةٍ تَضَعُ ثِيَابَهَا فِي غَيْرِ بَيْتِ زَوْجِهَا إِلاَّ هَتَكَتِ السِّتْرَ بَيْنَهَا وَبَيْنَ رَبِّهَا ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2803
    },
    {
      "hadithNumber": 2804,
      "english": {
        "narrated": "Narrated Ibn 'Abbas:",
        "hadith": "\"I heard Abu Talhah saying: 'I heard the Messenger of Allah (ﷺ) saying: \"The angels do not enter a house in which there is a dog or an object of images.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لاَ تَدْخُلُ الْمَلاَئِكَةُ بَيْتًا فِيهِ كَلْبٌ وَلاَ صُورَةُ تَمَاثِيلَ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2804
    },
    {
      "hadithNumber": 2805,
      "english": {
        "narrated": "Narrated Ishaq bin 'Abdullah bin Abi Talhah:",
        "hadith": "that Rafi' bin Ishaq informed him, saying: \"I and 'Abdullah bin Abi Talhah entered upon Abu Sa'eed Al-Khudri to visit him. So Abu Sa'eed said: 'The Messenger of Allah (ﷺ) informed us: \"The angels do not enter a house in which there is an image or a picture.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّ رَافِعَ بْنَ إِسْحَاقَ، أَخْبَرَهُ قَالَ دَخَلْتُ أَنَا وَعَبْدُ اللَّهِ بْنُ أَبِي طَلْحَةَ، عَلَى أَبِي سَعِيدٍ الْخُدْرِيِّ نَعُودُهُ فَقَالَ أَبُو سَعِيدٍ أَخْبَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم أَنَّ الْمَلاَئِكَةَ لاَ تَدْخُلُ بَيْتًا فِيهِ تَمَاثِيلُ أَوْ صُورَةٌ ‏.‏ شَكَّ إِسْحَاقُ لاَ يَدْرِي أَيُّهُمَا قَالَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2805
    },
    {
      "hadithNumber": 2806,
      "english": {
        "narrated": "Narrated Abu Hurairah:",
        "hadith": "that the Messenger of Allah (ﷺ) said: \"Jibra'il came to me and said: \"Indeed I had come to you last night, and nothing prevented me from entering upon you at the house you were in, except that there were images of men at the door of the house, and there was a curtain screen with imagines on it, and there was a dog in the house. So go and sever the head of the image that is at the door so that it will become like a tree stump, and go and cut the screen and make two throw-cushions to be sat upon, and go and expel the dog.\" So the Messenger of Allah (ﷺ) did so, and the dog was a puppy belonging to Al-Husain or Al-Hasan which was under his belongings, so he ordered him to expel it.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ أَتَانِي جِبْرِيلُ فَقَالَ إِنِّي كُنْتُ أَتَيْتُكَ الْبَارِحَةَ فَلَمْ يَمْنَعْنِي أَنْ أَكُونَ دَخَلْتُ عَلَيْكَ الْبَيْتَ الَّذِي كُنْتَ فِيهِ إِلاَّ أَنَّهُ كَانَ فِي بَابِ الْبَيْتِ تِمْثَالُ الرِّجَالِ وَكَانَ فِي الْبَيْتِ قِرَامُ سِتْرٍ فِيهِ تَمَاثِيلُ وَكَانَ فِي الْبَيْتِ كَلْبٌ فَمُرْ بِرَأْسِ التِّمْثَالِ الَّذِي بِالْبَابِ فَلْيُقْطَعْ فَيَصِيرَ كَهَيْئَةِ الشَّجَرَةِ وَمُرْ بِالسِّتْرِ فَلْيُقْطَعْ وَيُجْعَلْ مِنْهُ وِسَادَتَيْنِ مُنْتَبَذَتَيْنِ يُوَطَآنِ وَمُرْ بِالْكَلْبِ فَيُخْرَجْ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2806
    },
    {
      "hadithNumber": 2807,
      "english": {
        "narrated": "Narrated 'Abdullah bin 'Amr:",
        "hadith": "\"A man passed by while wearing two red garments. He gave Salam to the Prophet (ﷺ) but he did not return the Salam.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا عَبَّاسُ بْنُ مُحَمَّدٍ الْبَغْدَادِيُّ، حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا إِسْرَائِيلُ، عَنْ أَبِي يَحْيَى، عَنْ مُجَاهِدٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ مَرَّ رَجُلٌ وَعَلَيْهِ ثَوْبَانِ أَحْمَرَانِ فَسَلَّمَ عَلَى النَّبِيِّ صلى الله عليه وسلم فَلَمْ يَرُدَّ النَّبِيُّ صلى الله عليه وسلم عَلَيْهِ السَّلاَمَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏ وَمَعْنَى هَذَا الْحَدِيثِ عِنْدَ أَهْلِ الْعِلْمِ أَنَّهُمْ كَرِهُوا لُبْسَ الْمُعَصْفَرِ وَرَأَوْا أَنَّ مَا صُبِغَ بِالْحُمْرَةِ بِالْمَدَرِ أَوْ غَيْرِ ذَلِكَ فَلاَ بَأْسَ بِهِ إِذَا لَمْ يَكُنْ مُعَصْفَرًا ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2807
    },
    {
      "hadithNumber": 2808,
      "english": {
        "narrated": "Narrated 'Ali bin Abi Talib:",
        "hadith": "\"The Messenger of Allah (ﷺ) prohibited the gold ring, Al-Qassi, Al-Mitharah, and Al-Ji'ah (beer).\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ أَبِي إِسْحَاقَ، عَنْ هُبَيْرَةَ بْنِ يَرِيمَ، قَالَ قَالَ عَلِيُّ بْنُ أَبِي طَالِبٍ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ خَاتِمِ الذَّهَبِ وَعَنِ الْقَسِّيِّ وَعَنِ الْمِيثَرَةِ وَعَنِ الْجَعَةِ ‏.‏ قَالَ أَبُو الأَحْوَصِ وَهُوَ شَرَابٌ يُتَّخَذُ بِمِصْرَ مِنَ الشَّعِيرِ ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2808
    },
    {
      "hadithNumber": 2809,
      "english": {
        "narrated": "Narrated Al-Bara bin 'Azib:",
        "hadith": "\"The Messenger of Allah (ﷺ) ordered us with seven things and he forbade us from seven. He ordered us to follow the funeral, visit the ill, reply to the sneezing person, accept the invitation, assist the oppressed, to help the one who made an oath, and to return the Salam. And he forbade us from seven things: From the gold ring, or ringlets of gold, silver vessels, wearing silk, Ad-Dibaj, Al-Istabraq, And Al-Qassi.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالاَ حَدَّثَنَا شُعْبَةُ، عَنِ الأَشْعَثِ بْنِ سُلَيْمٍ، عَنْ مُعَاوِيَةَ بْنِ سُوَيْدِ بْنِ مُقَرِّنٍ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ أَمَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِسَبْعٍ وَنَهَانَا عَنْ سَبْعٍ أَمَرَنَا بِاتِّبَاعِ الْجَنَازَةِ وَعِيَادَةِ الْمَرِيضِ وَتَشْمِيتِ الْعَاطِسِ وَإِجَابَةِ الدَّاعِي وَنَصْرِ الْمَظْلُومِ وَإِبْرَارِ الْقَسَمِ وَرَدِّ السَّلاَمِ وَنَهَانَا عَنْ سَبْعٍ عَنْ خَاتِمِ الذَّهَبِ أَوْ حَلْقَةِ الذَّهَبِ وَآنِيَةِ الْفِضَّةِ وَلُبْسِ الْحَرِيرِ وَالدِّيبَاجِ وَالإِسْتَبْرَقِ وَالْقَسِّيِّ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَأَشْعَثُ بْنُ سُلَيْمٍ هُوَ أَشْعَثُ بْنُ أَبِي الشَّعْثَاءِ وَأَبُو الشَّعْثَاءِ اسْمُهُ سُلَيْمُ بْنُ الأَسْوَدِ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2809
    },
    {
      "hadithNumber": 2810,
      "english": {
        "narrated": "Narrated Samurah bin Jundab:",
        "hadith": "\"The Messenger of Allah (ﷺ) said: 'Wear white, for indeed it is very pure and cleaner, and shroud your dead in it.'\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ الْبَسُوا الْبَيَاضَ فَإِنَّهَا أَطْهَرُ وَأَطْيَبُ وَكَفِّنُوا فِيهَا مَوْتَاكُمْ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2810
    },
    {
      "hadithNumber": 2811,
      "english": {
        "narrated": "Narrated Jabir Bin Samurah:",
        "hadith": "\"I saw the Prophet (ﷺ) on a clear night, so I looked at the Messenger of Allah (ﷺ) and at the moon, and he was wearing a red Hullah, and he looked better than the moon to me.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا عَبْثَرُ بْنُ الْقَاسِمِ، عَنِ الأَشْعَثِ، وَهُوَ ابْنُ سَوَّارٍ عَنْ أَبِي إِسْحَاقَ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي لَيْلَةٍ إِضْحِيَانٍ فَجَعَلْتُ أَنْظُرُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَإِلَى الْقَمَرِ وَعَلَيْهِ حُلَّةٌ حَمْرَاءُ فَإِذَا هُوَ عِنْدِي أَحْسَنُ مِنَ الْقَمَرِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ الأَشْعَثِ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2811
    },
    {
      "hadithNumber": 2811,
      "english": {
        "narrated": "Shu'bah and Ath-Thawri reported it from Abu Ishaq from Al-Bara bin 'Azib who said:",
        "hadith": "\"I saw a red Hullah on the Messenger of Allah.\" (Another chain of narration.)",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وَرَوَى شُعْبَةُ، وَالثَّوْرِيُّ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ رَأَيْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم حُلَّةً حَمْرَاءَ ‏.‏ حَدَّثَنَا بِذَلِكَ مَحْمُودُ بْنُ غَيْلاَنَ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي إِسْحَاقَ وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مَحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَاقَ بِهَذَا ‏.‏ وَفِي الْحَدِيثِ كَلاَمٌ أَكْثَرُ مِنْ هَذَا ‏.‏ قَالَ سَأَلْتُ مُحَمَّدًا قُلْتُ لَهُ حَدِيثُ أَبِي إِسْحَاقَ عَنِ الْبَرَاءِ أَصَحُّ أَوْ حَدِيثُ جَابِرِ بْنِ سَمُرَةَ فَرَأَى كِلاَ الْحَدِيثَيْنِ صَحِيحًا ‏.‏ وَفِي الْبَابِ عَنِ الْبَرَاءِ وَأَبِي جُحَيْفَةَ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2811
    },
    {
      "hadithNumber": 2812,
      "english": {
        "narrated": "Narrated Abu Rimthah:",
        "hadith": "\"I saw the Messenger of Allah wearing two green Burud.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ إِيَادِ بْنِ لَقِيطٍ، عَنْ أَبِيهِ، عَنْ أَبِي رِمْثَةَ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَعَلَيْهِ بُرْدَانِ أَخْضَرَانِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ عُبَيْدِ اللَّهِ بْنِ إِيَادٍ ‏.‏ وَأَبُو رِمْثَةَ التَّيْمِيُّ يُقَالُ اسْمُهُ حَبِيبُ بْنُ حَيَّانَ وَيُقَالُ اسْمُهُ رِفَاعَةُ بْنُ يَثْرِبِيٍّ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2812
    },
    {
      "hadithNumber": 2813,
      "english": {
        "narrated": "Narrated 'Aishah:",
        "hadith": "\"The Messenger of Allah (ﷺ) went out during the morning wearing a Mirt made of black hair.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ، أَخْبَرَنِي أَبِي، عَنْ مُصْعَبِ بْنِ شَيْبَةَ، عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ، عَنْ عَائِشَةَ، قَالَتْ خَرَجَ النَّبِيُّ صلى الله عليه وسلم ذَاتَ غَدَاةٍ وَعَلَيْهِ مِرْطٌ مِنْ شَعَرٍ أَسْوَدَ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ صَحِيحٌ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2813
    },
    {
      "hadithNumber": 2814,
      "english": {
        "narrated": "Narrated 'Abdullah bin Hassan:",
        "hadith": "that his grandmothers Safiyyah bint 'Ulaibah and Dhuhaibah bint 'Ulaibah narrated to him, from Qailah bint Makhramah - and they were her wet nurses and Qailah was the grandmother of their father - his mother's mother - she said: \"We came to the Messenger of Allah (ﷺ)\" and she mentioned the Hadith in its entirety; \"until a man came when the sun had rose up, so he said: \"As-Salamu 'Alaika O Messenger of Allah!' So the Messenger of Allah (ﷺ) said: 'Wa 'Alaikas-Salamu Wa Rahmatullah' and upon him - meaning the Prophet (ﷺ) - were two tattered cloths, which had been dyed with saffron and had faded, and he had a small date-palm branch with him.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ وَعَلَيْكَ السَّلاَمُ وَرَحْمَةُ اللَّهِ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2814
    },
    {
      "hadithNumber": 2815,
      "english": {
        "narrated": "Narrated Anas bin Malik:",
        "hadith": "that the Messenger of Allah (ﷺ) prohibited saffron for men.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، قَالَ ح وَحَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ حَمَّادِ بْنِ زَيْدٍ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ التَّزَعْفُرِ لِلرِّجَالِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ \n\n وَرَوَى شُعْبَةُ، هَذَا الْحَدِيثَ عَنْ إِسْمَاعِيلَ ابْنِ عُلَيَّةَ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنِ التَّزَعْفُرِ ‏.‏ حَدَّثَنَا بِذَلِكَ عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ حَدَّثَنَا آدَمُ عَنْ شُعْبَةَ ‏.‏ قَالَ أَبُو عِيسَى وَمَعْنَى كَرَاهِيَةِ التَّزَعْفُرِ لِلرِّجَالِ أَنْ يَتَزَعْفَرَ الرَّجُلُ يَعْنِي أَنْ يَتَطَيَّبَ بِهِ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2815
    },
    {
      "hadithNumber": 2816,
      "english": {
        "narrated": "Narrated Ya'la bin Murrah:",
        "hadith": "\"The Prophet (ﷺ) saw a man wearing Khuluq and said: 'Go and wash it, then wash it, then do not use it again.'\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ اذْهَبْ فَاغْسِلْهُ ثُمَّ اغْسِلْهُ ثُمَّ لاَ تَعُدْ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2816
    },
    {
      "hadithNumber": 2817,
      "english": {
        "narrated": "Narrated The freed slave of Asma:",
        "hadith": "from Ibn 'Umar who said: \"I heard 'Umar mentioning that the Prophet (ﷺ) said: 'Whoever wears silk in the world he shall not wear it in the Hereafter.'\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مَنْ لَبِسَ الْحَرِيرَ فِي الدُّنْيَا لَمْ يَلْبَسْهُ فِي الآخِرَةِ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2817
    },
    {
      "hadithNumber": 2818,
      "english": {
        "narrated": "Narrated Al-Miswar bin Makhramah:",
        "hadith": "\"The Messenger of Allah (ﷺ) distributed some cloaks but he did not give anything to Makhramah. Makhramah said: 'O my son! Let us go to the Messenger of Allah (ﷺ).' So I went with him. He said: 'Enter and call him for me.'So I called the Prophet (ﷺ) for him, then the Prophet (ﷺ) came out wearing one of the cloaks. He (ﷺ) said: 'I kept this one for you.'\" He said: \"So he looked at him and said: 'Makhramah is pleased.'\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَسَمَ أَقْبِيَةً وَلَمْ يُعْطِ مَخْرَمَةَ شَيْئًا فَقَالَ مَخْرَمَةُ يَا بُنَىَّ انْطَلِقْ بِنَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَانْطَلَقْتُ مَعَهُ قَالَ ادْخُلْ فَادْعُهُ لِي فَدَعَوْتُهُ لَهُ فَخَرَجَ النَّبِيُّ صلى الله عليه وسلم وَعَلَيْهِ قِبَاءٌ مِنْهَا فَقَالَ ‏\"‏ خَبَأْتُ لَكَ هَذَا ‏\"‏ ‏.‏ قَالَ فَنَظَرَ إِلَيْهِ فَقَالَ ‏\"‏ رَضِيَ مَخْرَمَةُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَابْنُ أَبِي مُلَيْكَةَ اسْمُهُ عَبْدُ اللَّهِ بْنُ عُبَيْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2818
    },
    {
      "hadithNumber": 2819,
      "english": {
        "narrated": "Narrated 'Amr bin Shu'aib:",
        "hadith": "from his father, from his grandfather who said: \"The Messenger of Allah (ﷺ) said: 'Indeed Allah loves to see the results of his favors upon His Slaves.'\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنَّ اللَّهَ يُحِبَّ أَنْ يُرَى أَثَرُ نِعْمَتِهِ عَلَى عَبْدِهِ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2819
    },
    {
      "hadithNumber": 2820,
      "english": {
        "narrated": "Narrated Ibn Buraidah:",
        "hadith": "from his father: \"An-Najashi gave the Prophet (ﷺ) two black plain Khuff. So he wore them, then he performed Wudu and wiped over them.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا هَنَّادٌ، حَدَّثَنَا وَكِيعٌ، عَنْ دَلْهَمِ بْنِ صَالِحٍ، عَنْ حُجَيْرِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، أَنَّ النَّجَاشِيَّ، أَهْدَى إِلَى النَّبِيِّ صلى الله عليه وسلم خُفَّيْنِ أَسْوَدَيْنِ سَاذَجَيْنِ فَلَبِسَهُمَا ثُمَّ تَوَضَّأَ وَمَسَحَ عَلَيْهِمَا ‏.‏ قَالَ هَذَا حَدِيثٌ حَسَنٌ إِنَّمَا نَعْرِفُهُ مِنْ حَدِيثِ دَلْهَمٍ وَقَدْ رَوَاهُ مُحَمَّدُ بْنُ رَبِيعَةَ عَنْ دَلْهَمٍ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2820
    },
    {
      "hadithNumber": 2821,
      "english": {
        "narrated": "Narrated 'Amr bin Shu'aib:",
        "hadith": "from his father, from his grandfather: \"The Prophet (ﷺ) prohibited plucking gray hair. And he said: \"It is the Muslim's light.'\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنَّهُ نُورُ الْمُسْلِمِ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2821
    },
    {
      "hadithNumber": 2822,
      "english": {
        "narrated": "Narrated Abu Hurairah:",
        "hadith": "that the Messenger of Allah (ﷺ) said: \"The one whose counsel is sought is entrusted.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ الْمُسْتَشَارُ مُؤْتَمَنٌ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2822
    },
    {
      "hadithNumber": 2823,
      "english": {
        "narrated": "Narrated Umm Salamah:",
        "hadith": "\"The Messenger of Allah (ﷺ) said: 'The one whose council is sought is entrusted.'\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ الْمُسْتَشَارُ مُؤْتَمَنٌ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2823
    },
    {
      "hadithNumber": 2824,
      "english": {
        "narrated": "Narrated Salim and Hamzah, the sons of 'Abdullah bin 'Umar:",
        "hadith": "from their father that the Messenger of Allah (ﷺ) said: \"An omen is in three: A woman, a dwelling, and a (riding) beast.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، وَحَمْزَةَ، ابْنَىْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِمَا، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ الشُّؤْمُ فِي ثَلاَثَةٍ فِي الْمَرْأَةِ وَالْمَسْكَنِ وَالدَّابَّةِ ‏\". \n\n‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَبَعْضُ أَصْحَابِ الزُّهْرِيِّ لاَ يَذْكُرُونَ فِيهِ عَنْ حَمْزَةَ إِنَّمَا يَقُولُونَ عَنْ سَالِمٍ عَنْ أَبِيهِ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَرَوَى مَالِكُ بْنُ أَنَسٍ هَذَا الْحَدِيثَ عَنِ الزُّهْرِيِّ فَقَالَ عَنْ سَالِمٍ وَحَمْزَةَ ابْنَىْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِمَا وَهَكَذَا رَوَى لَنَا ابْنُ أَبِي عُمَرَ هَذَا الْحَدِيثَ عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ عَنِ الزُّهْرِيِّ عَنْ سَالِمٍ وَحَمْزَةَ ابْنَىْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِمَا عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ \n\n حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِنَحْوِهِ وَلَمْ يَذْكُرْ فِيهِ سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ حَمْزَةَ، وَرِوَايَةُ، سَعِيدٍ أَصَحُّ لأَنَّ عَلِيَّ بْنَ الْمَدِينِيِّ وَالْحُمَيْدِيَّ رَوَيَا عَنْ سُفْيَانَ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، وَذَكَرَا، عَنْ سُفْيَانَ، قَالَ لَمْ يَرْوِ لَنَا الزُّهْرِيُّ هَذَا الْحَدِيثَ إِلاَّ عَنْ سَالِمٍ عَنِ ابْنِ عُمَرَ ‏.‏ وَرَوَى مَالِكُ بْنُ أَنَسٍ هَذَا الْحَدِيثَ عَنِ الزُّهْرِيِّ وَقَالَ عَنْ سَالِمٍ وَحَمْزَةَ ابْنَىْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِمَا ‏.‏ وَفِي الْبَابِ عَنْ سَهْلِ بْنِ سَعْدٍ وَعَائِشَةَ وَأَنَسٍ ‏.‏ - وَقَدْ رُوِيَ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\"‏ إِنْ كَانَ الشُّؤْمُ فِي شَيْءٍ فَفِي الْمَرْأَةِ وَالدَّابَّةِ وَالْمَسْكَنِ ‏\"‏ ‏.‏ \n\n وَقَدْ رُوِيَ عَنْ حَكِيمِ بْنِ مُعَاوِيَةَ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏\"‏ لاَ شُؤْمَ وَقَدْ يَكُونُ الْيُمْنُ فِي الدَّارِ وَالْمَرْأَةِ وَالْفَرَسِ ‏\"‏ ‏.‏ حَدَّثَنَا بِذَلِكَ عَلِيُّ بْنُ حُجْرٍ حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ عَنْ سُلَيْمَانَ بْنِ سُلَيْمٍ عَنْ يَحْيَى بْنِ جَابِرٍ الطَّائِيِّ عَنْ مُعَاوِيَةَ بْنِ حَكِيمٍ عَنْ عَمِّهِ حَكِيمِ بْنِ مُعَاوِيَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2824
    },
    {
      "hadithNumber": 2825,
      "english": {
        "narrated": "Narrated 'Abdullah:",
        "hadith": "that the Messenger of Allah (ﷺ) said: \"Whenever there are three of you, then let two not converse in exclusion of their companion.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا هَنَّادٌ، قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، ح قَالَ وَحَدَّثَنِي ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا كُنْتُمْ ثَلاَثَةً فَلاَ يَتَنَاجَى اثْنَانِ دُونَ صَاحِبِهِمَا ‏\"‏ ‏.‏ وَقَالَ سُفْيَانُ فِي حَدِيثِهِ ‏\"‏ لاَ يَتَنَاجَى اثْنَانِ دُونَ الثَّالِثِ فَإِنَّ ذَلِكَ يُحْزِنُهُ ‏\"‏ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ - وَقَدْ رُوِيَ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏\"‏ لاَ يَتَنَاجَى اثْنَانِ دُونَ وَاحِدٍ فَإِنَّ ذَلِكَ يُؤْذِي الْمُؤْمِنَ وَاللَّهُ عَزَّ وَجَلَّ يَكْرَهُ أَذَى الْمُؤْمِنِ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنِ ابْنِ عُمَرَ وَأَبِي هُرَيْرَةَ وَابْنِ عَبَّاسٍ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2825
    },
    {
      "hadithNumber": 2826,
      "english": {
        "narrated": "Narrated Isma'il bin Abi Khalid:",
        "hadith": "that Abu Juhaifah said: \"I saw the Messenger of Allah (ﷺ) (he was) white and turning grey. Al-Hasan bin 'Ali resembles him most. He had promised thirteen young she-camels for us, so we went to get them. When we arrived he had died without giving us anything. So when Abu Bakr (became the Khalifah) he said: 'If there is anyone to whom the Messenger of Allah (ﷺ) made a promise, then let him come forth.' I stood to inform him about it, and he ordered that they be given to us.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الأَعْلَى الْكُوفِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنْ أَبِي جُحَيْفَةَ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم أَبْيَضَ قَدْ شَابَ وَكَانَ الْحَسَنُ بْنُ عَلِيٍّ يُشْبِهُهُ وَأَمَرَ لَنَا بِثَلاَثَةَ عَشَرَ قَلُوصًا فَذَهَبْنَا نَقْبِضُهَا فَأَتَانَا مَوْتُهُ فَلَمْ يُعْطُونَا شَيْئًا فَلَمَّا قَامَ أَبُو بَكْرٍ قَالَ مَنْ كَانَتْ لَهُ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم عِدَةٌ فَلْيَجِئْ ‏.‏ فَقُمْتُ إِلَيْهِ فَأَخْبَرْتُهُ فَأَمَرَ لَنَا بِهَا ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ ‏.‏ وَقَدْ رَوَى مَرْوَانُ بْنُ مُعَاوِيَةَ هَذَا الْحَدِيثَ بِإِسْنَادٍ لَهُ عَنْ أَبِي جُحَيْفَةَ نَحْوَ هَذَا ‏.‏ وَقَدْ رَوَى غَيْرُ وَاحِدٍ عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ عَنْ أَبِي جُحَيْفَةَ قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم وَكَانَ الْحَسَنُ بْنُ عَلِيٍّ يُشْبِهُهُ وَلَمْ يَزِيدُوا عَلَى هَذَا ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2826
    },
    {
      "hadithNumber": 2827,
      "english": {
        "narrated": "Narrated Isma'il bin Abi Khalid:",
        "hadith": "that Abu Juhaifah said: \"I saw the Prophet (ﷺ), and Al-Hasan bin 'Ali resembles him the most.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، حَدَّثَنَا أَبُو جُحَيْفَةَ، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم وَكَانَ الْحَسَنُ بْنُ عَلِيٍّ يُشْبِهُهُ ‏.‏ قَالَ أَبُو عِيسَى وَهَكَذَا رَوَى غَيْرُ وَاحِدٍ عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ نَحْوَ هَذَا ‏.‏ وَفِي الْبَابِ عَنْ جَابِرٍ ‏.‏ وَأَبُو جُحَيْفَةَ اسْمُهُ وَهْبٌ السُّوَائِيُّ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2827
    },
    {
      "hadithNumber": 2828,
      "english": {
        "narrated": "Narrated 'Ali:",
        "hadith": "\"I did not hear the Prophet (ﷺ) mentioning both of his parents (that is including both in the saying \"May my father and mother be ransomed for you\") for anyone other than Sa'd bin Abi Waqqas.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ عَلِيٍّ، قَالَ مَا سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم جَمَعَ أَبَوَيْهِ لأَحَدٍ غَيْرَ سَعْدِ بْنِ أَبِي وَقَّاصٍ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2828
    },
    {
      "hadithNumber": 2829,
      "english": {
        "narrated": "Narrated 'Ali:",
        "hadith": "\"The Messenger of Allah (ﷺ) did not mention both of his parents for anyone except Sa'd bin Abi Waqqas. On the Day of Uhud he said: 'Shoot, may my father and mother be ransomed for you.' And he said to him: 'Shoot! O young man.'\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا الْحَسَنُ بْنُ الصَّبَّاحِ الْبَزَّارُ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ جُدْعَانَ، وَيَحْيَى بْنِ سَعِيدٍ، سَمِعَا سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ قَالَ عَلِيٌّ مَا جَمَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَبَاهُ وَأُمَّهُ لأَحَدٍ إِلاَّ لِسَعْدِ بْنِ أَبِي وَقَّاصٍ قَالَ لَهُ يَوْمَ أُحُدٍ ‏\"‏ ارْمِ فِدَاكَ أَبِي وَأُمِّي ‏\"‏ ‏.‏ وَقَالَ لَهُ ‏\"‏ ارْمِ أَيُّهَا الْغُلاَمُ الْحَزَوَّرُ ‏\"‏ ‏.‏ وَفِي الْبَابِ عَنِ الزُّبَيْرِ وَجَابِرٍ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ عَلِيٍّ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2829
    },
    {
      "hadithNumber": 2830,
      "english": {
        "narrated": "Narrated Sa'd bin Abi Waqqas:",
        "hadith": "\"The Messenger of Allah (ﷺ) mentioned both of his parents to me on the Day of Uhud.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ ارْمِ فِدَاكَ أَبِي وَأُمِّي ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2830
    },
    {
      "hadithNumber": 2831,
      "english": {
        "narrated": "Narrated Anas:",
        "hadith": "that the Prophet (ﷺ) said to him: \"O my little son.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ يَا بُنَىَّ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2831
    },
    {
      "hadithNumber": 2832,
      "english": {
        "narrated": "Narrated 'Amr bin Shu'aib:",
        "hadith": "from his father, from his grandfather that the Prophet (ﷺ) ordered naming the child on the seventh day, removing the harm from him, and Al-'Aqq (removing the hair and slaughtering the animal for 'Aqiqah).",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ بْنِ سَعْدِ بْنِ إِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، حَدَّثَنِي عَمِّي، يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا شَرِيكٌ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَ بِتَسْمِيَةِ الْمَوْلُودِ يَوْمَ سَابِعِهِ وَوَضْعِ الأَذَى عَنْهُ وَالْعَقِّ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2832
    },
    {
      "hadithNumber": 2833,
      "english": {
        "narrated": "Narrated Ibn 'Umar:",
        "hadith": "that the Prophet (ﷺ) said: \"The most loved names to Allah are 'Abdullah and 'Abdur-Rahman.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ أَحَبُّ الأَسْمَاءِ إِلَى اللَّهِ عَزَّ وَجَلَّ عَبْدُ اللَّهِ وَعَبْدُ الرَّحْمَنِ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2833
    },
    {
      "hadithNumber": 2834,
      "english": {
        "narrated": "Narrated Ibn 'Umar:",
        "hadith": "that the Prophet (ﷺ) said: \"The most loved names to Allah are 'Abdullah and 'Abdur-Rahman.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنَّ أَحَبَّ الأَسْمَاءِ إِلَى اللَّهِ عَبْدُ اللَّهِ وَعَبْدُ الرَّحْمَنِ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2834
    },
    {
      "hadithNumber": 2835,
      "english": {
        "narrated": "Narrated 'Umar [bin Al-Khattab]:",
        "hadith": "that the Messenger of Allah (ﷺ) said: \"I forbid naming with Rafi, Barakah and Yasar.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لأَنْهَيَنَّ أَنْ يُسَمَّى رَافِعٌ وَبَرَكَةُ وَيَسَارٌ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2835
    },
    {
      "hadithNumber": 2836,
      "english": {
        "narrated": "Narrated Samurah bin Jundab:",
        "hadith": "that the Messenger of Allah (ﷺ) said: \"Do not name your boy Rabah, nor Aflah, nor Yasar, nor Najih, so that it may be said: 'Is he there?' and it may be said: 'No.'\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لاَ تُسَمِّي غُلاَمَكَ رَبَاحٌ وَلاَ أَفْلَحُ وَلاَ يَسَارٌ وَلاَ نَجِيحٌ يُقَالُ أَثَمَّ هُوَ فَيُقَالُ لاَ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2836
    },
    {
      "hadithNumber": 2837,
      "english": {
        "narrated": "Narrated Al-A'raj:",
        "hadith": "that Abu Hurairah conveyed to him that the Prophet (ﷺ) said: \"The most despicable (Akhna) name to Allah on the Day of Judgement is that of a man named King of Kings. (Malikil-Amlak).\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ أَخْنَعُ اسْمٍ عِنْدَ اللَّهِ يَوْمَ الْقِيَامَةِ رَجُلٌ تَسَمَّى بِمَلِكِ الأَمْلاَكِ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2837
    },
    {
      "hadithNumber": 2838,
      "english": {
        "narrated": "Narrated Ibn 'Umar:",
        "hadith": "that the Prophet (ﷺ) changed the name of 'Asiyah, he said: \"You are Jamilah.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ أَنْتِ جَمِيلَةُ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2838
    },
    {
      "hadithNumber": 2839,
      "english": {
        "narrated": "Narrated 'Aishah:",
        "hadith": "that the Prophet (ﷺ) would change abhorrent names.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ نَافِعٍ الْبَصْرِيُّ، حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ الْمُقَدَّمِيُّ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُغَيِّرُ الاِسْمَ الْقَبِيحَ ‏.‏ \n\n قَالَ أَبُو بَكْرِ بْنُ نَافِعٍ وَرُبَّمَا قَالَ عُمَرُ بْنُ عَلِيٍّ فِي هَذَا الْحَدِيثِ هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم مُرْسَلٌ وَلَمْ يَذْكُرْ فِيهِ عَنْ عَائِشَةَ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2839
    },
    {
      "hadithNumber": 2840,
      "english": {
        "narrated": "Narrated Muhammad bin Jubair bin Mut'im:",
        "hadith": "from his father that the Messenger of Allah (ﷺ) said: \"I have some names: I am Muhammad, I am Ahmad, I am Al-Mahi, the one by whom Allah wipes out disbelief, I am Al-Hasir, the one whom the people are gathered at his feet, and I am Al-'Aqib, the one after whom there is no Prophet.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنَّ لِي أَسْمَاءً أَنَا مُحَمَّدٌ وَأَنَا أَحْمَدُ وَأَنَا الْمَاحِي الَّذِي يَمْحُو اللَّهُ بِيَ الْكُفْرَ وَأَنَا الْحَاشِرُ الَّذِي يُحْشَرُ النَّاسُ عَلَى قَدَمِي وَأَنَا الْعَاقِبُ الَّذِي لَيْسَ بَعْدِي نَبِيٌّ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2840
    },
    {
      "hadithNumber": 2841,
      "english": {
        "narrated": "Narrated Abu Hurairah:",
        "hadith": "that the Prophet (ﷺ) prohibited that one use his name and his Kunyah; naming themselves Muhammad Abul-Qasim.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لاَ تَكْتَنُوا بِكُنْيَتِي ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2841
    },
    {
      "hadithNumber": 2842,
      "english": {
        "narrated": "Narrated Jabir:",
        "hadith": "that the Messenger of Allah (ﷺ): \"When you name yourself after me, then do not use my Kunyah.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِذَا سَمَّيْتُمْ بِاسْمِي فَلاَ تَكْتَنُوا بِي ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2842
    },
    {
      "hadithNumber": 2843,
      "english": {
        "narrated": "Narrated 'Ali bin Abi Talib:",
        "hadith": "that he said: \"O Messenger of Allah (ﷺ)! If I have a son after you do you think I could name him your Kunyah?\" He said: \"Yes.\" So he said: \"So that was permitted for me.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ نَعَمْ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2843
    },
    {
      "hadithNumber": 2844,
      "english": {
        "narrated": "Narrated 'Abdullah:",
        "hadith": "that the Messenger of Allah (ﷺ) said: \"Indeed some poetry is wisdom\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنَّ مِنَ الشِّعْرِ حِكْمَةً ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2844
    },
    {
      "hadithNumber": 2845,
      "english": {
        "narrated": "Narrated Ibn 'Abbas:",
        "hadith": "that the Messenger of Allah (ﷺ) said: \"Indeed some poetry is wisdom\".",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنَّ مِنَ الشِّعْرِ حُكْمًا ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2845
    },
    {
      "hadithNumber": 2846,
      "english": {
        "narrated": "Narrated 'Aishah:",
        "hadith": "\"The Messenger of Allah (ﷺ) had a Minbar placed in the Masjid for Hassan to stand to boast (poetically) about the Messenger of Allah (ﷺ)\" - or she said: \"to defend the Messenger of Allah (ﷺ). And the Messenger of Allah (ﷺ) said: 'Indeed Allah has aided Hassan with the holy spirit (Jibril) as he boasts about - or - defends the Messenger of Allah (ﷺ).'\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنَّ اللَّهَ يُؤَيِّدُ حَسَّانَ بِرُوحِ الْقُدُسِ مَا يُفَاخِرُ أَوْ يُنَافِحُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2846
    },
    {
      "hadithNumber": 2846,
      "english": {
        "narrated": "",
        "hadith": "(Another chain) from 'Aishah with the same narration.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ مُوسَى، وَعَلِيُّ بْنُ حُجْرٍ، قَالاَ حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ، عَنْ أَبِيهِ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ ‏.‏ وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ وَالْبَرَاءِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ وَهُوَ حَدِيثُ ابْنِ أَبِي الزِّنَادِ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2846
    },
    {
      "hadithNumber": 2847,
      "english": {
        "narrated": "Narrated Anas:",
        "hadith": "that the Prophet (ﷺ) entered Makkah during 'Umratil-Qada and 'Abdullah bin Rawahah was walking in front of him reciting verses of poetry.\n\"O tribes of disbelievers get out of his way - today we will strike you about its revelation; a strike that removes the heads from the shoulders - and makes the friend not concerned about his friend.\"\n'Umar said to him: \"O Ibn Rawahah! Before the Messenger of Allah (ﷺ), and in the sanctuary of Allah you utter poetry?\" the Messenger of Allah (ﷺ) said: \"Leave him O 'Umar! For it is quicker upon them than the raining arrow.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ خَلِّ عَنْهُ يَا عُمَرُ فَلَهِيَ أَسْرَعُ فِيهِمْ مِنْ نَضْحِ النَّبْلِ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2847
    },
    {
      "hadithNumber": 2848,
      "english": {
        "narrated": "Narrated Al-Miqdam bin Shuraih:",
        "hadith": "from his father, that 'Aishah was asked: \"Did the Prophet (ﷺ) used to say any poetry?\" She said: \"He would say parables with the poetry of Ibn Rawahah, saying: 'News shall come to you from where you did not expect it.'\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ وَيَأْتِيكَ بِالأَخْبَارِ مَنْ لَمْ تُزَوِّدِ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2848
    },
    {
      "hadithNumber": 2849,
      "english": {
        "narrated": "Narrated Abu Hurairah:",
        "hadith": "that the Prophet (ﷺ) said: \"The best statement spoken by the Arab is the saying of Labid: 'Everything aside from Allah perishes.'\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ أَشْعَرُ كَلِمَةٍ تَكَلَّمَتْ بِهَا الْعَرَبُ كَلِمَةُ لَبِيدٍ أَلاَ كُلُّ شَيْءٍ مَا خَلاَ اللَّهَ بَاطِلُ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2849
    },
    {
      "hadithNumber": 2850,
      "english": {
        "narrated": "Narrated Jabir bin Samurah:",
        "hadith": "\"I sat with the Prophet (ﷺ) more than one-hundred times. His Companions used to recite poetry and talk about things that occurred during Jahiliyyah, and he would remain silent, and sometimes he would smile along with them.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا شَرِيكٌ، عَنْ سِمَاكٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ جَالَسْتُ النَّبِيَّ صلى الله عليه وسلم أَكْثَرَ مِنْ مِائَةِ مَرَّةٍ فَكَانَ أَصْحَابُهُ يَتَنَاشَدُونَ الشِّعْرَ وَيَتَذَاكَرُونَ أَشْيَاءَ مِنْ أَمْرِ الْجَاهِلِيَّةِ وَهُوَ سَاكِتٌ فَرُبَّمَا تَبَسَّمَ مَعَهُمْ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏ وَقَدْ رَوَاهُ زُهَيْرٌ عَنْ سِمَاكٍ أَيْضًا ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2850
    },
    {
      "hadithNumber": 2852,
      "english": {
        "narrated": "Narrated Abu Hurairah:",
        "hadith": "that the Messenger of Allah (ﷺ) said: \"It is better that one of you fill his insides with puss than to fill it with poetry.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لأَنْ يَمْتَلِئَ جَوْفُ أَحَدِكُمْ قَيْحًا يَرِيهُ خَيْرٌ مِنْ أَنْ يَمْتَلِئَ شِعْرًا ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2852
    },
    {
      "hadithNumber": 2851,
      "english": {
        "narrated": "Narrated Muhammad bin Sa'd bin Abi Waqqas:",
        "hadith": "from his father that the Messenger of Allah (ﷺ) said: \"It is better that one of you fill his insides with puss than to fill it with poetry.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لأَنْ يَمْتَلِئَ جَوْفُ أَحَدِكُمْ قَيْحًا خَيْرٌ لَهُ مِنْ أَنْ يَمْتَلِئَ شِعْرًا ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2851
    },
    {
      "hadithNumber": 2853,
      "english": {
        "narrated": "Narrated 'Abdullah bin 'Amr:",
        "hadith": "that the Messenger of Allah (ﷺ) said: \"Indeed Allah detests the excessive among men, who slaps his tongue around like the cow slaps his tongue.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنَّ اللَّهَ يُبْغِضُ الْبَلِيغَ مِنَ الرِّجَالِ الَّذِي يَتَخَلَّلُ بِلِسَانِهِ كَمَا تَتَخَلَّلُ الْبَقَرَةُ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2853
    },
    {
      "hadithNumber": 2854,
      "english": {
        "narrated": "Narrated Jabir:",
        "hadith": "\"The Messenger of Allah (ﷺ) prohibited that a man sleep on a terrace without something to obstruct him (so that he will not roll off and fall).\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا إِسْحَاقُ بْنُ مُوسَى الأَنْصَارِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، عَنْ عَبْدِ الْجَبَّارِ بْنِ عُمَرَ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَنَامَ الرَّجُلُ عَلَى سَطْحٍ لَيْسَ بِمَحْجُورٍ عَلَيْهِ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ مِنْ حَدِيثِ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرٍ إِلاَّ مِنْ هَذَا الْوَجْهِ ‏.‏ وَعَبْدُ الْجَبَّارِ بْنُ عُمَرَ الأَيْلِيُّ يُضَعَّفُ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2854
    },
    {
      "hadithNumber": 2855,
      "english": {
        "narrated": "Narrated 'Abdullah:",
        "hadith": "\"The Messenger of Allah (ﷺ) used to take care of us by preaching during the days fearing that we may get bored.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا أَبُو أَحْمَدَ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَتَخَوَّلُنَا بِالْمَوْعِظَةِ فِي الأَيَّامِ مَخَافَةَ السَّآمَةِ عَلَيْنَا ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2855
    },
    {
      "hadithNumber": 3093,
      "english": {
        "narrated": "",
        "hadith": "(Another chain) with similar meaning.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، حَدَّثَنِي شَقِيقُ بْنُ سَلَمَةَ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، نَحْوَهُ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 3093
    },
    {
      "hadithNumber": 2856,
      "english": {
        "narrated": "Narrated Abu Salih:",
        "hadith": "\"I asked 'Aishah and Umm Salamah about which deed did the Messenger of Allah (ﷺ) like to do most. They said: 'Whatever he could do regularly, even if it was little.'\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو هِشَامٍ الرِّفَاعِيُّ، حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، قَالَ سُئِلَتْ عَائِشَةُ وَأُمُّ سَلَمَةَ أَىُّ الْعَمَلِ كَانَ أَحَبَّ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَتَا مَا دِيمَ عَلَيْهِ وَإِنْ قَلَّ ‏.‏ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2856
    },
    {
      "hadithNumber": 2856,
      "english": {
        "narrated": "It has been reported from Hisham bin 'Urwah from his father, that 'Aishah said:",
        "hadith": "\"The most loved deed to the Messenger\nof Allah (ﷺ) was what he could do regularly.\"\n\n(Another chain) with similar meaning.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وَقَدْ رُوِيَ عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ أَحَبُّ الْعَمَلِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم مَا دِيمَ عَلَيْهِ ‏.‏ حَدَّثَنَا بِذَلِكَ هَارُونُ بْنُ إِسْحَاقَ الْهَمْدَانِيُّ حَدَّثَنَا عَبْدَةُ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ بِمَعْنَاهُ ‏.‏ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ ‏.‏",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2856
    },
    {
      "hadithNumber": 2857,
      "english": {
        "narrated": "Narrated Jabir bin 'Abdullah:",
        "hadith": "that the Messenger of Allah (ﷺ) said: \"Cover the vessels, tie the water-skins, close the doors, extinguish the torches, for indeed the mischief-makers (vermin) may drag away the wick, causing a fire for the inhabitants of the house.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ خَمِّرُوا الآنِيَةَ وَأَوْكُوا الأَسْقِيَةَ وَأَجِيفُوا الأَبْوَابَ وَأَطْفِئُوا الْمَصَابِيحَ فَإِنَّ الْفُوَيْسِقَةَ رُبَّمَا جَرَّتِ الْفَتِيلَةَ فَأَحْرَقَتْ أَهْلَ الْبَيْتِ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2857
    },
    {
      "hadithNumber": 2858,
      "english": {
        "narrated": "Narrated Abu Hurairah:",
        "hadith": "that the Messenger of Allah (ﷺ) said: \"When you travel through fertile land, then give the camels their fill of the land, and when you travel through drought, then hasten while they are fresh, and when you camp late, then stay away from the road, for indeed it is the route of the beasts and the abode of poisonous vermin in the night.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِذَا سَافَرْتُمْ فِي الْخِصْبِ فَأَعْطُوا الإِبِلَ حَظَّهَا مِنَ الأَرْضِ وَإِذَا سَافَرْتُمْ فِي السَّنَةِ فَبَادِرُوا بِنِقْيِهَا وَإِذَا عَرَّسْتُمْ فَاجْتَنِبُوا الطَّرِيقَ فَإِنَّهَا طُرُقُ الدَّوَابِّ وَمَأْوَى الْهَوَامِّ بِاللَّيْلِ ‏\"",
        "grade": ""
      },
      "collectionId": "tirmidhi",
      "bookId": 43,
      "bookName": "43Chapters on Manners كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "bookReference": 2858
    }
  ]
}