{
  "collectionId": "ibnmajah",
  "bookId": 32,
  "bookName": "32Chapters on Dress كتاب اللباس",
  "hadithCount": 107,
  "hadiths": [
    {
      "hadithNumber": 3550,
      "english": {
        "narrated": "It was\nnarrated that ‘Aishah said:",
        "hadith": "“The Messenger of Allah (ﷺ) prayed\nin a Khamisah* that had markings on it. Then he said: ‘These\nmarkings distracted me. Take it to Abu Jahm and bring me an\nAnbijaniyyah.’”**",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ شَغَلَنِي أَعْلاَمُ هَذِهِ اذْهَبُوا بِهَا إِلَى أَبِي جَهْمٍ وَائْتُونِي بِأَنْبِجَانِيَّتِهِ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3550
    },
    {
      "hadithNumber": 3551,
      "english": {
        "narrated": "It was\nnarrated that Abu Burdah said:",
        "hadith": "“I entered upon ‘Aishah and she\nbrought out to me a thick waist wrap of the type made in Yemen, and\none of these cloaks that are called Mulabbadah,* and she swore to me\nthat the Messenger of Allah (ﷺ) had passed away in them.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، أَخْبَرَنِي سُلَيْمَانُ بْنُ الْمُغِيرَةِ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ أَبِي بُرْدَةَ، قَالَ دَخَلْتُ عَلَى عَائِشَةَ فَأَخْرَجَتْ لِي إِزَارًا غَلِيظًا مِنَ الَّتِي تُصْنَعُ بِالْيَمَنِ وَكِسَاءً مِنْ هَذِهِ الأَكْسِيَةِ الَّتِي تُدْعَى الْمُلَبَّدَةَ وَأَقْسَمَتْ لِي لَقُبِضَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فِيهِمَا ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3551
    },
    {
      "hadithNumber": 3552,
      "english": {
        "narrated": "",
        "hadith": "It was\nnarrated from ‘Ubadah bin Samit that the Messenger of Allah\n(ﷺ)\nprayed in a Shamlah tied with a knot.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَحْمَدُ بْنُ ثَابِتٍ الْجَحْدَرِيُّ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الأَحْوَصِ بْنِ حَكِيمٍ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ صَلَّى فِي شَمْلَةٍ قَدْ عَقَدَ عَلَيْهَا ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3552
    },
    {
      "hadithNumber": 3553,
      "english": {
        "narrated": "It was\nnarrated that Anas bin Malik said:",
        "hadith": "“I was with the Messenger\nof\nAllah (ﷺ) and over him was a Najrani upper wrap with a thick\nborder.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا يُونُسُ بْنُ عَبْدِ الأَعْلَى، حَدَّثَنَا ابْنُ وَهْبٍ، حَدَّثَنَا مَالِكٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كُنْتُ مَعَ النَّبِيِّ ـ صلى الله عليه وسلم ـ وَعَلَيْهِ رِدَاءٌ نَجْرَانِيٌّ غَلِيظُ الْحَاشِيَةِ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3553
    },
    {
      "hadithNumber": 3554,
      "english": {
        "narrated": "It was\nnarrated that ‘Aishah said:",
        "hadith": "“I never saw the Messenger of\nAllah\n(ﷺ) insulting anyone, and no garment was ever folded up for\nhim.”*",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا عَبْدُ الْقُدُّوسِ بْنُ مُحَمَّدٍ، حَدَّثَنَا بِشْرُ بْنُ عُمَرَ، حَدَّثَنَا ابْنُ لَهِيعَةَ، حَدَّثَنَا أَبُو الأَسْوَدِ، عَنْ عَاصِمِ بْنِ عُمَرَ بْنِ قَتَادَةَ، عَنْ عَلِيِّ بْنِ الْحُسَيْنِ، عَنْ عَائِشَةَ، قَالَتْ مَا رَأَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَسُبُّ أَحَدًا وَلاَ يُطْوَى لَهُ ثَوْبٌ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3554
    },
    {
      "hadithNumber": 3555,
      "english": {
        "narrated": "It was\nnarrated from Sahl bin Sa’d Sa’idi that a woman came to the\nMessenger of Allah (ﷺ) with a woven sheet – he said:",
        "hadith": "* “What\ntype of\nwoven sheet?” He said: “A Shamlah.” She said: “O\nMessenger of Allah, I\nhave woven this with my own hands for you to\nwear.” The Messenger of\nAllah (ﷺ) took it, since he needed it. He\ncame out to us wearing it\nas a lower wrap. So-and-so the son of\nso-and-so.” – a man whose name\nhe told that day – said: “O\nMessenger of Allah, how beautiful this\nsheet is! Let me wear it.”\nHe said: “Yes.” When he went inside he\nfolded it up and sent it\nto him. The people said to him: “By Allah,\nyou have not done well.\nThe Prophet (ﷺ) wore it because he needed\nit, then you asked for\nit, and you knew that he would not refuse\nanyone who asked him for\nsomething.” He said: “By Allah, I did not ask\nfor it so that I\ncould wear it, rather I asked for it so that it could\nbe my shroud.”\nSahl said: “And it became his shroud the day he died.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ نَعَمْ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3555
    },
    {
      "hadithNumber": 3556,
      "english": {
        "narrated": "It was\nnarrated that Anas said:",
        "hadith": "“The Messenger of Allah (ﷺ) wore\nwool\nand sandals, and he wore coarse, rough garments.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا يَحْيَى بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ الْحِمْصِيُّ، حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ، عَنْ يُوسُفَ بْنِ أَبِي كَثِيرٍ، عَنْ نُوحِ بْنِ ذَكْوَانَ، عَنِ الْحَسَنِ، عَنْ أَنَسٍ، قَالَ لَبِسَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ الصُّوفَ وَاحْتَذَى الْمَخْصُوفَ وَلَبِسَ ثَوْبًا خَشِنًا خَشِنًا ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3556
    },
    {
      "hadithNumber": 3557,
      "english": {
        "narrated": "It was\nnarrated that Abu Umamah said:",
        "hadith": "“Umar bin Khattab put on a new\ngarment and said: Al-hamdu lillahil-ladhi kasani ma uwari bihi\n‘awrati, wa atajammalu bihi fi hayati (Praise is to Allah Who has\nclothed me in something with which I conceal my nakedness and adorn\nmyself in my life). Then he said: ‘I heard the Messenger of Allah\n(ﷺ) say: “Whoever puts on a new garment and says: Al-hamdu\nlillahil-\nladhi kasani ma uwari bihi ‘awrati, wa atajammalu bihi fi\nhayati\n(Praise be to Allah Who has clothed me in something with which\nI\nconceal my nakedness and adorn myself in my life), then takes the\ngarment that has worn out, or that he had taken off and gives it in\ncharity, he will be under the shelter, protection and care of Allah,\nwhether he lives or dies.’ He said this three times.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مَنْ لَبِسَ ثَوْبًا جَدِيدًا فَقَالَ الْحَمْدُ لِلَّهِ الَّذِي كَسَانِي مَا أُوَارِي بِهِ عَوْرَتِي وَأَتَجَمَّلُ بِهِ فِي حَيَاتِي ‏.‏ ثُمَّ عَمَدَ إِلَى الثَّوْبِ الَّذِي أَخْلَقَ أَوْ أَلْقَى فَتَصَدَّقَ بِهِ كَانَ فِي كَنَفِ اللَّهِ وَفِي حِفْظِ اللَّهِ وَفِي سِتْرِ اللَّهِ حَيًّا وَمَيِّتًا ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3557
    },
    {
      "hadithNumber": 3558,
      "english": {
        "narrated": "It was\nnarrated from Ibn `Umar that the Messenger of Allah (ﷺ) saw\n`Umar\nwearing a white shirt and he said:",
        "hadith": "“Is this garment of yours\nwashed\nor a new one?” He said: “Rather it has been washed.” He said:\n“Ilbas jadida, wa `ish hamida, wa mut shahida (May you wear new\nclothes, live a good life and die as martyr).”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا الْحُسَيْنُ بْنُ مَهْدِيٍّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَنْبَأَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ رَأَى عَلَى عُمَرَ قَمِيصًا أَبْيَضَ فَقَالَ ‏\"‏ ثَوْبُكَ هَذَا غَسِيلٌ أَمْ جَدِيدٌ ‏\"‏ ‏.‏ قَالَ لاَ بَلْ غَسِيلٌ ‏.‏ قَالَ ‏\"‏ الْبَسْ جَدِيدًا وَعِشْ حَمِيدًا وَمُتْ شَهِيدًا ‏\"‏ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3558
    },
    {
      "hadithNumber": 3559,
      "english": {
        "narrated": "",
        "hadith": "It was\nnarrated from Abu Sa’eed Al-Khudri that the Prophet (ﷺ)\nforbade\ntwo kinds of dress. Those two types of dress are Ishtimalus-\nSamma’*\nand Ihtiba’ in a single garment, with no part of it upon his\nprivate part.**",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ نَهَى عَنْ لِبْسَتَيْنِ فَأَمَّا اللِّبْسَتَانِ فَاشْتِمَالُ الصَّمَّاءِ وَالاِحْتِبَاءُ فِي الثَّوْبِ الْوَاحِدِ لَيْسَ عَلَى فَرْجِهِ مِنْهُ شَىْءٌ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3559
    },
    {
      "hadithNumber": 3560,
      "english": {
        "narrated": "It was\nnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)\nforbade\ntwo kinds of dress:",
        "hadith": "Ishtimalus-Samma’ and Ihtiba’, exposing\none’s\nprivate part to the sky.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، وَأَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ، ‏.‏ أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ نَهَى عَنْ لِبْسَتَيْنِ عَنِ اشْتِمَالِ الصَّمَّاءِ وَعَنِ الاِحْتِبَاءِ فِي الثَّوْبِ الْوَاحِدِ يُفْضِي بِفَرْجِهِ إِلَى السَّمَاءِ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3560
    },
    {
      "hadithNumber": 3561,
      "english": {
        "narrated": "It was\nnarrated that ‘Aishah said:",
        "hadith": "“The Messenger of Allah (ﷺ)\nforbade\ntwo kinds of dress: Ishtimalus-Samma’ and Ihtiba’ in one\ngarment,\nwhen you are exposing your private part to the sky.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، وَأَبُو أُسَامَةَ عَنْ سَعْدِ بْنِ سَعِيدٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، قَالَتْ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ لِبْسَتَيْنِ اشْتِمَالِ الصَّمَّاءِ وَالاِحْتِبَاءِ فِي ثَوْبٍ وَاحِدٍ وَأَنْتَ مُفْضٍ فَرْجَكَ إِلَى السَّمَاءِ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3561
    },
    {
      "hadithNumber": 3562,
      "english": {
        "narrated": "It was\nnarrated from Abu Burdah that his father said to him:",
        "hadith": "“O my\nson, if\nonly you could have seen us when we were with the Messenger of\nAllah\n(ﷺ), when rain fell on us; you would have thought that we\nsmelled\nlike sheep.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى، عَنْ شَيْبَانَ، عَنْ قَتَادَةَ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِيهِ، قَالَ قَالَ لِي يَا بُنَىَّ لَوْ شَهِدْتَنَا وَنَحْنُ مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ إِذَا أَصَابَتْنَا السَّمَاءُ لَحَسِبْتَ أَنَّ رِيحَنَا رِيحُ الضَّأْنِ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3562
    },
    {
      "hadithNumber": 3563,
      "english": {
        "narrated": "It was\nnarrated that ‘Ubadah bin Samit said:",
        "hadith": "“The Messenger of Allah\n(ﷺ) came out to us one day, wearing a Roman cloak of wool with\nnarrow sleeves. He led us in prayer wearing that, and nothing else.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا مُحَمَّدُ بْنُ عُثْمَانَ بْنِ كَرَامَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا الأَحْوَصُ بْنُ حَكِيمٍ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ذَاتَ يَوْمٍ وَعَلَيْهِ جُبَّةٌ رُومِيَّةٌ مِنْ صُوفٍ ضَيِّقَةُ الْكُمَّيْنِ فَصَلَّى بِنَا فِيهَا لَيْسَ عَلَيْهِ شَىْءٌ غَيْرُهَا ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3563
    },
    {
      "hadithNumber": 3564,
      "english": {
        "narrated": "",
        "hadith": "It was\nnarrated from Salman Farisi that the Messenger of Allah (ﷺ)\nperformed ablution, then he turned his woolen cloak that he was\nwearing inside out and wiped his face with it.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ الدِّمَشْقِيُّ، وَأَحْمَدُ بْنُ الأَزْهَرِ، قَالاَ حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ، حَدَّثَنَا يَزِيدُ بْنُ السِّمْطِ، حَدَّثَنِي الْوَضِينُ بْنُ عَطَاءٍ، عَنْ مَحْفُوظِ بْنِ عَلْقَمَةَ، عَنْ سَلْمَانَ الْفَارِسِيِّ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ تَوَضَّأَ فَقَلَبَ جُبَّةَ صُوفٍ كَانَتْ عَلَيْهِ فَمَسَحَ بِهَا وَجْهَهُ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3564
    },
    {
      "hadithNumber": 3565,
      "english": {
        "narrated": "It was\nnarrated that Anas bin Malik said:",
        "hadith": "“I saw the Messenger of\nAllah\n(ﷺ) marking sheep on their ears, and I saw him wearing a cloak\naround his wrist.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا مُوسَى بْنُ الْفَضْلِ، عَنْ شُعْبَةَ، عَنْ هِشَامِ بْنِ زَيْدٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَسِمُ غَنَمًا فِي آذَانِهَا وَرَأَيْتُهُ مُتَّزِرًا بِكِسَاءٍ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3565
    },
    {
      "hadithNumber": 3566,
      "english": {
        "narrated": "It was\nnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)\nsaid:",
        "hadith": "“The best of your garments are the white ones, so wear them and\nshroud your dead in them.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ خَيْرُ ثِيَابِكُمُ الْبَيَاضُ فَالْبَسُوهَا وَكَفِّنُوا فِيهَا مَوْتَاكُمْ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3566
    },
    {
      "hadithNumber": 3567,
      "english": {
        "narrated": "It was\nnarrated from Samurah bin Jundab that the Messenger of Allah\n(ﷺ)\nsaid:",
        "hadith": "“Wear white garments, for they are purer and better.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ الْبَسُوا ثِيَابَ الْبَيَاضِ فَإِنَّهَا أَطْهَرُ وَأَطْيَبُ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3567
    },
    {
      "hadithNumber": 3568,
      "english": {
        "narrated": "It was\nnarrated from Abu Darda’ that the Messenger of Allah (ﷺ)\nsaid:",
        "hadith": "“The best of that in which you visit Allah in your graves and\nyour\nmosque is white (garments).”*",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنَّ أَحْسَنَ مَا زُرْتُمُ اللَّهَ بِهِ فِي قُبُورِكُمْ وَمَسَاجِدِكُمُ الْبَيَاضُ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3568
    },
    {
      "hadithNumber": 3569,
      "english": {
        "narrated": "It was\nnarrated from Ibn ‘Umar that the Messenger of Allah (ﷺ)\nsaid:",
        "hadith": "“Whoever lets his garment drag out of pride, Allah will not look\nat\nhim on the Day of Resurrection.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنَّ الَّذِي يَجُرُّ ثَوْبَهُ مِنَ الْخُيَلاَءِ لاَ يَنْظُرُ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3569
    },
    {
      "hadithNumber": 3570,
      "english": {
        "narrated": "It was\nnarrated from ‘Atiyyah, that Abu Sa’eed said:",
        "hadith": "“The Messenger\nof\nAllah (ﷺ) said: ‘Whoever lets his lower wrap drag out of pride,\nAllah will not look at him on the Day of Resurrection.” He ( ‘Atiyyah) said \"I met Ibn 'Umar in Al-Balaat so I mentioned Abu Sa'eed's hadith from the Prophet (ﷺ). So he said and pointed to his ears 'My two ears heard it, and my heart preserved it.' \"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مَنْ جَرَّ إِزَارَهُ مِنَ الْخُيَلاَءِ لَمْ يَنْظُرِ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3570
    },
    {
      "hadithNumber": 3571,
      "english": {
        "narrated": "It was\nnarrated that a young man of Quriash passed by Abu Hurairah\nwith his\ncloak dragging. He said:",
        "hadith": "“O my nephew! I heard the Messenger\nof\nAllah (ﷺ) saying ‘Whoever let his garment drag out of pride,\nAllah will not look at him on the Day of Resurrection.’”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مَنْ جَرَّ ثَوْبَهُ مِنَ الْخُيَلاَءِ لَمْ يَنْظُرِ اللَّهُ له يَوْمَ الْقِيَامَةِ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3571
    },
    {
      "hadithNumber": 3572,
      "english": {
        "narrated": "It was\nnarrated that Hudhaifah said:",
        "hadith": "“The Messenger of Allah (ﷺ)\ntook\nhold of the lower part of my calf or his calf and said: ‘This is\nwhere the lower wrap should come to. If you insist, then lower, and\nif\nyou insist, then lower, but the lower wrap has no right to (come\nto)\nthe ankle.’”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ هَذَا مَوْضِعُ الإِزَارِ فَإِنْ أَبَيْتَ ‏.‏ فَأَسْفَلَ فَإِنْ أَبَيْتَ فَأَسْفَلَ فَإِنْ أَبَيْتَ فَلاَ حَقَّ لِلإِزَارِ فِي الْكَعْبَيْنِ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3572
    },
    {
      "hadithNumber": 3573,
      "english": {
        "narrated": "It was\nnarrated from ‘Ala bin ‘Abdur-Rahman that his father said:",
        "hadith": "“I\nsaid to Abu Sa’eed: ‘Did you hear anything from the Messenger of\nAllah\n(ﷺ) concerning the lower wrap?’ He said: ‘Yes. I heard\nthe Messenger\nof Allah (ﷺ) say: ‘The lower wrap of the believer\nshould come to\nmid-calf, but there is no sin on him if it comes\nbetween that point\nand the ankle. But whatever is lower than the\nankle is in the Fire.’\nAnd he said three times: ‘Allah will not\nlook at the one who lets his\nlower wrap drag out of vanity.’”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، قَالَ قُلْتُ لأَبِي سَعِيدٍ هَلْ سَمِعْتَ مِنْ، رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ شَيْئًا فِي الإِزَارِ قَالَ نَعَمْ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\"‏ إِزْرَةُ الْمُؤْمِنِ إِلَى أَنْصَافِ سَاقَيْهِ لاَ جُنَاحَ عَلَيْهِ مَا بَيْنَهُ وَبَيْنَ الْكَعْبَيْنِ وَمَا أَسْفَلَ مِنَ الْكَعْبَيْنِ فِي النَّارِ ‏\"‏ ‏.‏ يَقُولُ ثَلاَثًا ‏\"‏ لاَ يَنْظُرُ اللَّهُ إِلَى مَنْ جَرَّ إِزَارَهُ بَطَرًا ‏\"‏ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3573
    },
    {
      "hadithNumber": 3574,
      "english": {
        "narrated": "It was\nnarrated from Mughirah bin Shu’bah that the Messenger of Allah\n(ﷺ) said:",
        "hadith": "“O Sufyan bin Sahl, do not let your garment hang, for\nAllah does not like those who let their garments hang below the\nankles.’”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ يَا سُفْيَانَ بْنَ سَهْلٍ لاَ تُسْبِلْ فَإِنَّ اللَّهَ لاَ يُحِبُّ الْمُسْبِلِينَ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3574
    },
    {
      "hadithNumber": 3575,
      "english": {
        "narrated": "It was\nnarrated that Umm Salamah said:",
        "hadith": "There was no garment more\nbeloved to\nthe Messenger of Allah (ﷺ) than the shirt.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، حَدَّثَنَا أَبُو تُمَيْلَةَ، عَنْ عَبْدِ الْمُؤْمِنِ بْنِ خَالِدٍ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ أُمِّهِ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ لَمْ يَكُنْ ثَوْبٌ أَحَبَّ إِلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ مِنَ الْقَمِيصِ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3575
    },
    {
      "hadithNumber": 3576,
      "english": {
        "narrated": "It was\nnarrated from Salim, from his father, that the Prophet (ﷺ)\nsaid:",
        "hadith": "“Hanging down may apply to the waist wrap, shirt or turban.\nWhoever\nlets any of these drag out of pride, Allah will not look at\nhim on\nthe Day of Resurrection.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ الإِسْبَالُ فِي الإِزَارِ وَالْقَمِيصِ وَالْعِمَامَةِ مَنْ جَرَّ شَيْئًا خُيَلاَءَ لَمْ يَنْظُرِ اللَّهُ إِلَيْهِ يَوْمَ الْقِيَامَةِ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3576
    },
    {
      "hadithNumber": 3577,
      "english": {
        "narrated": "It was\nnarrated that Ibn ‘Abbas said:",
        "hadith": "“The Messenger of Allah (ﷺ)\nused\nto wear a shirt that was short in the sleeves and length.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَحْمَدُ بْنُ عُثْمَانَ بْنِ حَكِيمٍ الأَوْدِيُّ، حَدَّثَنَا أَبُو غَسَّانَ، قَالَ حَدَّثَنَا حَسَنُ بْنُ صَالِحٍ، ح وَحَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ، حَدَّثَنَا أَبِي، عَنِ الْحَسَنِ بْنِ صَالِحٍ، عَنْ مُسْلِمٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يَلْبَسُ قَمِيصًا قَصِيرَ الْيَدَيْنِ وَالطُّولِ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3577
    },
    {
      "hadithNumber": 3578,
      "english": {
        "narrated": "Mu’awiyah bin Qurrah narrated that his father said:",
        "hadith": "“I came to\nthe\nMessenger of Allah (ﷺ) and gave him my pledge, and the buttons\nof\nhis shirt were undone.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا ابْنُ دُكَيْنٍ، عَنْ زُهَيْرٍ، عَنْ عُرْوَةَ بْنِ عَبْدِ اللَّهِ بْنِ قُشَيْرٍ، حَدَّثَنِي مُعَاوِيَةُ بْنُ قُرَّةَ، عَنْ أَبِيهِ، قَالَ أَتَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ فَبَايَعْتُهُ وَإِنَّ زِرَّ قَمِيصِهِ لَمُطْلَقٌ ‏.‏ قَالَ عُرْوَةُ فَمَا رَأَيْتُ مُعَاوِيَةَ وَلاَ ابْنَهُ فِي شِتَاءٍ وَلاَ صَيْفٍ إِلاَّ مُطْلَقَةً أَزْرَارُهُمَا ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3578
    },
    {
      "hadithNumber": 3579,
      "english": {
        "narrated": "It was\nnarrated that Suwaid bin Qais said:",
        "hadith": "“The Prophet (ﷺ) came to\nus\nand haggled with us over the price of trousers.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى، وَعَبْدُ الرَّحْمَنِ، قَالُوا حَدَّثَنَا سُفْيَانُ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ سُوَيْدِ بْنِ قَيْسٍ، قَالَ أَتَانَا النَّبِيُّ ـ صلى الله عليه وسلم ـ فَسَاوَمَنَا سَرَاوِيلَ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3579
    },
    {
      "hadithNumber": 3580,
      "english": {
        "narrated": "It was\nnarrated that Umm Salamah said:",
        "hadith": "“The Messenger of Allah (ﷺ)\nwas\nasked about how long a woman’s hem should hang down. He said: ‘A\nhand span.’ I said: ‘But then (her legs and feet) will be\nuncovered.’\nHe said: ‘Then a forearm’s length, but no more than\nthat.’”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ سُئِلَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ كَمْ تَجُرُّ الْمَرْأَةُ مِنْ ذَيْلِهَا قَالَ ‏\"‏ شِبْرًا ‏\"‏ ‏.‏ قُلْتُ إِذًا يَنْكَشِفَ عَنْهَا ‏.‏ قَالَ ذِرَاعٌ لاَ تَزِيدُ عَلَيْهِ ‏\"‏ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3580
    },
    {
      "hadithNumber": 3581,
      "english": {
        "narrated": "It was\nnarrated from Ibn ‘Umar:",
        "hadith": "“The wives of the Prophet (ﷺ) were\nallowed to let their hems hang down, so they used to come to us and\nwe\nwould measure one forearms length for them with a reed.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ سُفْيَانَ، عَنْ زَيْدٍ الْعَمِّيِّ، عَنْ أَبِي الصِّدِّيقِ النَّاجِيِّ، عَنِ ابْنِ عُمَرَ، أَنَّ أَزْوَاجَ النَّبِيِّ، ـ صلى الله عليه وسلم ـ رُخِّصَ لَهُنَّ فِي الذَّيْلِ ذِرَاعًا فَكُنَّ يَأْتِيَنَّا فَنَذْرَعُ لَهُنَّ بِالْقَصَبِ ذِرَاعًا ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3581
    },
    {
      "hadithNumber": 3582,
      "english": {
        "narrated": "It was\nnarrated from Abu Hurairah that the Prophet (ﷺ) said to\nFatimah, or\nto Umm Salamah:",
        "hadith": "“Let your hem down one forearm’s length.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ ذَيْلُكِ ذِرَاعٌ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3582
    },
    {
      "hadithNumber": 3583,
      "english": {
        "narrated": "It was\nnarrated from ‘Aishah that the Prophet (ﷺ) said, concerning\nhow\nlong a woman’s hem should hang down:",
        "hadith": "“A hand span.” ‘Aishah\nsaid:\n“This may show her calves.” He said: “Then a forearm’s\nlength.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا حَبِيبٌ الْمُعَلِّمُ، عَنْ أَبِي الْمُهَزِّمِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ فِي ذُيُولِ النِّسَاءِ ‏\"‏ شِبْرًا ‏\"‏ ‏.‏ فَقَالَتْ عَائِشَةُ إِذًا تَخْرُجَ سُوقُهُنَّ ‏.‏ قَالَ ‏\"‏ فَذِرَاعٌ ‏\"‏ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3583
    },
    {
      "hadithNumber": 3584,
      "english": {
        "narrated": "It was\nnarrated from Ja’far bin ‘Amr bin Huraith that his father\nsaid:",
        "hadith": "“I saw the Prophet (ﷺ) delivering a sermon on the pulpit,\nwearing\na black turban.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ مُسَاوِرٍ الْوَرَّاقِ، عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ حُرَيْثٍ، عَنْ أَبِيهِ، قَالَ رَأَيْتُ النَّبِيَّ ـ صلى الله عليه وسلم ـ يَخْطُبُ عَلَى الْمِنْبَرِ وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3584
    },
    {
      "hadithNumber": 3585,
      "english": {
        "narrated": "",
        "hadith": "It was\nnarrated from Jabir that the Prophet (ﷺ) entered Makkah\nwearing a\nblack turban.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ دَخَلَ مَكَّةَ وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3585
    },
    {
      "hadithNumber": 3586,
      "english": {
        "narrated": "",
        "hadith": "It was\nnarrated from Ibn ‘Umar that the Prophet (ﷺ) entered\n(Makkah), on\nthe Day of the Conquest of Makkah, wearing a black\nturban.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ، أَنْبَأَنَا مُوسَى بْنُ عُبَيْدَةَ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ دَخَلَ يَوْمَ فَتْحِ مَكَّةَ وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3586
    },
    {
      "hadithNumber": 3587,
      "english": {
        "narrated": "Ja’far\nbin ‘Amr bin Huraith narrated that his father said:",
        "hadith": "“It is as\nif\nI can see the Messenger of Allah (ﷺ), wearing a black turban,\nwith\nthe ends hanging down his shoulders.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ مُسَاوِرٍ، حَدَّثَنِي جَعْفَرُ بْنُ عَمْرِو بْنِ حُرَيْثٍ، عَنْ أَبِيهِ، قَالَ كَأَنِّي أَنْظُرُ إِلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ قَدْ أَرْخَى طَرَفَيْهَا بَيْنَ كَتِفَيْهِ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3587
    },
    {
      "hadithNumber": 3588,
      "english": {
        "narrated": "It was\nnarrated from Anas bin Malik that the Messenger of Allah (ﷺ)\nsaid:",
        "hadith": "“Whoever wears silk in this world will not wear it in the\nHereafter.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مَنْ لَبِسَ الْحَرِيرَ فِي الدُّنْيَا لَمْ يَلْبَسْهُ فِي الآخِرَةِ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3588
    },
    {
      "hadithNumber": 3589,
      "english": {
        "narrated": "It was\nnarrated that Bara’ bin ‘Azib said:",
        "hadith": "“The Messenger of Allah\n(ﷺ) forbade brocade, silk, and embroidered brocade.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنِ الشَّيْبَانِيِّ، عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ، عَنْ مُعَاوِيَةَ بْنِ سُوَيْدٍ، عَنِ الْبَرَاءِ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنِ الدِّيبَاجِ وَالْحَرِيرِ وَالإِسْتَبْرَقِ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3589
    },
    {
      "hadithNumber": 3590,
      "english": {
        "narrated": "It was\nnarrated that Hudhaifah said:",
        "hadith": "“The Messenger of Allah (ﷺ)\nforbade\nwearing silk and gold. He said: ‘They are for them in this\nworld\nand for us in the Hereafter.’”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ هُوَ لَهُمْ فِي الدُّنْيَا وَلَنَا فِي الآخِرَةِ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3590
    },
    {
      "hadithNumber": 3591,
      "english": {
        "narrated": "It was\nnarrated from ‘Abdullah bin ‘Umar that ‘Umar bin Khattab saw a\nsilken two piece suit (being offered for sale). He said:",
        "hadith": "“O\nMessenger\nof Allah, why don’t you buy this two piece suit (to wear\nfor meeting)\nthe delegations, and on Fridays?” The Messenger of\nAllah (ﷺ) said:\n“This is only worn by one who has no share in the\nHereafter.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنَّمَا يَلْبَسُ هَذَا مَنْ لاَ خَلاَقَ لَهُ فِي الآخِرَةِ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3591
    },
    {
      "hadithNumber": 3592,
      "english": {
        "narrated": "",
        "hadith": "It was\nnarrated from Anas bin Malik that the Messenger of Allah (ﷺ)\ngranted a concession to Zubair bin ‘Awwam and ‘Abdur-Rahman bin\n‘Auf,\nallowing them to wear silk shirts, because of a rash they\nwere\nsuffering from.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، ‏.‏ أَنَّ أَنَسَ بْنَ مَالِكٍ، نَبَّأَهُمْ أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ رَخَّصَ لِلزُّبَيْرِ بْنِ الْعَوَّامِ وَلِعَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ فِي قَمِيصَيْنِ مِنْ حَرِيرٍ مِنْ وَجَعٍ كَانَ بِهِمَا حِكَّةٍ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3592
    },
    {
      "hadithNumber": 3593,
      "english": {
        "narrated": "It was\nnarrated from ‘Umar that he used to forbid silk and brocade,\nexcept\nfor what was like this:",
        "hadith": "Then he gestured with his finger, then\na\nsecond, and a third, and a fourth (i.e., the width of four fingers),\nand he said: “The Messenger of Allah (ﷺ) used to forbid it.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنْ عَاصِمٍ، عَنْ أَبِي عُثْمَانَ، عَنْ عُمَرَ، أَنَّهُ كَانَ يَنْهَى عَنِ الْحَرِيرِ، وَالدِّيبَاجِ، إِلاَّ مَا كَانَ هَكَذَا ثُمَّ أَشَارَ بِإِصْبَعِهِ ثُمَّ الثَّانِيَةِ ثُمَّ الثَّالِثَةِ ثُمَّ الرَّابِعَةِ فَقَالَ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يَنْهَانَا عَنْهُ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3593
    },
    {
      "hadithNumber": 3594,
      "english": {
        "narrated": "It was\nnarrated that Abu ‘Umar, the freed slave of Asma’, said:",
        "hadith": "“I\nsaw\nIbn ‘Umar buying a turban that had some markings, then he called\nfor a pair of scissors and cut that off. I entered upon Asma’ and\nmentioned that to her, and she said: ‘May ‘Abdullah perish, O\ngirl!\nGive me the garment of the Messenger of Allah (ﷺ).’ A\ngarment was\nbrought that was hemmed with brocade on the sleeves,\nnecklines and\nopenings (at the front and back).”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ مُغِيرَةَ بْنِ زِيَادٍ، عَنْ أَبِي عُمَرَ، مَوْلَى أَسْمَاءَ قَالَ رَأَيْتُ ابْنَ عُمَرَ اشْتَرَى عِمَامَةً لَهَا عَلَمٌ فَدَعَا بِالْجَلَمَيْنِ فَقَصَّهُ فَدَخَلْتُ عَلَى أَسْمَاءَ فَذَكَرْتُ ذَلِكَ لَهَا فَقَالَتْ بُؤْسًا لِعَبْدِ اللَّهِ يَا جَارِيَةُ هَاتِي جُبَّةَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏ فَجَاءَتْ بِجُبَّةٍ مَكْفُوفَةِ الْكُمَّيْنِ وَالْجَيْبِ وَالْفَرْجَيْنِ بِالدِّيبَاجِ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3594
    },
    {
      "hadithNumber": 3595,
      "english": {
        "narrated": "‘Ali\nbin Abu Talib said:",
        "hadith": "“The Messenger of Allah (ﷺ) took hold of\nsome\nsilk in his left hand and some gold in his right, then he raised\nhis\nhands and said: ‘These two are forbidden for the males of my\nnation, and permitted to the females.’”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنَّ هَذَيْنِ حَرَامٌ عَلَى ذُكُورِ أُمَّتِي حِلٌّ لإِنَاثِهِمْ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3595
    },
    {
      "hadithNumber": 3596,
      "english": {
        "narrated": "It was\nnarrated from ‘Ali that a two-piece suit hemmed with silk,\neither\non the wrap or the weft,* was given to the Messenger of Allah\n(ﷺ),\nand he sent them to me (‘Ali). I came to him and said:",
        "hadith": "“O\nMessenger of Allah, what should I do with these? Shall I wear them?”\nHe said: “No, rather make them into head-cloths and give them to\nthe\nFatimahs.”**",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لاَ وَلَكِنِ اجْعَلْهَا خُمُرًا بَيْنَ الْفَوَاطِمِ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3596
    },
    {
      "hadithNumber": 3597,
      "english": {
        "narrated": "It was\nnarrated that ‘Abdullah bin ‘Umar said:",
        "hadith": "“The Messenger of\nAllah\n(ﷺ) came out to us, and in one of his hands was a garment of\nsilk\nand in the other was some gold. He said: ‘These are forbidden to\nthe males of my nation and permitted to the females.’”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنَّ هَذَيْنِ مُحَرَّمٌ عَلَى ذُكُورِ أُمَّتِي حِلٌّ لإِنَاثِهِمْ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3597
    },
    {
      "hadithNumber": 3598,
      "english": {
        "narrated": "It was\nnarrated that Anas said:",
        "hadith": "“I saw Zainab the daughter of the\nMessenger of Allah (ﷺ) wearing a shirt of Siyara’ silk.*",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ أَنَسٍ، قَالَ رَأَيْتُ عَلَى زَيْنَبَ بِنْتِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ قَمِيصَ حَرِيرٍ سِيَرَاءَ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3598
    },
    {
      "hadithNumber": 3599,
      "english": {
        "narrated": "It was\nnarrated that Bara’ said:",
        "hadith": "“I never saw anyone more handsome\nthen\nthe Messenger of Allah (ﷺ), with his hair combed, wearing a red\ntwo-piece suit.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ الْقَاضِي، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ، قَالَ مَا رَأَيْتُ أَجْمَلَ مِنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ مُتَرَجِّلاً فِي حُلَّةٍ حَمْرَاءَ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3599
    },
    {
      "hadithNumber": 3600,
      "english": {
        "narrated": "‘Abdullah bin Buraidah narrated that his father told him:",
        "hadith": "I saw the\nMessenger of Allah (ﷺ) delivering a sermon, and Hasan and Husain\ncame forward, wearing red shirts, stumbling and getting up again. The\nProphet (ﷺ) stepped down, picked them up and put them in his lap.\nThen he said: “Allah and His Messenger have spoken the truth. ‘Your\nwealth and your children are only a trial.’ [64:15] I saw these two\nand I could not be patient. Then he resumed his sermon.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو عَامِرٍ عَبْدُ اللَّهِ بْنُ عَامِرِ بْنِ بَرَّادِ بْنِ يُوسُفَ بْنِ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى الأَشْعَرِيِّ، حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، حَدَّثَنَا حُسَيْنُ بْنُ وَاقِدٍ، قَاضِي مَرْوَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ، أَنَّ أَبَاهُ، حَدَّثَهُ قَالَ رَأَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَخْطُبُ فَأَقْبَلَ حَسَنٌ وَحُسَيْنٌ عَلَيْهِمَا قَمِيصَانِ أَحْمَرَانِ يَعْثُرَانِ وَيَقُومَانِ فَنَزَلَ النَّبِيُّ ـ صلى الله عليه وسلم ـ فَأَخَذَهُمَا فَوَضَعَهُمَا فِي حِجْرِهِ فَقَالَ ‏\"‏ صَدَقَ اللَّهُ وَرَسُولُهُ ‏{إِنَّمَا أَمْوَالُكُمْ وَأَوْلاَدُكُمْ فِتْنَةٌ}‏ رَأَيْتُ هَذَيْنِ فَلَمْ أَصْبِرْ ‏\"‏ ‏.‏ ثُمَّ أَخَذَ فِي خُطْبَتِهِ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3600
    },
    {
      "hadithNumber": 3601,
      "english": {
        "narrated": "It was\nnarrated that Ibn ‘Umar said:",
        "hadith": "“The Messenger of Allah (ﷺ)\nforbade Al-Mufaddam.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنِ الْحَسَنِ بْنِ سُهَيْلٍ، عَنِ ابْنِ عُمَرَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنِ الْمُفَدَّمِ ‏.‏ قَالَ يَزِيدُ قُلْتُ لِلْحَسَنِ مَا الْمُفَدَّمُ قَالَ الْمُشْبَعُ بِالْعُصْفُرِ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3601
    },
    {
      "hadithNumber": 3602,
      "english": {
        "narrated": "It was\nnarrated that ‘Abdullah bin Hunain said:",
        "hadith": "“I heard ‘Ali say:\n‘The Messenger of Allah (ﷺ) forbade me – and I do not say that\nhe\nforbade you – from wearing clothes dyed with safflower.’”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، عَنْ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ، قَالَ سَمِعْتُ عَلِيًّا، يَقُولُ نَهَانِي رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ - وَلاَ أَقُولُ نَهَاكُمْ - عَنْ لُبْسِ الْمُعَصْفَرِ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3602
    },
    {
      "hadithNumber": 3603,
      "english": {
        "narrated": "It was\nnarrated from ‘Amr bin Shu’aib, from his father, that his\ngrandfather said:",
        "hadith": "“We came with the Messenger of Allah (ﷺ) was\nThaniyyat Adhakhir. He turned to me, and I was wearing a thin cloak\ndyed with safflower, and said: ‘What is this?’ And I realized\nthat he\ndisliked it. I came to my family when they were heating their\noven and\nthrew it (in the oven). Then I came to him the following day\nand he\nsaid: ‘O ‘Abdullah, what happened to the thin cloak?’ I\ntold him (what\nI had done) and he said: ‘Why did you not give it to\nsome of your\nfamily to wear, for there is nothing wrong with it for\nwomen.’”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنِ هِشَامِ بْنِ الْغَازِ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ أَقْبَلْنَا مَعَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ مِنْ ثَنِيَّةِ أَذَاخِرَ فَالْتَفَتَ إِلَىَّ وَعَلَىَّ رَيْطَةٌ مُضَرَّجَةٌ بِالْعُصْفُرِ فَقَالَ ‏\"‏ مَا هَذِهِ ‏\"‏ ‏.‏ فَعَرَفْتُ مَا كَرِهَ فَأَتَيْتُ أَهْلِي وَهُمْ يَسْجُرُونَ تَنُّورَهُمْ فَقَذَفْتُهَا فِيهِ ثُمَّ أَتَيْتُهُ مِنَ الْغَدِ فَقَالَ ‏\"‏ يَا عَبْدَ اللَّهِ مَا فَعَلَتِ الرَّيْطَةُ ‏\"‏ ‏.‏ فَأَخْبَرْتُهُ فَقَالَ ‏\"‏ أَلاَ كَسَوْتَهَا بَعْضَ أَهْلِكَ فَإِنَّهُ لاَ بَأْسَ بِذَلِكَ لِلنِّسَاءِ ‏\"‏ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3603
    },
    {
      "hadithNumber": 3604,
      "english": {
        "narrated": "It was\nnarrated that Qais bin Sa’d said:",
        "hadith": "“The Prophet (ﷺ) came to\nus\nand we gave him some water with which to cool down. He bathed, then\nI\nbrought him a yellow blanket, and I saw the traces of Wars (the\nyellow dye) on the folds of his stomach.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنِ ابْنِ أَبِي لَيْلَى، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ مُحَمَّدِ بْنِ شُرَحْبِيلَ، عَنْ قَيْسِ بْنِ سَعْدٍ، قَالَ أَتَانَا النَّبِيُّ ـ صلى الله عليه وسلم ـ فَوَضَعْنَا لَهُ مَاءً يَتَبَرَّدُ بِهِ فَاغْتَسَلَ ثُمَّ أَتَيْتُهُ بِمِلْحَفَةٍ صَفْرَاءَ فَرَأَيْتُ أَثَرَ الْوَرْسِ عَلَى عُكَنِهِ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3604
    },
    {
      "hadithNumber": 3605,
      "english": {
        "narrated": "It was\nnarrated from ‘Amr bin Shu’aib, from his father, that his\ngrandfather said:",
        "hadith": "“The Messenger of Allah (ﷺ) said: ‘Eat and\ndrink,\ngive charity and wear clothes, as long as that does not\ninvolve any\nextravagance or vanity.’”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ كُلُوا وَاشْرَبُوا وَتَصَدَّقُوا وَالْبَسُوا مَا لَمْ يُخَالِطْهُ إِسْرَافٌ أَوْ مَخِيلَةٌ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3605
    },
    {
      "hadithNumber": 3606,
      "english": {
        "narrated": "It was\nnarrated that Ibn ‘Umar said:",
        "hadith": "“The Messenger of Allah (ﷺ)\nsaid:\n‘Whoever wears a garment of pride and vanity, Allah will clothe\nhim, on the Day of Resurrection, in a garment of humiliation.’”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مَنْ لَبِسَ ثَوْبَ شُهْرَةٍ أَلْبَسَهُ اللَّهُ يَوْمَ الْقِيَامَةِ ثَوْبَ مَذَلَّةٍ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3606
    },
    {
      "hadithNumber": 3607,
      "english": {
        "narrated": "It was\nnarrated that ‘Abdullah bin ‘Umar said:",
        "hadith": "“The Messenger of\nAllah\n(ﷺ) said: ‘Whoever wears a garment of pride and vanity in this\nworld, Allah will clothe him in a garment of humiliation on the Day\nof\nResurrection, then set it ablaze.’”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مَنْ لَبِسَ ثَوْبَ شُهْرَةٍ فِي الدُّنْيَا أَلْبَسَهُ اللَّهُ ثَوْبَ مَذَلَّةٍ يَوْمَ الْقِيَامَةِ ثُمَّ أَلْهَبَ فِيهِ نَارًا ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3607
    },
    {
      "hadithNumber": 3608,
      "english": {
        "narrated": "It was\nnarrated from Abu Dharr that the Prophet (ﷺ) said:",
        "hadith": "“Whoever\nwears\na garment of pride and vanity, Allah will turn away from him\nuntil he\ntakes it off.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مَنْ لَبِسَ ثَوْبَ شُهْرَةٍ أَعْرَضَ اللَّهُ عَنْهُ حَتَّى يَضَعَهُ مَتَى وَضَعَهُ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3608
    },
    {
      "hadithNumber": 3609,
      "english": {
        "narrated": "It was\nnarrated that Ibn ‘Abbas said:",
        "hadith": "“I heard the Messenger of Allah\n(ﷺ) say: ‘Any skin that has been tanned has been purified.’”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ أَيُّمَا إِهَابٍ دُبِغَ فَقَدْ طَهُرَ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3609
    },
    {
      "hadithNumber": 3610,
      "english": {
        "narrated": "It was\nnarrated from Maimunah that he (meaning the Prophet (ﷺ))\npassed by\na dead sheep belonging to the freed slave woman of Maimunah,\nthat had\nbeen given to her in charity. He said:",
        "hadith": "“Why don’t they take\nits\nskin and ten it, and make us of it?” They said: “O Messenger of\nAllah, it is dead meat.”* He said: “It is only unlawful to eat\nit.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، عَنْ مَيْمُونَةَ، أَنَّ شَاةً، لِمَوْلاَةِ مَيْمُونَةَ مَرَّ بِهَا - يَعْنِي النَّبِيَّ ـ صلى الله عليه وسلم ـ - قَدْ أُعْطِيَتْهَا مِنَ الصَّدَقَةِ مَيْتَةً فَقَالَ ‏\"‏ هَلاَّ أَخَذُوا إِهَابَهَا فَدَبَغُوهُ فَانْتَفَعُوا بِهِ ‏\"‏ ‏.‏ فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّهَا مَيْتَةٌ ‏.‏ قَالَ ‏\"‏ إِنَّمَا حَرُمَ أَكْلُهَا ‏\"‏ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3610
    },
    {
      "hadithNumber": 3611,
      "english": {
        "narrated": "It was\nnarrated that Salman said:",
        "hadith": "“One of the Mothers of the\nBelievers had\na sheep that died. The Messenger of Allah (ﷺ) passed\nby it and\nsaid: ‘It would not have harmed its owners if they had made\nuse of\nits hide.’”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مَا ضَرَّ أَهْلَ هَذِهِ لَوِ انْتَفَعُوا بِإِهَابِهَا ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3611
    },
    {
      "hadithNumber": 3612,
      "english": {
        "narrated": "It was\nnarrated that ‘Aishah said:",
        "hadith": "“The Messenger of Allah (ﷺ)\ncommanded that use should be made of the skins of dead animals, if\nthey were tanned.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ يَزِيدَ بْنِ قُسَيْطٍ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أُمِّهِ، عَنْ عَائِشَةَ، قَالَتْ أَمَرَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ يُسْتَمْتَعَ بِجُلُودِ الْمَيْتَةِ إِذَا دُبِغَتْ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3612
    },
    {
      "hadithNumber": 3613,
      "english": {
        "narrated": "It was\nnarrated that ‘Abdullah bin ‘Ukaym said:",
        "hadith": "“There came to us a\nletter from the Prophet (ﷺ) (saying): ‘No not make use of the\nuntanned skin and sinew of dead animals.’”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ أَنْ لاَ تَنْتَفِعُوا مِنَ الْمَيْتَةِ بِإِهَابٍ وَلاَ عَصَبٍ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3613
    },
    {
      "hadithNumber": 3614,
      "english": {
        "narrated": "It was\nnarrated that ‘Abdullah bin ‘Abbas said:",
        "hadith": "“The sandals of the\nProphet (ﷺ) had two thongs doubled around their straps.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ، عَنْ عَبْدِ اللَّهِ بْنِ الْعَبَّاسِ، قَالَ كَانَ لِنَعْلِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قِبَالاَنِ مَثْنِيٌّ شِرَاكُهُمَا ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3614
    },
    {
      "hadithNumber": 3615,
      "english": {
        "narrated": "It was\nnarrated that Anas said:",
        "hadith": "“The sandals of the Prophet (ﷺ) had\ntwo\nthongs.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ هَمَّامٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ كَانَ لِنَعْلِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قِبَالاَنِ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3615
    },
    {
      "hadithNumber": 3616,
      "english": {
        "narrated": "It was\nnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)\nsaid:",
        "hadith": "“When anyone of you puts on his sandals, let him start with the\nright, and when he takes them off, let him start with the left.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِذَا انْتَعَلَ أَحَدُكُمْ فَلْيَبْدَأْ بِالْيُمْنَى وَإِذَا خَلَعَ فَلْيَبْدَأْ بِالْيُسْرَى ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3616
    },
    {
      "hadithNumber": 3617,
      "english": {
        "narrated": "",
        "hadith": "It was\nnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)\nsaid;\n“None of you should walk in one sandal or in one leather sock.\nLet\nhim take them both off or walk in both of them.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لاَ يَمْشِي أَحَدُكُمْ فِي نَعْلٍ وَاحِدٍ وَلاَ خُفٍّ وَاحِدٍ لِيَخْلَعْهُمَا جَمِيعًا أَوْ لِيَمْشِ فِيهِمَا جَمِيعًا ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3617
    },
    {
      "hadithNumber": 3618,
      "english": {
        "narrated": "It was\nnarrated that Abu Hurairah said:",
        "hadith": "“The Messenger of Allah (ﷺ)\nforbade putting on sandals whilst standing.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ يَنْتَعِلَ الرَّجُلُ قَائِمًا ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3618
    },
    {
      "hadithNumber": 3619,
      "english": {
        "narrated": "It was\nnarrated that Ibn ‘Umar said:",
        "hadith": "“The Prophet (ﷺ) forbade\nputting\non sandals whilst standing.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، قَالَ نَهَى النَّبِيُّ ـ صلى الله عليه وسلم ـ أَنْ يَنْتَعِلَ الرَّجُلُ قَائِمًا ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3619
    },
    {
      "hadithNumber": 3620,
      "english": {
        "narrated": "",
        "hadith": "It was\nnarrated from Ibn Buraidah, from his father, that an-Najashi\nsent a\npair of pure black Khuff as a gift to the Prophet (ﷺ) of,\nwhich he\nwore.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا دَلْهَمُ بْنُ صَالِحٍ الْكِنْدِيُّ، عَنْ حُجَيْرِ بْنِ عَبْدِ اللَّهِ الْكِنْدِيِّ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، أَنَّ النَّجَاشِيَّ، أَهْدَى لِرَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ خُفَّيْنِ سَاذَجَيْنِ أَسْوَدَيْنِ فَلَبِسَهُمَا ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3620
    },
    {
      "hadithNumber": 3621,
      "english": {
        "narrated": "It was\nnarrated that Abu Hurairah attributed to the Prophet (ﷺ):",
        "hadith": "“The\nJews and the Christians do not dye (their hair), so differ from\nthem.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنَّ الْيَهُودَ وَالنَّصَارَى لاَ يَصْبُغُونَ فَخَالِفُوهُمْ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3621
    },
    {
      "hadithNumber": 3622,
      "english": {
        "narrated": "It was\nnarrated from Abu Dharr that the Messenger of Allah (ﷺ)\nsaid:",
        "hadith": "“The\nbest things with which you change gray hair are henna and\nKatam.”*",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنَّ أَحْسَنَ مَا غَيَّرْتُمْ بِهِ الشَّيْبَ الْحِنَّاءُ وَالْكَتَمُ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3622
    },
    {
      "hadithNumber": 3623,
      "english": {
        "narrated": "It was\nnarrated that ‘Uthman bin Mawhab said:",
        "hadith": "“I entered upon Umm\nSalamah and she brought out for me a hair of the Messenger of Allah\n(ﷺ), which was dyed with henna and Katam.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، حَدَّثَنَا سَلاَّمُ بْنُ أَبِي مُطِيعٍ، عَنْ عُثْمَانَ بْنِ مَوْهَبٍ، قَالَ دَخَلْتُ عَلَى أُمِّ سَلَمَةَ ‏.‏ قَالَ فَأَخْرَجَتْ إِلَىَّ شَعَرًا مِنْ شَعَرِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ مَخْضُوبًا بِالْحِنَّاءِ وَالْكَتَمِ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3623
    },
    {
      "hadithNumber": 3624,
      "english": {
        "narrated": "It was\nnarrated from Jabir that he said:",
        "hadith": "“Abu Quhaifah was brought to\nthe\nProphet (ﷺ) on the Day of the Conquest (of Makkah), and his head\nwas all white. The Messenger of Allah (ﷺ) said: ‘Take him to some\nof\nhis womenfolk and let them change this, but avoid black.’”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ اذْهَبُوا بِهِ إِلَى بَعْضِ نِسَائِهِ فَلْتُغَيِّرْهُ وَجَنِّبُوهُ السَّوَادَ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3624
    },
    {
      "hadithNumber": 3625,
      "english": {
        "narrated": "It was\nnarrated that Suhaib Al-Khair said:",
        "hadith": "“The Messenger of Allah\n(ﷺ)\nsaid: ‘The best thing with which you can dye your hair is this\nblack (dye). It makes your women desire you and creates fear in the\nhearts of your enemies.’”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنَّ أَحْسَنَ مَا اخْتَضَبْتُمْ بِهِ لَهَذَا السَّوَادُ أَرْغَبُ لِنِسَائِكُمْ فِيكُمْ وَأَهْيَبُ لَكُمْ فِي صُدُورِ عَدُوِّكُمْ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3625
    },
    {
      "hadithNumber": 3626,
      "english": {
        "narrated": "It was\nnarrated from Sa’eed bin Abu Sa’eed that ‘Ubaid bin Juraij\nasked Ibn ‘Umar:",
        "hadith": "“I see that you dye your beard yellow with\nWars.” Ibn\n‘Umar said: “As for my dyeing of my beard yellow\nwith Wars, I saw the\nMessenger of Allah (ﷺ) dyeing his beard\nyellow.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، أَنَّ عُبَيْدَ بْنَ جُرَيْجٍ، سَأَلَ ابْنَ عُمَرَ قَالَ رَأَيْتُكَ تُصَفِّرُ لِحْيَتَكَ بِالْوَرْسِ فَقَالَ ابْنُ عُمَرَ أَمَّا تَصْفِيرِي لِحْيَتِي فَإِنِّي رَأَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يُصَفِّرُ لِحْيَتَهُ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3626
    },
    {
      "hadithNumber": 3627,
      "english": {
        "narrated": "It was\nnarrated that Ibn ‘Abbas said:",
        "hadith": "“The Prophet (ﷺ) passed by a\nman\nwho had dyed his hair with henna and said: ‘How handsome this is!’\nThen he passed by another who had dyed his hair with henna and Katam,\nand said: ‘This one is more handsome than that one.’ Then he\npassed by\nanother who had dyed his hair yellow and said: ‘This one\nis more\nhandsome than all of them.’”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا مُحَمَّدُ بْنُ طَلْحَةَ، عَنْ حُمَيْدِ بْنِ وَهْبٍ، عَنِ ابْنِ طَاوُسٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ مَرَّ النَّبِيُّ ـ صلى الله عليه وسلم ـ عَلَى رَجُلٍ قَدْ خَضَبَ بِالْحِنَّاءِ فَقَالَ ‏\"‏ مَا أَحْسَنَ هَذَا ‏\"‏ ‏.‏ ثُمَّ مَرَّ بِآخَرَ قَدْ خَضَبَ بِالْحِنَّاءِ وَالْكَتَمِ فَقَالَ ‏\"‏ هَذَا أَحْسَنُ مِنْ هَذَا ‏\"‏ ‏.‏ ثُمَّ مَرَّ بِآخَرَ قَدْ خَضَبَ بِالصُّفْرَةِ فَقَالَ ‏\"‏ هَذَا أَحْسَنُ مِنْ هَذَا كُلِّهِ ‏\"‏ ‏.‏ قَالَ وَكَانَ طَاوُسٌ يُصَفِّرُ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3627
    },
    {
      "hadithNumber": 3628,
      "english": {
        "narrated": "It was\nnarrated that Abu Juhaifah said:",
        "hadith": "“I saw the Messenger of Allah\n(ﷺ), and this part of his hair was white” – meaning the tuft of\nhair\nbetween the lower lip and the chin.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا زُهَيْرٌ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي جُحَيْفَةَ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ هَذِهِ مِنْهُ بَيْضَاءُ ‏.‏ يَعْنِي عَنْفَقَتَهُ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3628
    },
    {
      "hadithNumber": 3629,
      "english": {
        "narrated": "It was\nnarrated that Humaid said:",
        "hadith": "“Anas bin Malik was asked: ‘Did the\nMessenger of Allah (ﷺ) dye his hair?’ He said: ‘He did not have\nany\nwhite hair apart from approximately seventeen or twenty hairs at\nthe\nfront of his beard.’”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، وَابْنُ أَبِي عَدِيٍّ، عَنْ حُمَيْدٍ، قَالَ سُئِلَ أَنَسُ بْنُ مَالِكٍ أَخَضَبَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ إِنَّهُ لَمْ يَرَ مِنَ الشَّيْبِ إِلاَّ نَحْوَ سَبْعَةَ عَشَرَ أَوْ عِشْرِينَ شَعَرَةً فِي مُقَدَّمِ لِحْيَتِهِ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3629
    },
    {
      "hadithNumber": 3630,
      "english": {
        "narrated": "It was\nnarrated that Ibn ‘Umar said:",
        "hadith": "“The white hair of the Prophet\n(ﷺ) numbered approximately twenty.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا مُحَمَّدُ بْنُ عُمَرَ بْنِ الْوَلِيدِ الْكِنْدِيُّ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ شَرِيكٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ كَانَ شَيْبُ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ نَحْوَ عِشْرِينَ شَعَرَةً ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3630
    },
    {
      "hadithNumber": 3631,
      "english": {
        "narrated": "It was\nnarrated that Mujahid said:",
        "hadith": "“Umm Hani said: ‘When the\nMessenger\nof Allah (ﷺ) entered Makkah he had four braids.’”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ ابْنِ أَبِي نَجِيحٍ، عَنْ مُجَاهِدٍ، قَالَ قَالَتْ أُمُّ هَانِئٍ دَخَلَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ مَكَّةَ وَلَهُ أَرْبَعُ غَدَائِرَ ‏.‏ تَعْنِي ضَفَائِرَ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3631
    },
    {
      "hadithNumber": 3632,
      "english": {
        "narrated": "It was\nnarrated that Ibn ‘Abbas said:",
        "hadith": "“The People of the Book used to\nlet their hair hang down, and the idolaters used to part their hair.\nThe Messenger of Allah (ﷺ) liked to be more like the People of the\nBook. So the Messenger of Allah (ﷺ) let his forelock hang down,\nthen\nafter that he parted it.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ إِبْرَاهِيمَ بْنِ سَعْدٍ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ أَهْلُ الْكِتَابِ يَسْدُلُونَ أَشْعَارَهُمْ وَكَانَ الْمُشْرِكُونَ يَفْرِقُونَ وَكَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يُحِبُّ مُوَافَقَةَ أَهْلِ الْكِتَابِ ‏.‏ قَالَ فَسَدَلَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ نَاصِيَتَهُ ثُمَّ فَرَقَ بَعْدُ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3632
    },
    {
      "hadithNumber": 3633,
      "english": {
        "narrated": "It was\nnarrated that ‘Aishah said:",
        "hadith": "“I used to part the hair of the\nMessenger of Allah (ﷺ) behind his crown, and let his forelock hang\ndown.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ بْنِ سَعْدٍ، عَنِ ابْنِ إِسْحَاقَ، عَنْ يَحْيَى بْنِ عَبَّادٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كُنْتُ أَفْرِقُ خَلْفَ يَافُوخِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ ثُمَّ أَسْدِلُ نَاصِيَتَهُ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3633
    },
    {
      "hadithNumber": 3634,
      "english": {
        "narrated": "It was\nnarrated that Anas said:",
        "hadith": "“The hair of the Messenger of Allah\n(ﷺ)\nwas wavy, and (hung down) between his ears and his shoulders.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَنْبَأَنَا جَرِيرُ بْنُ حَازِمٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ كَانَ شَعَرُ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ شَعَرًا رَجِلاً بَيْنَ أُذُنَيْهِ وَمَنْكِبَيْهِ.",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3634
    },
    {
      "hadithNumber": 3635,
      "english": {
        "narrated": "It was\nnarrated that ‘Aishah said:",
        "hadith": "“The Messenger of Allah (ﷺ) had\nhair that came between his earlobes and his shoulders.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي الزِّنَادِ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ لِرَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ شَعَرٌ دُونَ الْجُمَّةِ وَفَوْقَ الْوَفْرَةِ.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3635
    },
    {
      "hadithNumber": 3636,
      "english": {
        "narrated": "It was\nnarrated that Wa’il bin Hujr said:",
        "hadith": "“The Prophet (ﷺ) saw me\nwhen\nI had long hair. He said: ‘Bad news, bad news!’ So I went away\nand cut it short. Then the Prophet (ﷺ) saw me and said: ‘I did\nnot\nmean you, but this is better.’”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ، وَسُفْيَانُ بْنُ عُقْبَةَ، عَنْ سُفْيَانَ، عَنْ عَاصِمِ بْنِ كُلَيْبٍ، عَنْ أَبِيهِ، عَنْ وَائِلِ بْنِ حُجْرٍ، قَالَ رَآنِيَ النَّبِيُّ ـ صلى الله عليه وسلم ـ وَلِي شَعَرٌ طَوِيلٌ فَقَالَ ‏\"‏ ذُبَابٌ ذُبَابٌ ‏\"‏ ‏.‏ فَانْطَلَقْتُ فَأَخَذْتُهُ فَرَآنِيَ النَّبِيُّ ـ صلى الله عليه وسلم ـ فَقَالَ ‏\"‏ إِنِّي لَمْ أَعْنِكَ وَهَذَا أَحْسَنُ ‏\"‏ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3636
    },
    {
      "hadithNumber": 3637,
      "english": {
        "narrated": "It was\nnarrated from Nafi’ that Ibn ‘Umar said:",
        "hadith": "“The Messenger of\nAllah (ﷺ) forbade Qaza’.” He (Nafi’) said: “What is Qaza’?”\nHe said:\n“It means shaving part of a child’s head and leaving\nanother part.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ عُمَرَ بْنِ نَافِعٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ نَهَى رَسُولُ اللَّهُ ـ صلى الله عليه وسلم ـ عَنِ الْقَزَعِ ‏.‏ قَالَ وَمَا الْقَزَعُ قَالَ أَنْ يُحْلَقَ مِنْ رَأْسِ الصَّبِيِّ مَكَانٌ وَيُتْرَكَ مَكَانٌ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3637
    },
    {
      "hadithNumber": 3638,
      "english": {
        "narrated": "It was\nnarrated that Ibn ‘Umar said:",
        "hadith": "“The Messenger of Allah (ﷺ)\nforbade Qaza’.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنِ الْقَزَعِ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3638
    },
    {
      "hadithNumber": 3639,
      "english": {
        "narrated": "It was\nnarrated that Ibn ‘Umar said:",
        "hadith": "“The Messenger of Allah (ﷺ)\nwore\na ring of silver, then he had engraved on it (the words)\n‘Muhammad\nRasul Allah’ (Muhammad the Messenger of Allah). And he said:\n‘No\none should have his ring engraved like this ring of mine.’”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لاَ يَنْقُشْ أَحَدٌ عَلَى نَقْشِ خَاتَمِي هَذَا ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3639
    },
    {
      "hadithNumber": 3640,
      "english": {
        "narrated": "It was\nnarrated that Anas bin Malik said:",
        "hadith": "“The Messenger of Allah\n(ﷺ)\nhad a ring made for him, and he said: ‘I have had a ring made\nfor\nme and had it engraved, and no one should make a ring with similar\nengraving.’”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنَّا قَدِ اصْطَنَعْنَا خَاتَمًا وَنَقَشْنَا فِيهِ نَقْشًا فَلاَ يَنْقُشَنَّ عَلَيْهِ أَحَدٌ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3640
    },
    {
      "hadithNumber": 3641,
      "english": {
        "narrated": "It was\nnarrated from Anas bin Malik that the Messenger of Allah (ﷺ)\nwore a\nring of silver, in which was an Ethiopian gemstone and the\ninscription:",
        "hadith": "‘Muhammad Rasul Allah’ (Muhammad the Messenger of\nAllah).”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، حَدَّثَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ اتَّخَذَ خَاتَمًا مِنْ فِضَّةٍ لَهُ فَصٌّ حَبَشِيٌّ وَنَقْشُهُ مُحَمَّدٌ رَسُولُ اللَّهِ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3641
    },
    {
      "hadithNumber": 3642,
      "english": {
        "narrated": "It was\nnarrated that ‘Ali said:",
        "hadith": "“The Messenger of Allah (ﷺ) forbade\nwearing gold rings.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعِ بْنِ جُبَيْرٍ، مَوْلَى عَلِيٍّ عَنْ عَلِيٍّ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنِ التَّخَتُّمِ بِالذَّهَبِ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3642
    },
    {
      "hadithNumber": 3643,
      "english": {
        "narrated": "It was\nnarrated that Ibn ‘Umar said:",
        "hadith": "“The Messenger of Allah (ﷺ)\nforbade gold rings.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنِ الْحَسَنِ بْنِ سُهَيْلٍ، عَنِ ابْنِ عُمَرَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ خَاتَمِ الذَّهَبِ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3643
    },
    {
      "hadithNumber": 3644,
      "english": {
        "narrated": "It was\nnarrated that ‘Aishah the Mother of the Believers said:",
        "hadith": "“Najashi\nsent some jewelry as a gift to the Messenger of Allah (ﷺ).\nAmong\nthat was a gold ring with an Ethiopian gemstone. The Messenger\nof\nAllah (ﷺ) picked it up with a stick – as if he found it\ndistasteful – or with one of his fingers, then he called for his\ndaughter, Umamah bint Abul-‘As, and said: ‘Wear this, O my\ndaughter.’”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ تَحَلَّىْ بِهَذَا يَا بُنَيَّةُ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3644
    },
    {
      "hadithNumber": 3645,
      "english": {
        "narrated": "",
        "hadith": "It was\nnarrated from Ibn ‘Umar that the Prophet (ﷺ) used to wear\n(his\nring) with the stone nearest his palm.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَيُّوبَ بْنِ مُوسَى، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كَانَ يَجْعَلُ فَصَّ خَاتَمِهِ مِمَّا يَلِي كَفَّهُ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3645
    },
    {
      "hadithNumber": 3646,
      "english": {
        "narrated": "",
        "hadith": "It was\nnarrated from Anas bin Malik that the Messenger of Allah (ﷺ)\nwore a\nsilver ring with an Ethiopian gemstone, and he used to ear the\nstone\nin towards his palm.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، حَدَّثَنِي سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ يُونُسَ بْنِ يَزِيدَ الأَيْلِيِّ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ لَبِسَ خَاتَمَ فِضَّةٍ فِيهِ فَصٌّ حَبَشِيٌّ كَانَ يَجْعَلُ فَصَّهُ فِي بَطْنِ كَفِّهِ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3646
    },
    {
      "hadithNumber": 3647,
      "english": {
        "narrated": "",
        "hadith": "It was\nnarrated from ‘Abdullah bin Ja’far that the Prophet (ﷺ) used\nto\nwear a ring on his right hand.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ إِبْرَاهِيمَ بْنِ الْفَضْلِ، عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ، عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كَانَ يَتَخَتَّمُ فِي يَمِينِهِ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3647
    },
    {
      "hadithNumber": 3648,
      "english": {
        "narrated": "It was\nnarrated that ‘Ali said:",
        "hadith": "“The Messenger of Allah (ﷺ) forbade\nme\nto wear a ring on this and on this,” meaning the little finger and\nthe thumb.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ عَاصِمٍ، عَنْ أَبِي بُرْدَةَ، عَنْ عَلِيٍّ، قَالَ نَهَانِي رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ أَتَخَتَّمَ فِي هَذِهِ وَفِي هَذِهِ يَعْنِي الْخِنْصَرَ وَالإِبْهَامَ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3648
    },
    {
      "hadithNumber": 3649,
      "english": {
        "narrated": "It was\nnarrated from Abu Talhah that the Prophet (ﷺ) said:",
        "hadith": "“The\nangels\ndo not enter a house in which there is a dog or an image.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لاَ تَدْخُلُ الْمَلاَئِكَةُ بَيْتًا فِيهِ كَلْبٌ وَلاَ صُورَةٌ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3649
    },
    {
      "hadithNumber": 3650,
      "english": {
        "narrated": "It was\nnarrated from ‘Ali bin Abu Talib that the Prophet (ﷺ) said:",
        "hadith": "“The\nangels do not enter a house in which there is a dog or an image.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنَّ الْمَلاَئِكَةَ لاَ تَدْخُلُ بَيْتًا فِيهِ كَلْبٌ وَلاَ صُورَةٌ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3650
    },
    {
      "hadithNumber": 3651,
      "english": {
        "narrated": "It was\nnarrated that ‘Aishah said:",
        "hadith": "“Jibril (as) promised the\nMessenger\nof Allah (ﷺ) that he would come to him at a certain hour,\nbut he\nwas late. The Prophet (ﷺ) went out and there was Jibril\nstanding at\nthe door. He said: ‘What kept you from entering?’ He said:\n‘There\nis a dog in the house, and we do not enter a house in which\nthere is\na dog or an image.’”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مَا مَنَعَكَ أَنْ تَدْخُلَ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3651
    },
    {
      "hadithNumber": 3652,
      "english": {
        "narrated": "",
        "hadith": "It was\nnarrated from Abu Umamah that a woman came to the Prophet\n(ﷺ) and\ntold him that her husband was away on some military\ncampaign. She\nasked him for permission to make an image of a palm tree\nin her\nhouse, and he did not let her, or he forbade her.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا الْعَبَّاسُ بْنُ عُثْمَانَ الدِّمَشْقِيُّ، حَدَّثَنَا الْوَلِيدُ، حَدَّثَنَا عُفَيْرُ بْنُ مَعْدَانَ، حَدَّثَنَا سُلَيْمُ بْنُ عَامِرٍ، عَنْ أَبِي أُمَامَةَ، أَنَّ امْرَأَةً، أَتَتِ النَّبِيَّ ـ صلى الله عليه وسلم ـ فَأَخْبَرَتْهُ أَنَّ زَوْجَهَا فِي بَعْضِ الْمَغَازِي فَاسْتَأْذَنَتْهُ أَنْ تُصَوِّرَ فِي بَيْتِهَا نَخْلَةً فَمَنَعَهَا أَوْ نَهَاهَا ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3652
    },
    {
      "hadithNumber": 3653,
      "english": {
        "narrated": "It was\nnarrated that ‘Aishah said:",
        "hadith": "“I covered a small room closet of\nmine, meaning, from the inside, with a curtain on which there were\nimages. When the Prophet (ﷺ) came, he tore it down, so I made two\npillows from it, and I saw the Prophet (ﷺ) reclining on one of\nthem.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ سَتَرْتُ سَهْوَةً لِي - تَعْنِي الدَّاخِلَ - بِسِتْرٍ فِيهِ تَصَاوِيرُ فَلَمَّا قَدِمَ النَّبِيُّ ـ صلى الله عليه وسلم ـ هَتَكَهُ فَجَعَلْتُ مِنْهُ مَنْبُوذَتَيْنِ فَرَأَيْتُ النَّبِيَّ ـ صلى الله عليه وسلم ـ مُتَّكِئًا عَلَى إِحْدَاهُمَا ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3653
    },
    {
      "hadithNumber": 3654,
      "english": {
        "narrated": "It was\nnarrated that ‘Ali said:",
        "hadith": "“The Messenger of Allah (ﷺ) forbade\nrings of gold and Al-Mitharah,”* meaning the red ones.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ أَبِي إِسْحَاقَ، عَنْ هُبَيْرَةَ، عَنْ عَلِيٍّ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ خَاتَمِ الذَّهَبِ وَعَنِ الْمِيثَرَةِ يَعْنِي الْحَمْرَاءَ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3654
    },
    {
      "hadithNumber": 3655,
      "english": {
        "narrated": "It was\nnarrated that ‘Amir Al-Hajri said:",
        "hadith": "“I heard Abu Raihanah, the\nCompanion of the Prophet (ﷺ) say: ‘The Prophet (ﷺ) used to\nforbid\nriding on leopard skins.’”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، حَدَّثَنِي عَيَّاشُ بْنُ عَبَّاسٍ الْحِمْيَرِيُّ، عَنْ أَبِي حُصَيْنٍ الْحَجْرِيِّ الْهَيْثَمِ، عَنْ عَامِرٍ الْحَجْرِيِّ، قَالَ سَمِعْتُ أَبَا رَيْحَانَةَ، صَاحِبَ النَّبِيِّ ـ صلى الله عليه وسلم ـ يَقُولُ كَانَ النَّبِيُّ ـ صلى الله عليه وسلم ـ يَنْهَى عَنْ رُكُوبِ النُّمُورِ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3655
    },
    {
      "hadithNumber": 3656,
      "english": {
        "narrated": "It was\nnarrated that Mu’awiyah said:",
        "hadith": "“The Messenger of Allah (ﷺ)\nused\nto forbid riding on leopard skins.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ أَبِي الْمُعْتَمِرِ، عَنِ ابْنِ سِيرِينَ، عَنْ مُعَاوِيَةَ، قَالَ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يَنْهَى عَنْ رُكُوبِ النُّمُورِ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 32,
      "bookName": "32Chapters on Dress كتاب اللباس",
      "bookReference": 3656
    }
  ]
}