{
  "collectionId": "ibnmajah",
  "bookId": 11,
  "bookName": "11The Chapters on Expiation كتاب الكفارات",
  "hadithCount": 47,
  "hadiths": [
    {
      "hadithNumber": 2090,
      "english": {
        "narrated": "It was narrated that Rifa'ah Al - Juhani said:",
        "hadith": "\"When the Prophet (ﷺ) took an oath he would say: 'By the One in Whose Hand is the soul of Muhammad.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2090
    },
    {
      "hadithNumber": 2091,
      "english": {
        "narrated": "It was narrated that Rifa'ah bin 'Arabah A-Juhani said:",
        "hadith": "\"The swearing of the Messenger of Allah (ﷺ) when he took an oath and I bear witness before Allah was: 'By the One in Whose Hand is my soul.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ وَالَّذِي نَفْسِي بِيَدِهِ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2091
    },
    {
      "hadithNumber": 2092,
      "english": {
        "narrated": "It was narrated from Salim that his father said:",
        "hadith": "\"The swearing most frequently sworn by the Messenger of Allah (ﷺ) was: 'No, by the Controller of the hearts.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لاَ وَمُصَرِّفِ الْقُلُوبِ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2092
    },
    {
      "hadithNumber": 2093,
      "english": {
        "narrated": "It was narrated that Abu Hurairah said:",
        "hadith": "\"The swearing of the Messenger of Allah (ﷺ) was: 'No, and I ask Allah for forgiveness.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لاَ وَأَسْتَغْفِرُ اللَّهَ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2093
    },
    {
      "hadithNumber": 2094,
      "english": {
        "narrated": "It was narrated from Salim bin 'Abdullah bin 'Umar, from his father, from 'Umar, that :",
        "hadith": "the Messenger of Allah (ﷺ) heard him swearing by his father. The Messenger of Allah (ﷺ) said: 'Allah forbids you from making oaths by your forefathers.\" 'Umar said: I never took an oath by them (i.e., my forefathers) myself nor narrating such words from anyone else.”",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنَّ اللَّهَ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2094
    },
    {
      "hadithNumber": 2095,
      "english": {
        "narrated": "It was narrated from 'Abdur-Rahman bin Samurah that :",
        "hadith": "the Messenger of Allah (ﷺ) said: 'Do not take oaths by idols nor by your forefathers. \"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لاَ تَحْلِفُوا بِالطَّوَاغِي وَلاَ بِآبَائِكُمْ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2095
    },
    {
      "hadithNumber": 2096,
      "english": {
        "narrated": "It was narrated from Abu Hurairah that :",
        "hadith": "the Messenger of Allah (ﷺ) said: \"Whoever takes an oath, and swears, saying: 'By Al-Lat and Al-Uzza,' let him say:'La ilaha illallah.' \"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مَنْ حَلَفَ فَقَالَ فِي يَمِينِهِ بِاللاَّتِ وَالْعُزَّى فَلْيَقُلْ لاَ إِلَهَ إِلاَّ اللَّهُ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2096
    },
    {
      "hadithNumber": 2097,
      "english": {
        "narrated": "It was narrated that Sa'd said:",
        "hadith": "\"I took an oath by Lat and 'Uzza. The Messenger of Allah (ﷺ) said : 'Say: \"La ilaha illallah wahdahu la sharika lahu\" (None has the right to be worshipped but Allah alone, with no partner or associate),\" then spit toward your left three times, and seek refuge with Allah, and do not do that again.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ قُلْ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ ثُمَّ انْفُثْ عَنْ يَسَارِكَ ثَلاَثًا وَتَعَوَّذْ وَلاَ تَعُدْ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2097
    },
    {
      "hadithNumber": 2098,
      "english": {
        "narrated": "It was narrated that Thabit bin Ad-Dahhak said:",
        "hadith": "The Messenger of Allah (ﷺ) said: 'Whoever takes an oath to follow a religion other than Islam, telling a deliberate lie, he will be as he said.'\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مَنْ حَلَفَ بِمِلَّةٍ سِوَى الإِسْلاَمِ كَاذِبًا مُتَعَمِّدًا فَهُوَ كَمَا قَالَ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2098
    },
    {
      "hadithNumber": 2099,
      "english": {
        "narrated": "It was narrated from Anas that the Messenger of Allah (ﷺ) heard a man say:",
        "hadith": "\"If that happens, I will be a Jew.\" The Messenger of Allah (ﷺ) said: 'That is guaranteed.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ وَجَبَتْ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2099
    },
    {
      "hadithNumber": 2100,
      "english": {
        "narrated": "It was narrated from Abdullah bin Buraidah that his father told that :",
        "hadith": "the Messenger of Allah (ﷺ) said: \"Whoever says: 'I have nothing to do with Islam,' if he is lying then he is as he said, and if he is telling the truth, his Islam will not be sound.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مَنْ قَالَ إِنِّي بَرِيءٌ مِنَ الإِسْلاَمِ فَإِنْ كَانَ كَاذِبًا فَهُوَ كَمَا قَالَ وَإِنْ كَانَ صَادِقًا لَمْ يَعُدْ إِلَيْهِ الإِسْلاَمُ سَالِمًا ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2100
    },
    {
      "hadithNumber": 2101,
      "english": {
        "narrated": "It was narrated that Ibn 'Umar said:",
        "hadith": "\"The Messenger of Allah (ﷺ) heard a man taking an oath by his father and said: 'Do not make oaths by your forefathers. Whoever makes an oath by Allah, let him fulfill his oath, and if an oath is sworn for a person by Allah, let him accept it. Whoever is not content with Allah has nothing to do with Allah.'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لاَ تَحْلِفُوا بِآبَائِكُمْ مَنْ حَلَفَ بِاللَّهِ فَلْيَصْدُقْ وَمَنْ حُلِفَ لَهُ بِاللَّهِ فَلْيَرْضَ وَمَنْ لَمْ يَرْضَ بِاللَّهِ فَلَيْسَ مِنَ اللَّهِ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2101
    },
    {
      "hadithNumber": 2102,
      "english": {
        "narrated": "It was narrated from Abu Hurairah that the Prophet (ﷺ) said:",
        "hadith": "\"Eisa bin Maryam saw a man stealing and said: 'Did you steal?'  He said: 'No, by the One besides Whom there is no other God.' 'Eisa said: 'I believe in Allah, and I do not believe what my eyes see.'\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ رَأَى عِيسَى ابْنُ مَرْيَمَ رَجُلاً يَسْرِقُ فَقَالَ أَسَرَقْتَ قَالَ لاَ وَالَّذِي لاَ إِلَهَ إِلاَّ هُوَ ‏.‏ فَقَالَ عِيسَى آمَنْتُ بِاللَّهِ وَكَذَّبْتُ بَصَرِي ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2102
    },
    {
      "hadithNumber": 2103,
      "english": {
        "narrated": "It was narrated from Ibn 'Umar that :",
        "hadith": "the Messenger of Allah (ﷺ) said: \"An oath (leads to) either sin or regret. \"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنَّمَا الْحَلِفُ حِنْثٌ أَوْ نَدَمٌ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2103
    },
    {
      "hadithNumber": 2104,
      "english": {
        "narrated": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:",
        "hadith": "'Whoever swears an oath and says In sha' Allah, he will have made an exception.\"(2)",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مَنْ حَلَفَ فَقَالَ إِنْ شَاءَ اللَّهُ فَلَهُ ثُنْيَاهُ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2104
    },
    {
      "hadithNumber": 2105,
      "english": {
        "narrated": "It was narrated from Ibn 'Umar that the Messenger of Allah (ﷺ) said:",
        "hadith": "\"Whoever swears an oath and says In sha' Allah, if he wishes he may go ahead and if he wishes he may not, without having broken his oath.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مَنْ حَلَفَ وَاسْتَثْنَى إِنْ شَاءَ رَجَعَ وَإِنْ شَاءَ تَرَكَ غَيْرُ حَانِثٍ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2105
    },
    {
      "hadithNumber": 2106,
      "english": {
        "narrated": "It was narrated from Ibn 'Umar:",
        "hadith": "\"Whoever swears an oath and says In sha' Allah, will never break his oath.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مَنْ حَلَفَ وَاسْتَثْنَى فَلَمْ يَحْنَثْ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2106
    },
    {
      "hadithNumber": 2107,
      "english": {
        "narrated": "It was narrated from Abu Burdah that his father Abu Musa said:",
        "hadith": "\"I came to the Messenger of Allah (ﷺ) with a group of Asharites and asked him to give us animals to ride. He said: 'By Allah, I cannot give you anything to ride, and I have nothing to give you to ride.' We stayed as long as Allah willed, then some camels were brought to him. He ordered that we be given three she-camels with fine humps. When we left, we said to one another: 'We came to the Messenger of Allah (ﷺ) to ask him for animals to ride, and he swore by Allah that he would not give us anything to ride, then he gave us something. Let us go back.' So we went to him and we said: 'O Messenger of Allah! We came to you seeking mounts, and you took an oath that you would not give us mounts, then you gave us some mounts.' He said: 'By Allah, I did not give you animals to ride, rather Allah gave you them to ride. I, by Allah, if Allah wills, do not swear and then see something better than it, but I offer expiation for what I swore about, and do that which is better.' Or he said: 'I do that which is better and offer expiation for what I swore about.'\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ، أَنْبَأَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا غَيْلاَنُ بْنُ جَرِيرٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِيهِ أَبِي مُوسَى، قَالَ أَتَيْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ فِي رَهْطٍ مِنَ الأَشْعَرِيِّينَ نَسْتَحْمِلُهُ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ وَاللَّهِ مَا أَحْمِلُكُمْ وَمَا عِنْدِي مَا أَحْمِلُكُمْ عَلَيْهِ ‏\"‏ ‏.‏ قَالَ فَلَبِثْنَا مَا شَاءَ اللَّهُ ثُمَّ أُتِيَ بِإِبِلٍ فَأَمَرَ لَنَا بِثَلاَثَةِ إِبِلٍ ذَوْدٍ غُرِّ الذُّرَى فَلَمَّا انْطَلَقْنَا قَالَ بَعْضُنَا لِبَعْضٍ أَتَيْنَا رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ نَسْتَحْمِلُهُ فَحَلَفَ أَلاَّ يَحْمِلَنَا ثُمَّ حَمَلَنَا ارْجِعُوا بِنَا ‏.‏ فَأَتَيْنَاهُ فَقُلْنَا يَا رَسُولَ اللَّهِ إِنَّا أَتَيْنَاكَ نَسْتَحْمِلُكَ فَحَلَفْتَ أَنْ لاَ تَحْمِلَنَا ‏.‏ ثُمَّ حَمَلْتَنَا فَقَالَ ‏\"‏ وَاللَّهِ مَا أَنَا حَمَلْتُكُمْ فَإِنَّ اللَّهَ حَمَلَكُمْ وَاللَّهِ مَا أَنَا حَمَلْتُكُمْ بَلِ اللَّهُ حَمَلَكُمْ إِنِّي وَاللَّهِ إِنْ شَاءَ اللَّهُ لاَ أَحْلِفُ عَلَى يَمِينٍ فَأَرَى غَيْرَهَا خَيْرًا مِنْهَا إِلاَّ كَفَّرْتُ عَنْ يَمِينِي وَأَتَيْتُ الَّذِي هُوَ خَيْرٌ ‏\"‏ ‏.‏ أَوْ قَالَ ‏\"‏ أَتَيْتُ الَّذِي هُوَ خَيْرٌ وَكَفَّرْتُ عَنْ يَمِينِي ‏\"‏ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2107
    },
    {
      "hadithNumber": 2108,
      "english": {
        "narrated": "It was narrated from 'Adi bin Hatim that :",
        "hadith": "the Messenger of Allah (ﷺ), said: \"Whoever swears an oath then sees that something else is better than it, let him do that which is better and offer expiation for what he swore about. \"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مَنْ حَلَفَ عَلَى يَمِينٍ فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا فَلْيَأْتِ الَّذِي هُوَ خَيْرٌ وَلْيُكَفِّرْ عَنْ يَمِينِهِ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2108
    },
    {
      "hadithNumber": 2109,
      "english": {
        "narrated": "It was narrated from Abul-Ahwas 'Awf bin Malik Al- Jushami that his father said:",
        "hadith": "\"I said: 'O Messenger of Allah, my cousin comes to me and I swear that I will not give him anything or uphold the ties of kinship with him.' He said: 'Offer expiation for what you swore about.'\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ كَفِّرْ عَنْ يَمِينِكَ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2109
    },
    {
      "hadithNumber": 2110,
      "english": {
        "narrated": "It was narrated from 'Aishah that the Messenger of Allah (ﷺ) said:",
        "hadith": "\"Whoever takes an oath to cut off the ties of kinship, or to do something that is not right, the fulfillment of his vow is not to do that.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مَنْ حَلَفَ فِي قَطِيعَةِ رَحِمٍ أَوْ فِيمَا لاَ يَصْلُحُ فَبِرُّهُ أَنْ لاَ يَتِمَّ عَلَى ذَلِكَ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2110
    },
    {
      "hadithNumber": 2111,
      "english": {
        "narrated": "It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said that the Prophet (ﷺ) said:",
        "hadith": "\"Whoever swears an oath then sees  that something else is better than it, let him not do it, and his leaving it is the expiation for it. \"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مَنْ حَلَفَ عَلَى يَمِينٍ فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا فَلْيَتْرُكْهَا فَإِنَّ تَرْكَهَا كَفَّارَتُهَا ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2111
    },
    {
      "hadithNumber": 2112,
      "english": {
        "narrated": "It was narrated that Ibn Abbas said:",
        "hadith": "\"The Messenger of Allah (ﷺ) offered expiation of a Sa' of dates, and he enjoined the people to do likewise. Whoever does not have that (must give) half a Sa' of wheat.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا الْعَبَّاسُ بْنُ يَزِيدَ، حَدَّثَنَا زِيَادُ بْنُ عَبْدِ اللَّهِ الْبَكَّائِيُّ، حَدَّثَنَا عُمَرُ بْنُ عَبْدِ اللَّهِ بْنِ يَعْلَى الثَّقَفِيُّ، عَنِ الْمِنْهَالِ بْنِ عَمْرٍو، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَفَّرَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ بِصَاعٍ مِنْ تَمْرٍ وَأَمَرَ النَّاسَ بِذَلِكَ فَمَنْ لَمْ يَجِدْ فَنِصْفُ صَاعٍ مِنْ بُرٍّ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2112
    },
    {
      "hadithNumber": 2113,
      "english": {
        "narrated": "It was narrated that Ibn 'Abbas said:",
        "hadith": "\"A man would give his family food that was abundant and another would give his family food that was barely sufficient, then the following was revealed: 'With the Awsat of that with which you feed your families...’”(2)",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ سُلَيْمَانَ بْنِ أَبِي الْمُغِيرَةِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ الرَّجُلُ يَقُوتُ أَهْلَهُ قُوتًا فِيهِ سَعَةٌ وَكَانَ الرَّجُلُ يَقُوتُ أَهْلَهُ قُوتًا فِيهِ شِدَّةٌ فَنَزَلَتْ ‏{مِنْ أَوْسَطِ مَا تُطْعِمُونَ أَهْلِيكُمْ}‏ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2113
    },
    {
      "hadithNumber": 2114,
      "english": {
        "narrated": "It was narrated that Hammam heard Abu Hurairah saying that 'Abul-Qasim (ﷺ) said:",
        "hadith": "\"If anyone of you insists on fulfilling what he swore to (after learning that it is wrong) then it is more sinful before Allah than (breaking the oath for which) the expiation that has been enjoined upon him.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِذَا اسْتَلَجَّ أَحَدُكُمْ فِي الْيَمِينِ فَإِنَّهُ آثَمُ لَهُ عِنْدَ اللَّهِ مِنَ الْكَفَّارَةِ الَّتِي أُمِرَ بِهَا ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2114
    },
    {
      "hadithNumber": 2115,
      "english": {
        "narrated": "It was narrated that Bara' bin 'Azib said:",
        "hadith": "'The Messenger of Allah (ﷺ) commanded us to help fulfill the oath.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ عَلِيِّ بْنِ صَالِحٍ، عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ، عَنْ مُعَاوِيَةَ بْنِ سُوَيْدِ بْنِ مُقَرِّنٍ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ أَمَرَنَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ بِإِبْرَارِ الْمُقْسِمِ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2115
    },
    {
      "hadithNumber": 2116,
      "english": {
        "narrated": "It was narrated from Mujahid, that 'Abdur-Rahman bin Safwan, or Safwan bin 'Abdur- Rahman Al-Qurashi said:",
        "hadith": "\"On the Day of the conquest of Makkah, he came with his father and he said: 'O Messenger of Allah, give my father a share of Hijrah.' He said: 'There is no Hijrah.' Then he went away and entered upon 'Abbas and said: 'Do you know who I am?' He said: 'Yes.' Then 'Abbas went out, wearing a shirt and no upper wrap, and said: 'O Messenger of Allah, do you know so-and-so with whom we have friendly ties? He brought his father to swear an oath of allegiance (i.e., promise) to emigrate.' The Prophet (ﷺ) said: 'There is no Hijrah.'\" 'Abbas said: 'I adjure you to do it.' The Prophet (ﷺ) stretched forth his hand and touched his hand, and said: 'I have fulfilled the oath of my uncle, but there is no Hijrah.\"' (Da'if)Another chain with similar wording. Yazid bin Abu Ziyad said: \"Meaning: There is no Hijrah from a land whose people have accepted Islam.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، عَنْ مُجَاهِدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ صَفْوَانَ، أَوْ عَنْ صَفْوَانَ بْنِ عَبْدِ الرَّحْمَنِ الْقُرَشِيِّ، قَالَ لَمَّا كَانَ يَوْمُ فَتْحِ مَكَّةَ جَاءَ بِأَبِيهِ فَقَالَ يَا رَسُولَ اللَّهِ اجْعَلْ لأَبِي نَصِيبًا فِي الْهِجْرَةِ ‏.‏ فَقَالَ ‏\"‏ إِنَّهُ لاَ هِجْرَةَ ‏\"‏ ‏.‏ فَانْطَلَقَ فَدَخَلَ عَلَى الْعَبَّاسِ فَقَالَ قَدْ عَرَفْتَنِي فَقَالَ أَجَلْ ‏.‏ فَخَرَجَ الْعَبَّاسُ فِي قَمِيصٍ لَيْسَ عَلَيْهِ رِدَاءٌ فَقَالَ يَا رَسُولَ اللَّهِ قَدْ عَرَفْتَ فُلاَنًا وَالَّذِي بَيْنَنَا وَبَيْنَهُ جَاءَ بِأَبِيهِ لِيُبَايِعَكَ عَلَى الْهِجْرَةِ ‏.‏ فَقَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ إِنَّهُ لاَ هِجْرَةَ ‏\"‏ ‏.‏ فَقَالَ الْعَبَّاسُ أَقْسَمْتُ عَلَيْكَ ‏.‏ فَمَدَّ النَّبِيُّ ـ صلى الله عليه وسلم ـ يَدَهُ فَمَسَّ يَدَهُ فَقَالَ ‏\"‏ أَبْرَرْتُ عَمِّي وَلاَ هِجْرَةَ ‏\"‏ ‏.‏ \n حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا الْحَسَنُ بْنُ الرَّبِيعِ، عَنْ عَبْدِ اللَّهِ بْنِ إِدْرِيسَ، عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ، بِإِسْنَادِهِ نَحْوَهُ ‏.‏ قَالَ يَزِيدُ بْنُ أَبِي زِيَادٍ يَعْنِي لاَ هِجْرَةَ مِنْ دَارٍ قَدْ أَسْلَمَ أَهْلُهَا ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2116
    },
    {
      "hadithNumber": 2117,
      "english": {
        "narrated": "It was narrated from Ibn 'Abbas that the Messenger of Allah (ﷺ) said:",
        "hadith": "'When anyone of you swears an oath, let him not say: 'What Allah wills and what you will.' Rather let him say: 'What Allah wills and then what you will.'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِذَا حَلَفَ أَحَدُكُمْ فَلاَ يَقُلْ مَا شَاءَ اللَّهُ وَشِئْتَ ‏.‏ وَلَكِنْ لِيَقُلْ مَا شَاءَ اللَّهُ ثُمَّ شِئْتَ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2117
    },
    {
      "hadithNumber": 2118,
      "english": {
        "narrated": "It was narrated from Hudhaifah bin Yaman that :",
        "hadith": "a Muslim man saw in a dream that he met a man from among the People of the Book, who said: \"What good people you would be if only you were not committing Shirk. For you say: 'What Allah  wills and Muhammad wills.\"' He mentioned that to the Prophet (ﷺ) and he said: \"By Allah, I am aware of that. Say: 'What Allah wills then what Muhammad wills.\"'Another chain from Tufail bin Sakhbarah, the brother of 'Aishah by her mother, from the Prophet (ﷺ), with similar wording.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ أَمَا وَاللَّهِ إِنْ كُنْتُ لأَعْرِفُهَا لَكُمْ قُولُوا مَا شَاءَ اللَّهُ ثُمَّ شَاءَ مُحَمَّدٌ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2118
    },
    {
      "hadithNumber": 2119,
      "english": {
        "narrated": "It was narrated that Suwaid bin Hanzalah said:",
        "hadith": "\"We went out looking for the Messenger of Allah (ﷺ) and Wa'il bin Hujr was with us. An enemy of his seized him and the people were reluctant to swear an oath but I swore that he was my brother, so they set him free. We came to the Messenger of Allah (ﷺ) and I told him that the people had been reluctant to swear an oath, but I had sworn that he was my brother. He said: 'You told the truth. The Muslim is the brother of his fellow Muslim.' \"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ صَدَقْتَ الْمُسْلِمُ أَخُو الْمُسْلِمِ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2119
    },
    {
      "hadithNumber": 2120,
      "english": {
        "narrated": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:",
        "hadith": "\"The oath is only according to the intention of the one who requests the oath to be taken.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنَّمَا الْيَمِينُ عَلَى نِيَّةِ الْمُسْتَحْلِفِ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2120
    },
    {
      "hadithNumber": 2121,
      "english": {
        "narrated": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:",
        "hadith": "\"Your oath is as your companion understands it to be.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ يَمِينُكَ عَلَى مَا يُصَدِّقُكَ بِهِ صَاحِبُكَ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2121
    },
    {
      "hadithNumber": 2122,
      "english": {
        "narrated": "It was narrated that 'Abdullah bin 'Umar said:",
        "hadith": "\"The Messenger of Allah (ﷺ) forbade vows and said: 'They are just a means of taking wealth from the miserly.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنَّمَا يُسْتَخْرَجُ بِهِ مِنَ اللَّئِيمِ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2122
    },
    {
      "hadithNumber": 2123,
      "english": {
        "narrated": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:",
        "hadith": "\"Vows do not bring the son of Adam anything unless it has been decreed for him. But he is dominated by Divine preordainment, and will get what is decreed for him. And (vows) are a means of making the miser give something, so what he desires becomes obtainable for him, which was not obtainable before his vow. And Allah says: 'Spend, I will spend on you.'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إِنَّ النَّذْرَ لاَ يَأْتِي ابْنَ آدَمَ بِشَىْءٍ إِلاَّ مَا قُدِّرَ لَهُ وَلَكِنْ يَغْلِبُهُ الْقَدَرُ مَا قُدِّرَ لَهُ فَيُسْتَخْرَجُ بِهِ مِنَ الْبَخِيلِ فَيَتَيَسَّرُ عَلَيْهِ مَا لَمْ يَكُنْ يَتَيَسَّرُ عَلَيْهِ مِنْ قَبْلِ ذَلِكَ وَقَدْ قَالَ اللَّهُ أَنْفِقْ أُنْفِقْ عَلَيْكَ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2123
    },
    {
      "hadithNumber": 2124,
      "english": {
        "narrated": "It was narrated from 'Imran bin Husain that the Messenger of Allah (ﷺ) said:",
        "hadith": "\"[There is no vow to commit disobedience and] no vow concerning that which the son of Adam does not possess.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لاَ نَذْرَ فِي مَعْصِيَةٍ وَلاَ نَذْرَ فِيمَا لاَ يَمْلِكُ ابْنُ آدَمَ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2124
    },
    {
      "hadithNumber": 2125,
      "english": {
        "narrated": "It was narrated from 'Aishah that the Messenger of Allah (ﷺ) said:",
        "hadith": "\"There is no vow to commit disobedience, and the expiation (for such a vow) is the expiation for breaking an oath.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لاَ نَذْرَ فِي مَعْصِيَةٍ وَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2125
    },
    {
      "hadithNumber": 2126,
      "english": {
        "narrated": "It was narrated from 'Aishah that the Messenger of Allah (ﷺ) said:",
        "hadith": "\"Whoever vows to obey Allah, let him obey Him, and whoever vows to disobey Allah, let him not disobey Him. \"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مَنْ نَذَرَ أَنْ يُطِيعَ اللَّهَ فَلْيُطِعْهُ وَمَنْ نَذَرَ أَنْ يَعْصِيَ اللَّهَ فَلاَ يَعْصِهِ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2126
    },
    {
      "hadithNumber": 2127,
      "english": {
        "narrated": "It was narrated from 'Uqbah bin 'Amit Al-Juhani that the Messenger of Allah (ﷺ) said:",
        "hadith": "\"Whoever makes a vow and does not state it specifically, the expiation (for such a vow) is the expiation for breaking an oath. \"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مَنْ نَذَرَ نَذْرًا وَلَمْ يُسَمِّهِ فَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2127
    },
    {
      "hadithNumber": 2128,
      "english": {
        "narrated": "lt was narrated from Ibn 'Abbas that the Prophet (ﷺ) said:",
        "hadith": "\"Whoever makes a vow and does not state it specifically, the expiation (for such a vow) is the expiation for breaking an oath. Whoever makes a vow and is not able to fulfill it, the expiation for that is the expiation for breaking an oath. Whoever makes a vow and is able to fulfill it, let him do so.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مَنْ نَذَرَ نَذْرًا وَلَمْ يُسَمِّهِ فَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ وَمَنْ نَذَرَ نَذْرًا لَمْ يُطِقْهُ فَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ وَمَنْ نَذَرَ نَذْرًا أَطَاقَهُ فَلْيَفِ بِهِ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2128
    },
    {
      "hadithNumber": 2129,
      "english": {
        "narrated": "It was narrated that 'Umar bin Khattab said:",
        "hadith": "\"I made a vow during the Ignorance period and I asked the Prophet (ﷺ) (about it) after I became Muslim. He told me to fulfill my vow.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، قَالَ نَذَرْتُ نَذْرًا فِي الْجَاهِلِيَّةِ فَسَأَلْتُ النَّبِيَّ ـ صلى الله عليه وسلم ـ بَعْدَ مَا أَسْلَمْتُ فَأَمَرَنِي أَنْ أُوفِيَ بِنَذْرِي ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2129
    },
    {
      "hadithNumber": 2130,
      "english": {
        "narrated": "It was narrated from Ibn Abbas that a man came to the Prophet (ﷺ) and said:",
        "hadith": "\"O Messenger of Allah, I vowed to offer a sacrifice at Buwanah.\" He said: \"Do you intend any action of Ignorance period?\" He said: \"No.\" He said: \"Then fulfill your vow.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، وَعَبْدُ اللَّهِ بْنُ إِسْحَاقَ الْجَوْهَرِيُّ، قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ، أَنْبَأَنَا الْمَسْعُودِيُّ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَجُلاً، جَاءَ إِلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي نَذَرْتُ أَنْ أَنْحَرَ بِبُوَانَةَ فَقَالَ ‏\"‏ فِي نَفْسِكَ شَىْءٌ مِنْ أَمْرِ الْجَاهِلِيَّةِ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ أَوْفِ بِنَذْرِكَ ‏\"‏ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2130
    },
    {
      "hadithNumber": 2131,
      "english": {
        "narrated": "It was narrated from Maimunah bint Kardam Al-Yasariyyah that :",
        "hadith": "her father met the Prophet (ﷺ) when she was riding behind him. He said: \"I vowed to offer a sacrifice at Buwanah.\" The Messenger of Allah (ﷺ) said: \"Is there any idol there?\" He said: \"No.\" He said: \" Fulfill your vow.\" (Hasan)Another chain with similar wording.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ الطَّائِفِيِّ، عَنْ مَيْمُونَةَ بِنْتِ كَرْدَمٍ الْيَسَارِيَّةِ، أَنَّ أَبَاهَا، لَقِيَ النَّبِيَّ ـ صلى الله عليه وسلم ـ وَهِيَ رَدِيفَةٌ لَهُ فَقَالَ إِنِّي نَذَرْتُ أَنْ أَنْحَرَ بِبُوَانَةَ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ هَلْ بِهَا وَثَنٌ ‏\"‏ ‏.‏ قَالَ لاَ ‏.‏ قَالَ ‏\"‏ أَوْفِ بِنَذْرِكَ ‏\"‏ ‏.‏ \n حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ دُكَيْنٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ يَزِيدَ بْنِ مِقْسَمٍ، عَنْ مَيْمُونَةَ بِنْتِ كَرْدَمٍ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ بِنَحْوِهِ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2131
    },
    {
      "hadithNumber": 2132,
      "english": {
        "narrated": "It was narrated from Ibn 'Abbas' that :",
        "hadith": "Sa'd bin 'Ubadah asked the Messenger of Allah (ﷺ) about a vow which his mother had made, but she had died without fulfilling it. The Messenger of Allah (ﷺ) said: \"Fulfill it on her behalf .\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ اقْضِهِ عَنْهَا ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2132
    },
    {
      "hadithNumber": 2133,
      "english": {
        "narrated": "It was narrated from Jabir  bin 'Abdullsh that :",
        "hadith": "a woman came to the Messenger of Allah (ﷺ) and said: \"My mother has died, and she had made a vow to fast, but she died before she could fulfill it. The Messenger of Allah (ﷺ) said: 'Let her guardian fast on her behalf .\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لِيَصُمْ عَنْهَا الْوَلِيُّ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2133
    },
    {
      "hadithNumber": 2134,
      "english": {
        "narrated": "It was narrated from Abu Sa'eed Ar-Ru'aini that 'Abdullah bin Malik told him, that :",
        "hadith": "'Uqbah  bin 'Amir told him, that his sister vowed to walk, barefoot and bareheaded, and he mentioned that to the Messenger of Allah (ﷺ) He said: \"Order her to ride and to cover her head, and to fast for three days.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ مُرْهَا فَلْتَرْكَبْ وَلْتَخْتَمِرْ وَلْتَصُمْ ثَلاَثَةَ أَيَّامٍ ‏\"",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2134
    },
    {
      "hadithNumber": 2135,
      "english": {
        "narrated": "It was narrated that Abu Hurairah said:",
        "hadith": "\"The Prophet (ﷺ) saw an old man walking between his two sons, and he said: What is the matter with him?' His sons said: 'A vow, O Messenger of Allah.' He said: 'Let this old man ride, for Allah has no need of you or your vow.\"'",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ رَأَى النَّبِيُّ ـ صلى الله عليه وسلم ـ شَيْخًا يَمْشِي بَيْنَ ابْنَيْهِ فَقَالَ ‏\"‏ مَا شَأْنُ هَذَا ‏\"‏ ‏.‏ قَالَ ابْنَاهُ نَذْرٌ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ ارْكَبْ أَيُّهَا الشَّيْخُ فَإِنَّ اللَّهَ غَنِيٌّ عَنْكَ وَعَنْ نَذْرِكَ ‏\"‏ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2135
    },
    {
      "hadithNumber": 2136,
      "english": {
        "narrated": "It was narrated from Ibn Abbas that the  :",
        "hadith": "Messenger of Allah (ﷺ) passed by a man in Makkah who was standing in the sun. He said: \"What is this?\" They said: \"He vowed to fast and not to seek shade until night comes, and not to speak, and to remain standing.\" He said: \"Let him speak and seek shade and let him sit down, but let him complete his fast.\"Another chain from Ibn 'Abbas, from the Prophet (ﷺ), with similar wording. expiation for breaking an oath.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا إِسْحَاقُ بْنُ مُحَمَّدٍ الْفَرْوِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ مَرَّ بِرَجُلٍ بِمَكَّةَ وَهُوَ قَائِمٌ فِي الشَّمْسِ فَقَالَ ‏\"‏ مَا هَذَا ‏\"‏ ‏.‏ قَالُوا نَذَرَ أَنْ يَصُومَ وَلاَ يَسْتَظِلَّ إِلَى اللَّيْلِ وَلاَ يَتَكَلَّمَ وَلاَ يَزَالَ قَائِمًا ‏.‏ قَالَ ‏\"‏ لِيَتَكَلَّمْ وَلْيَسْتَظِلَّ وَلْيَجْلِسْ وَلْيُتِمَّ صِيَامَهُ ‏\"‏ ‏.‏ \n حَدَّثَنَا الْحُسَيْنُ بْنُ مُحَمَّدِ بْنِ شَنَبَةَ الْوَاسِطِيُّ، حَدَّثَنَا الْعَلاَءُ بْنُ عَبْدِ الْجَبَّارِ، عَنْ وُهَيْبٍ، عَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ نَحْوَهُ وَاللَّهُ أَعْلَمُ ‏.‏",
        "grade": ""
      },
      "collectionId": "ibnmajah",
      "bookId": 11,
      "bookName": "11The Chapters on Expiation كتاب الكفارات",
      "bookReference": 2136
    }
  ]
}