{
  "collectionId": "riyadussalihin",
  "bookId": 13,
  "bookName": "13The Book of Praise and Gratitude to Allahكتاب حمد الله تعالى وشكره",
  "hadithCount": 4,
  "hadiths": [
    {
      "hadithNumber": 1393,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) reported:",
        "hadith": "On the Night of Al-Isra (the Night of Ascension) the Prophet (ﷺ) was presented with two drinking vessels: one full of wine and the other one full of milk. He looked at them. Then he took the vessel which was full of milk. Thereupon Jibril (Gabriel) said: \"Al-hamdu lillah (praise be to Allah) Who has guided you to that, which is in accord with Fitrah (i.e., Islamic Monotheism; pure nature of Islam). Had you selected wine, your people would have gone astray.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي هريرة رضي الله عنه أن النبي صلى الله عليه وسلم أتي ليلة أسري به بقدحين من خمر ولبن، فنظر إليهما فأخذ اللبن، فقال جبريل صلى الله عليه وسلم‏:‏ ‏\"‏الحمد لله الذي هداك للفطرة لو أخذت الخمر غوت أمتك” ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 13,
      "bookName": "13The Book of Praise and Gratitude to Allahكتاب حمد الله تعالى وشكره",
      "bookReference": 1393
    },
    {
      "hadithNumber": 1394,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Any matter of importance which is not begun with Al-hamdu lillah (praise be to Allah) remains defective.\"[Abu Dawud].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏كل أمر ذي بال لا يبدأ فيه‏:‏ بالحمد لله فهو أقطع‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 13,
      "bookName": "13The Book of Praise and Gratitude to Allahكتاب حمد الله تعالى وشكره",
      "bookReference": 1394
    },
    {
      "hadithNumber": 1395,
      "english": {
        "narrated": "Abu Musa Al-Ash'ari (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"When a slave's child dies, Allah the Most High asks His angels, 'Have you taken out the life of the child of My slave?\" They reply in the affirmative. He then asks, 'Have you taken the fruit of his heart?' They reply in the affirmative. Thereupon he asks, 'What has My slave said?' They say: 'He has praised You and said: Inna lillahi wa inna ilaihi raji'un (We belong to Allah and to Him we shall be returned). Allah says: 'Build a house for My slave in Jannah and name it as Bait-ul-Hamd (the House of Praise).\"'[At-Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إذا مات ولد العبد قال الله تعالى لملائكته‏:‏ قبضتم ولد عبدي‏؟‏ فَيقولون : نَعَمْ ، فيقول : قَبَضْتُمْ ثَمَرَةَ فُؤادِهِ ؟ فيقولون : نَعَمْ ، فيقول : فماذا قال عبدي‏؟‏ فيقولون‏:‏ حمدك واسترجع، فيقول الله تعالى‏:‏ ابنوا لعبدي بيتًا في الجنة، وسموه بيت الحمد‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 13,
      "bookName": "13The Book of Praise and Gratitude to Allahكتاب حمد الله تعالى وشكره",
      "bookReference": 1395
    },
    {
      "hadithNumber": 1396,
      "english": {
        "narrated": "Anas bin Malik (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Allah is pleased with His slave who says: 'Al-hamdu lillah (praise be to Allah)' when he takes a morsel of food and drinks a draught of water.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إن الله ليرضى عن العبد يأكل الأكلة فيحمده عليها، ويشرب الشربة، فيحمده عليها‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 13,
      "bookName": "13The Book of Praise and Gratitude to Allahكتاب حمد الله تعالى وشكره",
      "bookReference": 1396
    }
  ]
}