{
  "collectionId": "riyadussalihin",
  "bookId": 5,
  "bookName": "5The Book of Greetingsكتاب السلام",
  "hadithCount": 50,
  "hadiths": [
    {
      "hadithNumber": 844,
      "english": {
        "narrated": "Abdullah bin 'Amr bin Al-'as (May Allah be pleased with them) reported:",
        "hadith": "A man asked the Messenger of Allah (ﷺ): \"Which act in Islam is the best?\" He (ﷺ) replied, \"To give food, and to greet everyone, whether you know or you do not.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏تطعم الطعام، وتقرأ السلام على من عرفت ومن لم تعرف‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 844
    },
    {
      "hadithNumber": 845,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) reported:",
        "hadith": "The Prophet (ﷺ) said, \"When Allah created Adam (ﷺ), He said to him: 'Go and greet that company of angels who are sitting there - and then listen to what they are going to say in reply to your greetings because that will be your greeting and your off-spring's.' Adam (ﷺ) said to the angels: 'As-Salamu 'Alaikum (May peace be upon you).' They replied: 'As-Salamu 'Alaikum wa Rahmatullah (May peace be upon you and the Mercy of Allah).' Thus adding in reply to him: 'wa Rahmatullah (and the Mercy of Allah)' to his greeting.\"[Al- Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال‏:‏ لما خلق الله تعالى آدم عليه السلام قال‏:‏ اذهب فسلم على أولئك -نفر من الملائكة جلوس- فاستمع ما يحيونك، فإنه تحيتك وتحية ذريتك‏.‏ فقال‏:‏ السلام عليكم فقالوا‏:‏ السلام عليك ورحمة الله، فزادوه‏:‏ ورحمة الله‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 845
    },
    {
      "hadithNumber": 846,
      "english": {
        "narrated": "Al-Bara' bin 'Azib (May Allah be pleased with them) reported:",
        "hadith": "The Messenger of Allah (ﷺ) commanded us to do seven things: to visit the sick, to follow the funeral (of a dead believer), to invoke the Mercy of Allah upon one who sneezes (i.e., by saying to him: Yarhamuk- Allah), to support the weak, to help the oppressed, to promote the greeting of 'As-Salamu 'Alaikum', and to help those who swear to do something to keep their oaths.[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي عمارة البراء بن عازب رضي الله عنهما قال‏:‏ أمرنا رسول الله صلى الله عليه وسلم بسبع‏:‏ بعيادة المريض، واتباع الجنائز، وتشميت العاطس، ونصر الضعيف، وعون المظلوم، وإفشاء السلام وإبرار المقسم‏.‏ ‏(‏‏(‏متفق عليه هذا لفظ إحدى روايات البخاري‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 846
    },
    {
      "hadithNumber": 847,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"By Him in Whose Hand is my life! You will not enter Jannah until you believe, and you will not believe until you love one another. Shall I inform you of something which, if you do, you will love one another? Promote greetings amongst yourselves.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا تدخلوا الجنة حتى تؤمنوا ولا تؤمنوا حتى تحابوا أولا أدلكم على شيء إذا فعلتموه تحاببتم‏؟‏ أفشوا السلام بينكم‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 847
    },
    {
      "hadithNumber": 848,
      "english": {
        "narrated": "'Abdullah bin Salam (May Allah be pleased with him) reported:",
        "hadith": "I heard the Messenger of Allah (ﷺ) saying, \"O people, exchange greetings of peace (i.e., say: As-Salamu 'Alaikum to one another), feed people, strengthen the ties of kinship, and be in prayer when others are asleep, you will enter Jannah in peace.\"[At- Tirmidhi, who classified it as Hasan Sahih].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏يا أيها الناس أفشوا السلام، وأطعموا الطعام، وصلوا الأرحام وصلوا والناس نيام، تدخلوا الجنة بسلام‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 848
    },
    {
      "hadithNumber": 849,
      "english": {
        "narrated": "At-Tufail bin Ubayy bin Ka'b (May Allah be pleased with him) reported:",
        "hadith": "I used to visit 'Abdullah bin 'Umar (May Allah be pleased with them) in the morning and accompany him to the market. 'Abdullah offered greetings of peace to every one he met on the way, be they sellers of petty goods, traders or poor people. One day when I came to him, he asked me to accompany him to the market. I said to him: \"What is the point of your going to the market when you do not sell, nor ask about articles, nor offer a price for them, nor sit down with any company of people. Let us sit down here and talk.\" He replied: \"O Abu Batn (father of a belly) - Tufail had a large belly - we go to the market to greet everyone we meet.\"[Malik, with a sound chain].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن الطفيل بن أبي بن كعب أنه كان يأتي عبد الله بن عمر، فيغدو معه إلى السوق، قال‏:‏ فإذا غدونا إلى السوق، لم يمر عبد الله على سقاط ولا صاحب بيعة، ولا مسكين، ولا أحد إلا سلم عليه، قال الطفيل، فجئت عبد الله بن عمر يومًا، فاستتبعني إلى السوق فقلت له‏:‏ ما تصنع بالسوق، وأنت لا تقف على البيع ولا تسأل عن السلع، ولا تسوم بها، ولا تجلس في مجالس السوق‏؟‏ وأقول‏:‏ اجلس بنا هاهنا نتحدث، فقال يا أبا بطن- وكان الطفيل ذا بطن- إنما نغدو من أجل السلام فنسلم على من لقيناه‏.‏ ‏(‏‏(‏رواه مالك في الموطأ بإسناد صحيح‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 849
    },
    {
      "hadithNumber": 850,
      "english": {
        "narrated": "'Imran bin Husain (May Allah be pleased with them) reported:",
        "hadith": "A man came to the Prophet (ﷺ) and said: \"As-Salamu 'Alaikum (May peace be upon you). The Messenger of Allah (ﷺ) responded to his greeting and the man sat down. The Prophet (ﷺ) said, \"Ten (meaning the man had earned the merit of ten good deeds).\" Another one came and said: \"As-Salamu 'Alaikum wa Rahmatullah (May peace be upon you and the Mercy of Allah).\" The Messenger of Allah (ﷺ) responded to his greeting and the man sat down. The Messenger of Allah (ﷺ) said, \"Twenty.\" A third one came and said: \"As-Salamu 'Alaikum wa Rahmatullahi wa Barakatuhu (May peace be upon you and the Mercy of Allah and His Blessings).\" The Messenger of Allah (ﷺ) responded to his greeting and the man sat down. The Messenger of Allah (ﷺ) said, \"Thirty.\"[Abu Dawud and At- Tirmidhi, who classified it as Hasan].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏عشرون‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 850
    },
    {
      "hadithNumber": 851,
      "english": {
        "narrated": "'Aishah (May Allah be pleased with her) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said to me, \"This is Jibril (Gabriel) who is conveying you greetings of peace.\" I responded: \"Wa 'Alaihis-Salamu wa Rahmatullahi wa Barakatuhu (May peace be upon him and the Mercy of Allah and His Blessings).\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن عائشة رضي الله عنه قالت‏:‏ قال لي رسول الله صلى الله عليه وسلم‏:‏ “هذا جبريل يقرأ عليك السلام‏\"‏ قالت‏:‏ قلت‏:‏ ‏\"‏وعليه السلام ورحمة الله وبركاته‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏\nوهكذا وقع في بعض روايات الصحيحين‏:‏ \"وبركاته\" وفي بعضها بحذفها وزيادة الثقة مقبولة",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 851
    },
    {
      "hadithNumber": 852,
      "english": {
        "narrated": "",
        "hadith": "Anas (May Allah be pleased with him) reported the Prophet (ﷺ) used to repeat his words thrice so that the meaning thereof would be fully understood, and whenever he came upon a gathering of people, he would greet them. He would repeat Salam thrice.[Al- Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أنس رضي الله عنه أن النبي صلى الله عليه وسلم، كان إذا تكلم بكلمة أعادها ثلاثًا حتى تفهم عنه، وإذا أتى على قوم فسلم عليهم سلم عليهم ثلاثًا‏.‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏\nوهذا محمول على ما إذا كان الجمع كثيرًا‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 852
    },
    {
      "hadithNumber": 853,
      "english": {
        "narrated": "Al-Miqdad (May Allah be pleased with him) reported in a long Hadith:",
        "hadith": "We used to reserve for the Prophet (ﷺ) his share of the milk, and he would come at night and offer greetings in such a manner as did not disturb those asleep and was heard only by those who were awake. In fact, the Prophet (ﷺ) came and offered greetings as usual.[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن المقداد رضي الله عنه في حديثه الطويل قال‏:‏ كنا نرفع للنبي صلى الله عليه وسلم نصيبه من اللبن، فيجيء من الليل، فيسلم تسليمًا لا يوقظ نائمًا، ويسمع اليقظان، فجاء النبي صلى الله عليه وسلم فسلم كما كان يُسلم‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 853
    },
    {
      "hadithNumber": 854,
      "english": {
        "narrated": "Asma' bint Yazid (May Allah be pleased with her) reported:",
        "hadith": "The Messenger of Allah (ﷺ) passed through the mosque one day and there was a group of women (about ten of them) sitting in the mosque. He raised his hand to offer greetings.[At- Tirmidhi, who classified it as Hasan].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أسماء بنت يزيد رضي الله عنه عنها أن رسول الله صلى الله عليه وسلم، مر في المسجد يومًا، وعصبة من النساء قعود، فألوى بيده بالتسليم‏.‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن‏)‏‏)‏‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 854
    },
    {
      "hadithNumber": 855,
      "english": {
        "narrated": "Narrated Abu Umamah:",
        "hadith": "The Prophet (ﷺ) said: Those who are nearest to Allah are they who are first to give a salutation.\n\n[Abu Dawud] And At- Tirmidhi narrated its meaning and classified it as Hasan.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إن أولى الناس بالله من بدأهم بالسلام‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 855
    },
    {
      "hadithNumber": 856,
      "english": {
        "narrated": "Abu Juraiy Al-Hujaimi (May Allah be pleased with him) reported:",
        "hadith": "I saw the Messenger of Allah (ﷺ) and said: \"Alaikas-Salamu ya Rasulallah! (Upon you be peace, O Messenger of Allah)!\" He said, \"Do not say: 'Alaikas-Salamu (Upon you be peace).' This is the Salam to the dead.\"[Abu Dawud and At-Tirmidhi, who classified the hadith as Hasan Sahih].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا تقل عليك السلام؛ فإن عليك السلام تحية الموتى‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 856
    },
    {
      "hadithNumber": 857,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, 'A rider should greet a pedestrian; a pedestrian should greet one who is sitting; and a small group should greet a large group (of people).''\n\n[Al-Bukhari and Muslim].\n\nThe narration in Al-Bukhari adds: The Messenger of Allah (ﷺ) said, \"The young should greet the elderly.''",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏يسلم الراكب على الماشي، والماشي على القاعد، والقليل على الكثير” ‏(‏‏(‏متفق عليه‏)‏‏)‏  \nوفي رواية للبخاري‏:‏ ‏\"‏والصغير على الكبير‏\"‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 857
    },
    {
      "hadithNumber": 858,
      "english": {
        "narrated": "Abu Umamah Sudaiy bin `Ajlan Al-Bahili (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"The person nearest to Allah is one who is the first to offer greeting.\"\n\n[Abu Dawud, with a sound chain].\n\nThe narration in At-Tirmidhi is: The Messenger of Allah (ﷺ) was asked: \"O Messenger of Allah! When two persons meet, who should greet the other first?'' The Messenger of Allah (ﷺ) said, \"The person nearest to Allah (i.e., one who is more obedient and therefore closer to Allah will say: As-Salam first).\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي أمامة صُدي بن عجلان الباهلي رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ “إن أولى الناس بالله من بدأهم بالسلام‏\"‏ ‏(‏‏(‏رواه أبو داود بإسناد جيد‏)‏‏)‏‏.‏ \nورواه الترمذي عن أبي أمامة رضي الله عنه‏:‏ قيل‏:‏ يا رسول الله، الرجلان يلتقيان، أيهما يبدأ بالسلام‏؟‏ قال‏:‏ ‏\"‏أولاهما بالله تعالى‏\"‏ قال الترمذي ‏:‏ حديث حسن‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 858
    },
    {
      "hadithNumber": 859,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him)reported in the Hadith concerning the person who was at fault in performing his Salat (prayer):",
        "hadith": "He came to the Prophet (ﷺ) and greeted him. The Prophet (ﷺ) responded to the greeting and said, \"Go back and repeat your Salat because you have not performed the Salat (properly).'' He again performed Salat as he had prayed before and came to the Prophet (ﷺ) and greeted him. The Prophet (ﷺ) responded to the greetings (and repeated his words to him). This act of repeating (the Salat and the Salam) was done thrice.\n\n[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ارجع فصلِ، فإنك لم تصلِ‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 859
    },
    {
      "hadithNumber": 860,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"When one of you meets a brother (in Faith) he should greet him. Then if a tree or a wall or a stone intervenes between them and then he meets him again, he should greet him.\"[Abu Dawud].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إذا لقي أحدكم أخاه، فليسلم عليه، فإن حالت بينهما شجرة، أو جدار، أو حجر، ثم لقيه، فليسلم عليه‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 860
    },
    {
      "hadithNumber": 861,
      "english": {
        "narrated": "Anas bin Malik (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said to me, \"Dear son, when you enter your house, say As- Salamu 'Alaikum to your family, for it will be a blessing both to you and to your family.\"[At-Tirmidhi, who classified it as Hasan Sahih].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏يا بُني، إذا دخلت على أهلك، فسلم، يكن بركة عليك، وعلى أهل بيتك‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 861
    },
    {
      "hadithNumber": 862,
      "english": {
        "narrated": "Anas (May Allah be pleased with him) reported that he passed by some children and greeted them. Then he said:",
        "hadith": "\"Messenger of Allah (ﷺ) used to do the same.\"\n\n[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن أنس رضي الله عنه أنه مر على صبيان، فسلم عليهم، وقال‏:‏ كان رسول الله صلى الله عليه وسلم يفعله” ‏(‏‏(‏متفق عليه‏)‏‏)‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 862
    },
    {
      "hadithNumber": 863,
      "english": {
        "narrated": "Sahl bin Sa`d (May Allah be pleased with him) reported:",
        "hadith": "There was a woman (in another narration; an old woman) among us who would put beet root in a pot and add to it some ground barley. She used to cook them together. On returning from the Friday prayer, we would greet her and she would offer it to us.\n\n[Al-Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن سهل بن سعد رضي الله عنه قال‏:‏ كانت فينا امرأة -وفي رواية‏:‏ كانت لنا عجوز- تأخذ من أصول السلق فتطرحه في القدر، وتكركر حبات من شعير، فإذا صلينا الجمعة، وانصرفنا، نُسلم عليها، فتقدمه إلينا‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 863
    },
    {
      "hadithNumber": 864,
      "english": {
        "narrated": "Umm Hani (May Allah be pleased with her), the daughter of Abu Talib reported:",
        "hadith": "I went to the Prophet (ﷺ) on the day of the conquest of Makkah. He was taking a bath and Fatimah was screening him with a cloth. I greeted him. And she mentioned the rest of the Hadith.\n\n[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أم هانئ فاختة بنت أبي طالب رضي الله عنه قالت‏:‏ أتيت النبي صلى الله عليه وسلم يوم الفتح وهو يغتسل، وفاطمة تستره بثوب، فسلمت، وذكرت الحديث” ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 864
    },
    {
      "hadithNumber": 865,
      "english": {
        "narrated": "Asma bint Yazid (May Allah be pleased with her) reported:",
        "hadith": "The Prophet (ﷺ) passed by us when we were with a party of women, and he greeted us with salam.[Abu Dawud and At-Tirmidhi who classified it as Hasan]. This is the wording of Abu Dawud.\n\nIn  At-Tirmidhi: that the Messenger of Allah (ﷺ) passed through the Masjid one day, and a group of women were sitting, so he motioned his hand with the salam.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أسماء بنت يزيد رضي الله عنه قالت‏:‏ مر علينا النبي صلى الله عليه وسلم في نسوة فسلم علينا‏.‏ \n‏(‏‏(‏رواه أبو داود، والترمذي وقال‏:‏ حديث حسن، وهذا لفظ أبي داود))\nولفظ الترمذي‏:‏ أن رسول الله صلى الله عليه وسلم مر في المسجد يومًا، وعصبة من النساء قعود، فألوى بيده بالتسليم‏‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 865
    },
    {
      "hadithNumber": 866,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Do not greet the Jews and the Christians before they greet you; and when you meet any one of them on the road, force him to go to the narrowest part of it.\"\n\n[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لا تبدءوا اليهود ولا النصارى بالسلام، فإذا لقيتم أحدهم في طريق فاضطروه إلى أضيقه‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 866
    },
    {
      "hadithNumber": 867,
      "english": {
        "narrated": "Anas (May Allah be pleased with him) reported:",
        "hadith": "Messenger of Allah (ﷺ) said, \"When the people of the Book greet you, respond with: 'Wa 'alaikum' (And upon you)\".[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أنس رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\"‏إذا سلم عليكم أهل الكتاب فقولوا‏:‏ وعليكم” ‏(‏‏(‏متفق عليه‏)‏‏)‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 867
    },
    {
      "hadithNumber": 868,
      "english": {
        "narrated": "Usamah bin Zaid (May Allah be pleased with him) reported:",
        "hadith": "The Prophet (ﷺ) passed by a mixed company of people which included Muslims, polytheists and Jews, and he gave them the greeting (i.e., saying As- Salamu 'Alaikum).[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أسامة رضي الله عنه أن النبي صلى الله عليه وسلم مر على مجلس فيه أخلاط من المسلمين والمشركين -عبدة الأوثان واليهود- فسلم عليهم النبي صلى الله عليه وسلم‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 868
    },
    {
      "hadithNumber": 869,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"When one of you arrives in a gathering, he should offer Salam to those who are already there, and he should also do so when he intends to depart. The first act of greeting is not more meritorious than the last.''\n\n[Abu Dawud and At-Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\"‏إذا انتهى أحدكم إلى المجلس فليسلم، فإذا أراد أن يقوم فليسلم، فليست الأولى بأحق من الآخرة‏\"‏ ‏(‏‏(‏رواه أبو داود، والترمذي وقال‏:‏ حديث حسن‏\"‏‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 869
    },
    {
      "hadithNumber": 870,
      "english": {
        "narrated": "Abu Musa Al-Ash'ari (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Permission is to be sought thrice. If permission is granted, you may enter; otherwise, go back.\"[Al- Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي موسي الأشعري رضي الله عنه قال‏:‏ قال رسول الله صلى  الله عليه وسلم ‏:‏ “ الاستئذان ثلاث، فإن أذن لك وإلا فارجع‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 870
    },
    {
      "hadithNumber": 871,
      "english": {
        "narrated": "Sahl bin Sa'd (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Seeking permission to enter (somebody's house) has been prescribed in order to restrain the eyes (from looking at something we are not supposed to look at).\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إنما جعل الاستئذان من أجل البصر‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 871
    },
    {
      "hadithNumber": 872,
      "english": {
        "narrated": "Rib'i bin Hirash (May Allah be pleased with him) reported:",
        "hadith": "A man of Banu 'Amir tribe has told us that he had asked the Prophet (ﷺ) for permission to enter when he was at home. He said: \"May I enter?\" the Messenger of Allah (ﷺ) said to the servant, \"Go out and instruct him about the manner of seeking permission. Tell him to say: As-Salamu 'Alaikum (may peace be upon you). May I come in?\" The man heard this and said: \"As-Salamu 'Alaikum (may peace be upon you). May I come in?\" The Prophet (ﷺ) then granted him permission and he entered.[Abu Dawud].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن ربعي بن حراش قال‏:‏ حدثنا رجل من بني عامر استأذن علي النبي صلى الله عليه وسلم  وهو في بيت، فقال‏:‏ أألج‏؟‏ فقال رسول الله صلى  الله عليه وسلم  لخادمه‏:‏ ‏\"‏أخرج إلي هذا وعلمه الاستئذان، فقل له‏:‏ قل‏:‏ السلام عليكم، أأدخل‏؟‏” فسمعه الرجل فقال‏:‏ السلام عليكم، أأدخل‏؟‏ فأذن له النبي صلى الله عليه وسلم ، فدخل‏.‏ ‏(‏‏(‏رواه أبو داود بإسناد صحيح‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 872
    },
    {
      "hadithNumber": 873,
      "english": {
        "narrated": "Kildah bin Al-Hanbal (May Allah be pleased with him) reported:",
        "hadith": "I visited the Prophet (ﷺ) and I entered his house without seeking permission. So he said, \"Go back and say: 'As-Salamu 'alaikum (may peace be upon you). May I come in?\"'[Abu Dawud and At- Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ارجع فقل السلام عليكم أأدخل‏؟‏‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 873
    },
    {
      "hadithNumber": 874,
      "english": {
        "narrated": "Anas (May Allah be pleased with him) reported in the course of his famous Hadith pertaining to Al-Isra' (the Ascension) that Messenger of Allah (ﷺ) said, \"Then Jibril (Gabriel) ascended along with me to the nearest heaven and requested for the gate to be opened. He was asked:",
        "hadith": "`Who is there?' He replied: `Jibril.' He was asked: `Who is with you?' He said: `Muhammad.' Then he ascended to the second heaven and requested for the opening of the gate. He was asked: `Who is there?' He said: `Jibril.' He was asked: `Who is with you?' He replied: `Muhammad.' In the same way he ascended to the third, fourth and all the heavens (i.e., until the seventh). At all of the gates he was asked: `Who is there?' He replied: Jibril.'''\n\n[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ثم صعد بي جبريل إلي السماء الدنيا فاستفتح، فقيل‏:‏ من هذا‏؟‏ قال‏:‏ جبريل، قيل‏:‏ومن معك‏؟‏ قال‏:‏ محمد‏.‏ ثم صعد إلي السماء الثانية والثالثة والرابعة وسائرهن، ويقال في باب كل سماء‏:‏ من هذا‏؟‏ فيقول‏:‏ جبريل‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 874
    },
    {
      "hadithNumber": 875,
      "english": {
        "narrated": "Abu Dharr (May Allah be pleased with him) reported:",
        "hadith": "I stepped out one night and saw the Messenger of Allah (ﷺ) walking by himself. I began to walk in the moonlit night. He turned round and saw me and asked, \"Who is there?\" I replied: \"Abu Dharr.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏من هذا‏؟‏‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 875
    },
    {
      "hadithNumber": 876,
      "english": {
        "narrated": "Umm Hani (May Allah be pleased with her) reported:",
        "hadith": "I went to the Prophet (ﷺ) who was taking a bath while Fatimah was screening him. He asked, \"Who is there?\" I replied: \"I am Umm Hani.\"[Al- Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ من هذه‏؟‏‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 876
    },
    {
      "hadithNumber": 877,
      "english": {
        "narrated": "Jabir (May Allah be pleased with him) reported:",
        "hadith": "I went to the Prophet (ﷺ) and knocked at the door (to seek permission). He asked, \"Who is there?\" I said: \"I\". He repeated, \" I, I?!\" as if he disliked it.[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن جابر رضي الله عنه قال‏:‏ أتيت النبي صلى الله عليه وسلم  فدققت الباب، فقال ‏\"‏من ذا‏؟‏‏\"‏ فقلت‏:‏ أنا، فقال‏:‏ ‏\"‏أنا أنا‏؟‏‏!‏‏\"‏ كـأنه كرهها ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 877
    },
    {
      "hadithNumber": 878,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) reported:",
        "hadith": "The Prophet (ﷺ) said, \"Allah likes sneezing and dislikes yawning. When any one of you sneezes and says `Al-hamdu lillah (praise be to Allah)', it becomes obligatory upon every Muslim who hears him to respond with `Yarhamuk-Allah (may Allah have mercy on you)'. Yawning is from the devil. When one of you feels like yawning, he should restrain it as much as possible, for the devil laughs when one of you yawns.\"\n\n[Al-Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إن الله يحب العطاس، ويكره التثاؤب، فإذا عطس أحدكم وحمد الله تعالي كان حقاً علي كل مسلم سمعه أن يقول له‏:‏يرحمك الله، وأما التثاؤب فإنما هو من الشيطان، فإذا تثاءب أحدكم فليرده ما استطاع، فإن أحدكم إذا تثاءب ضحك منه الشيطان‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 878
    },
    {
      "hadithNumber": 879,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) reported:",
        "hadith": "The Prophet (ﷺ) said, \"When one of you sneezes he should say: 'Al-hamdu lillah (praise be to Allah),' and his brother or his companion should say to him: 'Yarhamuk-Allah (may Allah have mercy on you).' When he says this he should reply: 'Yahdikum-ullah wa yuslihu balakum (may Allah guide you and render sound your state of affairs).\"'[Al- Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إذا عطس أحدكم فليقل‏:‏ الحمد لله؛ وليقل له أخوه أو أصحابه‏:‏ يرحمك الله، فإذا قال له‏:‏ يرحمك الله، فليقل‏:‏ يهديكم الله ويصلح بالكم‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 879
    },
    {
      "hadithNumber": 880,
      "english": {
        "narrated": "Abu Musa (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"When one of you sneezes and praises Allah (i.e., says Al-hamdu lillah), you should invoke Allah's Mercy upon him (i.e., say Yarhamuk-Allah); but if he does not praise Allah, you should not respond.\" [Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إذا عطس أحدكم فحمد الله فشمتوه، فإن لم يحمد الله فلا تشمتوه‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 880
    },
    {
      "hadithNumber": 881,
      "english": {
        "narrated": "Anas (May Allah be pleased with him) reported:",
        "hadith": "When two men sneezed in the presence of the Prophet (ﷺ), he responded to one with \"Yarhamuk-Allah (may Allah have mercy on you)\" and did not respond to the other. The latter said to him: \"You invoked a blessing on this man but did not do so in my case.\" The Prophet (ﷺ) replied, \"He praised Allah (i.e., he said 'Al-hamdu lillah') but you did not.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏هذا حمد الله، وإنك لم تحمد الله‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 881
    },
    {
      "hadithNumber": 882,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) reported:",
        "hadith": "Whenever the Messenger of Allah (ﷺ) sneezed, he would cover his mouth with his hand or a piece of cloth - thereby suppressing the sound.[Abu Dawud and At-Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي هريرة رضي الله عنه قال‏:‏ كان رسول الله صلى  الله عليه وسلم  إذا عطس وضع يده أو ثوبه علي فيه، وخفض -أو غض- بها صوته‏.‏ شك الراوي‏.‏ ‏(‏‏(‏رواه أبو داود، والترمذي وقال‏:‏ حديث حسن صحيح‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 882
    },
    {
      "hadithNumber": 883,
      "english": {
        "narrated": "Abu Musa (May Allah be pleased with him) reported:",
        "hadith": "The Jews used to intentionally sneeze in the presence of the Messenger of Allah (ﷺ) hoping that he would say to them: 'Yarhamukum-ullah (may Allah have mercy on you),' but he would respond with: \"Yahdikum-ullahu wa yuslihu balakum (may Allah guide you and render sound your state of affairs).\"[Abu Dawud and At- Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي موسي رضي الله عنه قال‏:‏ كان اليهود يتعاطسون عند رسول الله صلى  الله عليه وسلم  يرجون أن يقول لهم‏:‏ يرحمكم الله، فيقول‏:‏ ‏\"‏‏\"‏يهديكم الله ويصلح بالكم‏\"‏ ‏(‏‏(‏رواه أبو داود، والترمذي وقال‏:‏ حديث حسن صحيح‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 883
    },
    {
      "hadithNumber": 884,
      "english": {
        "narrated": "Abu Sa'id Al-Khudri (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"When one yawns, he should put his hand over his mouth, otherwise the devil will enter.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إذا تثاءب أحدكم فليمسك بيده علي فيه، فإن الشيطان يدخل‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 884
    },
    {
      "hadithNumber": 885,
      "english": {
        "narrated": "Abu Khattab Qatadah (May Allah be pleased with him) reported:",
        "hadith": "I asked Anas: \"Did the Companions of the Messenger of Allah (ﷺ) use to shake hands?'' He said: \"Yes.''\n\n[Al-Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن أبي الخطاب قتادة قال‏:‏ قلت لأنس‏:‏ أكانت المصافحة في أصحاب رسول الله صلى  الله عليه وسلم ‏؟‏ قال‏:‏ نعم‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 885
    },
    {
      "hadithNumber": 886,
      "english": {
        "narrated": "Anas (May Allah be pleased with him) reported:",
        "hadith": "When the people of Yemen came, the Messenger of Allah (ﷺ) said, \"The people of Yemen have visited you. They are the first to introduce the tradition of handshaking.\"[Abu Dawud].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أنس رضي الله عنه قال‏:‏ لما جاء أهل اليمن قال رسول الله صلى  الله عليه وسلم ‏:‏ “قد جاءكم أهل اليمن، وهم أول من جاء بالمصافحة‏\"‏ ‏(‏‏(‏رواه أبو داود بإسناد صحيح‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 886
    },
    {
      "hadithNumber": 887,
      "english": {
        "narrated": "Al-Bara' (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Two Muslims will not meet and shake hands without having their sins forgiven (by Allah ) before they depart.\"[Abu Dawud].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ما من مسلمين يلتقيان فيتصافحان إلا غفر لهما قبل أن يفترقا‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 887
    },
    {
      "hadithNumber": 888,
      "english": {
        "narrated": "Anas (May Allah be pleased with him) reported:",
        "hadith": "A man asked: \"O Messenger of Allah! When a man meets a brother or a friend, should he bow to him?\" He said, \"No.\" The man asked whether he should embrace and kiss him? The Messenger of Allah (ﷺ) replied, \"No.\" He asked whether he should hold his hand and shake it? The Messenger of Allah (ﷺ) replied, \"Yes.\"[At-Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أنس رضي الله عنه قال‏:‏ قال رجل‏:‏ يا رسول الله، الرجل منا يلقي أخاه أو صديقه، أينحني له قال‏:‏ ‏\"‏لا‏\"‏ قال‏:‏ أفيلتزمه ويقبله‏؟‏فال‏:‏ ‏\"‏لا‏\"‏ قال‏:‏ فيأخذ بيده ويصافحه‏؟‏ قال‏:‏‏\"‏نعم‏\"‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 888
    },
    {
      "hadithNumber": 889,
      "english": {
        "narrated": "Safwan bin 'Assal (May Allah be pleased with him) reported:",
        "hadith": "A Jew asked his companion to take him to the Prophet (ﷺ); and when they came to the Messenger of Allah (ﷺ), they asked him about the nine clear signs (given to Prophet Musa). Safwan narrated the long Hadith which concludes: They kissed the hands and feet of the Messenger of Allah (ﷺ) and said: \"We testify that you are a Prophet.\"[At-Tirmidhi]",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن صفوان بن عسال رضي الله عنه قال‏:‏ قال يهودي لصاحبه‏:‏ اذهب بنا إلي هذا النبي صلى الله عليه وسلم فأتيا رسول الله صلى  الله عليه وسلم ، فسألاه عن تسع آيات بينات؛ فذكر الحديث إلي قوله‏:‏ فقبلا يده ورجله، وقالا‏:‏ نشهد أنك نبي‏.‏ ‏(‏‏(‏رواه الترمذي وغيره بأسانيد صحيحة‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 889
    },
    {
      "hadithNumber": 890,
      "english": {
        "narrated": "In a narration of Ibn Umar (May Allah be pleased with them) at the end of the narration of the Hadith ) he said:",
        "hadith": "\"We came near the Prophet (ﷺ) and kissed his hand.\"[Abu Dawud]",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن ابن عمر، رضي الله عنهما، قصة قال فيها‏:‏ فدنونا من النبي صلى الله عليه وسلم  فقبلنا يده‏\"‏ ‏(‏‏(‏رواه أبو داود‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 890
    },
    {
      "hadithNumber": 891,
      "english": {
        "narrated": "'Aishah (May Allah be pleased with her) reported:",
        "hadith": "Zaid bin Harithah came to the Messenger of Allah (ﷺ) when he was in my house. Zaid knocked at the door. The Prophet (ﷺ) rose to receive him, trailing his garment. He embraced and kissed him.[At- Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن عائشة رضي الله عنها قالت‏:‏ قدم زيد بن حارثة المدينة ورسول الله صلى  الله عليه وسلم  في بيتي، فأتاه فقرع الباب، فقام إليه النبي صلى الله عليه وسلم  يجر ثوبه، فاعتنقه وقبله‏\"‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 891
    },
    {
      "hadithNumber": 892,
      "english": {
        "narrated": "Abu Dharr (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said to me, \"Do not belittle any good deed, even your meeting with your brother (Muslim) with a cheerful face.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا تحقرن من المعروف شيئاً، ولو أن تلقي أخاك بوجه طلق‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 892
    },
    {
      "hadithNumber": 893,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) reported:",
        "hadith": "The Prophet (ﷺ) kissed his grandson Hasan bin 'Ali in the presence of Aqra' bin Habis. Thereupon Aqra' remarked: \"I have ten children and I have never kissed any one of them.\" The Messenger of Allah (ﷺ) cast a glance upon him and said, \"He who does not show mercy to others, will not be shown mercy.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏من لا يرحم لا يرحم‏!‏‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 5,
      "bookName": "5The Book of Greetingsكتاب السلام",
      "bookReference": 893
    }
  ]
}