{
  "collectionId": "riyadussalihin",
  "bookId": 17,
  "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
  "hadithCount": 297,
  "hadiths": [
    {
      "hadithNumber": 1511,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) reported:",
        "hadith": "The Prophet (ﷺ) said, \"He who believes in Allah and the Last Day must either speak good or remain silent.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏من كان يؤمن بالله واليوم الآخر، فليقل خيرًا، أو ليصمت‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1511
    },
    {
      "hadithNumber": 1512,
      "english": {
        "narrated": "Abu Musa Al-Ash'ari (May Allah be pleased with him) reported:",
        "hadith": "I asked the Messenger of Allah (ﷺ): \"Who is the most excellent among the Muslims?\" He said, \"One from whose tongue and hands the other Muslims are secure.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏من سلم المسلمون من لسانه ويده‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1512
    },
    {
      "hadithNumber": 1513,
      "english": {
        "narrated": "Sahl bin Sa'd (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Whosoever gives me a guarantee to safeguard what is between his jaws and what is between his legs, I shall guarantee him Jannah.\"[Al-Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏من يضمن لي ما بين لحييه، وما بين رجليه أضمن له الجنة‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1513
    },
    {
      "hadithNumber": 1514,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) reported:",
        "hadith": "I heard the Prophet (ﷺ) saying, \"A person utters a word thoughtlessly (i.e., without thinking about its being good or not) and, as a result of this, he will fall down into the fire of Hell deeper than the distance between the east and the west.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي هريرة رضي الله عنه أنه سمع النبي صلى الله عليه وسلم يقول‏:‏ “إن العبد ليتكلم بالكلمة ما يتبين فيها يزل بها إلى النار أبعد مما بين المشرق والمغرب‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ ‏\n‏ومعني‏:‏ ‏ ‏يتبين‏ ‏ يتفكر أنها خير أم لا.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1514
    },
    {
      "hadithNumber": 1515,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) reported:",
        "hadith": "The Prophet (ﷺ) said, \"A man utters a word pleasing to Allah without considering it of any significance for which Allah exalts his ranks (in Jannah); another one speaks a word displeasing to Allah without considering it of any importance, and for this reason he will sink down into Hell.\"[Al-Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إن العبد ليتكلم بالكلمة من رضوان الله تعالى ما يُلقي لها بالا يرفعه الله بها درجات، وإن العبد ليتكلم بالكلمة من سخط الله تعالى لا يُلقي لها بالا يَهوي بها في جهنم‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1515
    },
    {
      "hadithNumber": 1516,
      "english": {
        "narrated": "Abu 'Abdur-Rahman Bilal bin Al-Harith Al-Muzani (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"A man speaks a good word without knowing its worth, Allah records for him His Good Pleasure till the day he will meet Him; and a man utters an evil word without realizing its importance, Allah records for him His displeasure till the day he will meet Him.\"[Imam Malik and At-Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي عبد الرحمن بلال بن الحارث المزني رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏إن الرجل ليتكلم بالكلمة من رضوان الله تعالى ما كان يظن أن تبلغ ما بلغت يكتب الله له بها رضوانه إلى يوم يلقاه، وإن الرجل ليتكلم بالكلمة من سخط الله ما كان يظن أن تبلغ ما بلغت يكتب الله له بها سخطه إلى يوم يلقاه”‏.‏ رواه مالك في الموطأ والترمذي وقال حديث حسن صحيح‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1516
    },
    {
      "hadithNumber": 1517,
      "english": {
        "narrated": "Sufyan bin 'Abdullah (May Allah be pleased with him) reported:",
        "hadith": "I asked: \"O Messenger of Allah! Tell me, of something to which I may remain steadfast.\" He (ﷺ) said, \"Say: My Rubb is Allah and then remain steadfast.\" Then I said: \"O Messenger of Allah! What do you fear most about me?\" He took hold of his own tongue and said: \"This.\"[At-Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ قل ربي الله ثم استقم‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1517
    },
    {
      "hadithNumber": 1518,
      "english": {
        "narrated": "Ibn 'Umar (May Allah be pleased with them) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Do not indulge in excessive talk except when remembering Allah. Excessive talking without the Remembrance of Allah hardens the heart; and those who are the farthest from Allah are those whose hearts are hard.\"[At-Tirmidhi]",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا تكثروا الكلام بغير ذكر الله، فإن كثرة الكلام بغير ذكر الله تعالى قسوة للقلب‏!‏ وإن أبعد الناس من الله القلب القاسي‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1518
    },
    {
      "hadithNumber": 1519,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"He whom Allah saves from the evil of that which is between his jaws and the evil of that which is between his legs will enter Jannah.\"[At-Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ومن وقاه الله شر ما بين لحييه، وشر ما بين رجليه دخل الجنة‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1519
    },
    {
      "hadithNumber": 1520,
      "english": {
        "narrated": "'Uqbah bin 'Amir (May Allah be pleased with him) said:",
        "hadith": "I asked the Messenger of Allah (ﷺ), \"How can salvation be achieved?\" He replied, \"Control your tongue, keep to your house, and weep over your sins.\"[At-Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏أمسك عليك لسانك، وليسعك بيتك، وابكِ على خطيئتك‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1520
    },
    {
      "hadithNumber": 1521,
      "english": {
        "narrated": "Abu Sa'id Al-Khudri (May Allah be pleased with him) said:",
        "hadith": "The Prophet (ﷺ) said, \"When the son of Adam gets up in the morning, all the limbs humble themselves before the tongue and say: 'Fear Allah for our sake because we are with you: (i.e., we will be rewarded or punished as a result of what you do) if you are straight, we will be straight; and if you are crooked, we will become crooked.\"'[At- Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي سعيد الخدري رضي الله عنه عن النبي صلى الله عليه وسلم قال‏:‏ “إذا أصبح ابن آدم، فإن الأعضاء كلها تكفر اللسان، تقول‏:‏ اتقِ الله فينا، فإنما نحن بك‏:‏ فإن استقمت استقمنا وإن اعوججت اعوججنا”‏.‏ ‏(‏‏(‏رواه الترمذي‏)‏‏)‏‏.‏ ‏\n'‏معني “تكفر اللسان” أي تذل وتخضع ل‏ه.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1521
    },
    {
      "hadithNumber": 1522,
      "english": {
        "narrated": "Mu'adh bin Jabal (May Allah be pleased with him) reported:",
        "hadith": "I asked the Messenger of Allah (ﷺ): \"Inform me of an act which will cause me to enter Jannah and keep me far from Hell.\" He (ﷺ) replied, \"You have asked me about a matter of great importance, but it is easy for one for whom Allah makes it easy.\" He added, \"Worship Allah, associate nothing with Him in worship, offer As-Salat (the prayer), pay the Zakat, observe Saum (fasting) during Ramadan and perform Hajj (pilgrimage) to the House of Allah, if you can afford it.\" He (ﷺ) further said, \"Shall I not guide you to the gates of goodness? Fasting is a screen (from Hell), charity extinguishes (i.e., removes) the sins as water extinguishes fire, and standing in prayers by a slave of Allah during the last third part of the night.\" Then he recited: \"Their sides forsake their beds, to invoke their Rabb in fear and hope, and they spend (in charity in Allah's Cause) out of what We have bestowed on them. No person knows what is kept hidden for them of joy as a reward for what they used to do.\" (32:16-17) Then he added, \"Shall I tell you of the root of the matter, its pillar and its highest point?\" I replied: \"Yes! Certainly, O Prophet of Allah.\" He said, \"The root of this matter (foundation) is Islam, its pillar (mainstay is) As-Salat (the prayer) and its highest point is Jihad (fighting in the Cause of Allah).\" Then he asked, \"Shall I tell you of that which holds all these things?\" I said: \"Yes, O Messenger of Allah.\" So he took hold of his tongue and said, \"Keep this in control.\" I asked: \"O Messenger of Allah! Shall we really be accounted for what we talk about?\" He replied, \"May your mother lose you! People will be thrown on their faces into the Hell on account of their tongues.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن معاذ رضي الله عنه قال‏:‏ قلت يا رسول الله‏:‏ أخبرني بعمل يدخلني الجنة، ويباعدني من النار‏؟‏ قال‏:‏ ‏\"‏لقد سألت عن عظيم، وإنه ليسير على من يسره الله تعالى عليه‏:‏ تعبد الله لا تشرك به شيئًا، وتقيم الصلاة، وتؤتي الزكاة، وتصوم رمضان وتحج البيت إن استطعت إليه سبيلا ثم قال‏:‏ ألا أدلك على أبواب الخير‏؟‏ الصوم جُنة، والصدقة تطفئ الخطيئة كما يطفئ الماء النار، وصلاة الرجل من جوف الليل” ثم تلا‏:‏ ‏{‏تتجافى جنوبهم عن المضاجع‏}‏ حتى بلغ‏:‏ ‏{‏يعملون‏}‏ ‏(‏‏(‏السجدة‏:‏ 16-17‏)‏‏)‏‏.‏ ثم قال‏:‏ ‏\"‏ألا أخبرك برأس الأمر وعموده وذِروة سنامه‏\"‏ قلت‏\"‏ بلى يا رسول الله، قال‏:‏ رأس الأمر الإسلام، وعموده الصلاة، وذِروة سنامه الجهاد” ثم قال‏:‏ “ألا أخبرك بملاك ذلك كله‏؟‏‏\"‏ قلت‏:‏ بلى يا رسول الله، فأخذ بلسانه قال‏:‏ ‏\"‏كف عليك هذا‏\"‏ قلت‏:‏ يا رسول الله وإنا لمؤاخذون بما نتكلم به‏؟‏ فقال‏:‏ ثكلتك أمك‏!‏ وهل يُكب الناس في النار على وجوههم إلا حصائد ألسنتهم‏؟‏‏\"‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن صحيح، وقد سبق شرحه في باب قبل هذا‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1522
    },
    {
      "hadithNumber": 1523,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Do you know what is backbiting?\" The Companions said: \"Allah and His Messenger know better.\" Thereupon he said, \"Backbiting is talking about your (Muslim) brother in a manner which he dislikes.\" It was said to him: \"What if my (Muslim) brother is as I say.\" He said, \"If he is actually as you say, then that is backbiting; but if that is not in him, that is slandering.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ “أتدرون ما الغيبة‏؟‏” قالوا‏:‏ الله ورسوله أعلم قال‏:‏ ‏\"‏ذكرك أخاك بما يكره‏\"‏ قيل‏:‏ أفرأيت إن كان في أخي ما أقول‏؟‏ قال‏:‏ ‏\"‏إن كان فيه ما تقول، فقد اغتبته، وإن لم يكن فيه ما تقول فقد بهته”‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1523
    },
    {
      "hadithNumber": 1524,
      "english": {
        "narrated": "Abu Bakrah (May Allah be pleased with him) said:",
        "hadith": "Delivering the sermon during the Farewell Pilgrimage on the day of Sacrifice at Mina, the Messenger of Allah (ﷺ) said, \"Verily your blood, your property and your honour are as sacred and inviolable as the sanctity of this day of yours, in this month of yours and in this town of yours. Verily! I have conveyed this message to you.\"[Al-Bukhari and Muslim]",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي بكر رضي الله عنه أن رسول الله صلى الله عليه وسلم قال في خطبته يوم النحر بمنًى في حجة الوداع‏:‏ ‏\"‏إن دماءكم، وأموالكم، وأعراضكم حرام عليكم كحرمة يومكم هذا، في شهركم هذا، في بلدكم هذا، ألا هل بلغت” ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1524
    },
    {
      "hadithNumber": 1525,
      "english": {
        "narrated": "'Aishah (May Allah be pleased with her) said:",
        "hadith": "I said to the Prophet (ﷺ): \"Such and such thing of Safiyyah (May Allah be pleased with her) is sufficient for you.\" (She means to say that she was a woman with a short stature). He said, \"You have indeed uttered a word which would pollute the sea if it were mixed in it.\" She further said: I imitated a person before him and he said, \"I do not like that I should imitate someone even (if I am paid) in return such and such.\"[Abu Dawud and At-Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن عائشة رضي الله عنها‏:‏ قالت قلت للنبي صلى الله عليه وسلم حسبك من صفية كذا وكذا‏.‏ قال بعض الرواة‏:‏ تعني قصيرة، فقال‏:‏ ‏\"‏لقد قلت كلمة لو مُزجت بماء البحر لمزجته‏!‏‏\"‏ قالت‏:‏ وحكيت له إنسانًا فقال‏:‏ “ما أحب أني حكيت إنسانًا وإن لي كذا وكذا”‏.‏ ‏(‏‏(‏رواه أبو داود والترمذي وقال حديث حسن صحيح‏.‏‏)‏‏)‏ \nومعني‏:‏ ‏\"‏مزجته‏\"‏ خالطته مخالطة يتغير بها طعمه، أو ريحه لشدة نتنها وقبحها، وهذا الحديث من أبلغ الزواجر عن الغيبة، قال الله تعالى‏:‏ ‏{‏وما ينطق عن الهوى، إن هو إلا وحي يوحى‏}‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1525
    },
    {
      "hadithNumber": 1526,
      "english": {
        "narrated": "Anas (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"During the Mi'raj (the Night of Ascension), I saw a group of people who were scratching their chests and faces with their copper nails. I asked, 'Who are these people, O Jibril?' Jibril replied: 'These are the people who ate flesh of others (by backbiting) and trampled people's honour.\"'[Abu Dawud].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أنس رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ “لما عُرج بي مررت بقوم لهم أظفار من نُحاس يخمشون وجوههم وصدورهم، فقلت‏:‏ من هؤلاء يا جبريل‏؟‏ قال‏:‏ هؤلاء الذين يأكلون لحوم الناس، ويقعون في أعراضهم‏!‏”‏.‏ ‏(‏‏(‏رواه أبو داود‏.‏‏)‏‏)‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1526
    },
    {
      "hadithNumber": 1527,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said: \"The blood, honour and property of a Muslim is inviolable for another Muslim.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏كل المسلم على المسلم حرام‏:‏ دمه وعرضه وماله‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1527
    },
    {
      "hadithNumber": 1528,
      "english": {
        "narrated": "Abud-Darda' (May Allah be pleased with him) said:",
        "hadith": "The Prophet (ﷺ) said, \"He who defends the honour of his (Muslim) brother, Allah will secure his face against the Fire on the Day of Resurrection.\"[At-Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏من رد عن عِرض أخيه، رد الله عن وجهه النار يوم القيامة‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1528
    },
    {
      "hadithNumber": 1529,
      "english": {
        "narrated": "'Itban bin Malik (May Allah be pleased with him) said in his long Hadith cited in the Chapter entitled 'Hope' reported:",
        "hadith": "When the Prophet (ﷺ) stood up to offer As-Salat (the prayer) he asked, \"Where is Malik bin Ad-Dukhshum?\" A man replied: \"He is a hypocrite. He does not love Allah and His Messenger.\" The Prophet (ﷺ) said, \"Do not say that. Do you not know that he said: La ilaha illallah (there is no true god except Allah),' seeking His Pleasure. Allah has made the fire of Hell unlawful for him who affirms that none has the right to be worshipped but Allah.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن عتبان بن مالك رضي الله عنه في حديثه الطويل المشهور الذي تقدم في باب الرجاء قال‏:‏ قام النبي صلى الله عليه وسلم يصلي فقال‏:‏ ‏\"‏أين مالك بن الدخشم‏؟‏ فقال رجل‏:‏ ذلك منافق لا يحب الله ورسوله، فقال النبي صلى الله عليه وسلم‏:‏ “لا تقل ذلك ألا تراه قد قال‏:‏ لا إله إلا الله يريد بذلك وجه الله‏!‏ وإن الله قد حرم على النار من قال لا إله إلا الله يبتغي بذلك وجه الله‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ \"وعِتبانُ\"بكسر العين عَلَى المشهور، وحُكِي ضمُّها، وبعدها تاءٌ مثناةٌ مِنْ فوق، ثُمَّ باءٌ موحدةٌ. و\"الدُّخْشُمُ\"بضم الدال وإسكان الخاءِ وضمِّ الشين المعجمتين",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1529
    },
    {
      "hadithNumber": 1530,
      "english": {
        "narrated": "Ka'b bin Malik (May Allah be pleased with him) said in his long story about his repentance:",
        "hadith": "The Prophet (ﷺ) was sitting among the people in Tabuk. He (ﷺ) said, \"What happened to Ka'b bin Malik?\" A person from the tribe of Banu Salamah said: \"O Messenger of Allah! the embellishment of his cloak and an appreciation of his sides have allured him, and he was thus detained.\" Mu'adh bin Jabal (May Allah be pleased with him) said: \"Woe be upon you! You have passed indecent remarks. O Messenger of Allah! by Allah, we know nothing about him but good.\" The Messenger of Allah (ﷺ) remained silent.[Al- Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن كعب بن مالك رضي الله عنه في حديثه الطويل في قصة توبته وقد سبق في بابه التوبة‏.‏ قال‏:‏ قال النبي صلى الله عليه وسلم وهو جالس في القوم بتبوك‏:‏ ‏\"‏ما فعل كعب مالك‏؟‏ فقال رجل من بني سلمة‏:‏ يا رسول الله حبسه برداه، والنظر في عطفيه فقال معاذ بن جبل رضي الله عنه بئس ما قلت والله يا رسول الله ما علمنا عليه إلا خيرًا، فسكت رسول الله صلى الله عليه وسلم‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ \"عِطْفَاهُ\"جانِباهُ، وهو إشارةٌ إلى إعجابِهِ بنفسهِ.",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1530
    },
    {
      "hadithNumber": 1531,
      "english": {
        "narrated": "'Aishah (May Allah be pleased with her) said:",
        "hadith": "A man sought permission for audience with the Prophet (ﷺ). He said, \"Give him permission but he is a bad member of his tribe.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن عائشة رضي الله عنها أن رجلا استأذن على النبي صلى الله عليه وسلم فقال‏:‏ “ائذنوا له، بئس أخو العشيرة‏؟‏ ‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ \nاحتج به البخاري في جواز غيبة أهل الفساد وأهل الريب‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1531
    },
    {
      "hadithNumber": 1532,
      "english": {
        "narrated": "'Aishah (May Allah be pleased with her) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"I do not think that so-and-so understands anything of our Faith.\"[Al-Bukhari]Al-Bukhari said: Al- Laith bin Sa'd, who is one of the narrators of this Hadith, said: The two men mentioned by the Prophet (ﷺ) in this Hadith were hypocrites (i.e., they revealed Faith and concealed disbelief).",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ما أظن فلانًا وفلانًا يعرفان من ديننا شيئًا‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1532
    },
    {
      "hadithNumber": 1533,
      "english": {
        "narrated": "Fatimah bint Qais (May Allah be pleased with her) said:",
        "hadith": "I came to the Prophet (ﷺ) and said to him: \"Muawiyah and Abul-Jahm sent me a proposal of marriage.\" The Messenger of Allah (ﷺ) said, \"Muawiyah is destitute and he has no property, and Abul-Jahm is very hard on women.\"[Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن فاطمة بنت قيس رضي الله عنها قالت‏:‏ أتيت النبي صلى الله عليه وسلم، فقلت‏:‏ إن أبا الجهم ومعاوية خطباني‏؟‏ فقال رسول الله صلى الله عليه وسلم‏:‏‏\"‏أما معاوية، فصعلوك لا مال له ، وأما أبوالجهم، فلا يضع العصا عن عاتقه‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏ \nوفي رواية لمسلم ‏:‏ ‏\"‏وأما أبو الجهم فضراب للنساء‏\"‏ وهو تفسير لرواية‏:‏ ‏\"‏ لا يضع العصا عن عاتقه‏\"‏ وقيل‏:‏ معناه‏:‏ كثير الأسفار‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1533
    },
    {
      "hadithNumber": 1534,
      "english": {
        "narrated": "Zaid bin Al-Arqam (May Allah be pleased with him) said:",
        "hadith": "We set out on a journey along with the Messenger of Allah (ﷺ) and we faced many hardships. 'Abdullah bin Ubaiy (the chief of the hypocrites at Al- Madinah) said to his friends: \"Do not spend on those who are with the Messenger of Allah (ﷺ) until they desert him.\" He also said: \"If we return to Al-Madinah, the more honourable (meaning himself, i.e., Abdullah bin Ubaiy) will drive out therefrom the meaner (meaning Messenger of Allah (ﷺ)).\" I went to the Messenger of Allah (ﷺ) and informed him about that and he sent someone to 'Abdullah bin Ubaiy. He asked him whether he had said that or not. Abdullah took an oath that he had not done anything of that sort and said that it was Zaid who carried a false tale to the Messenger of Allah (ﷺ). Zaid said: I was so much perturbed because of this until this Verse was revealed verifying my statement:\"When the hypocrites come to you (O Muhammad (ﷺ)), they say: 'We bear witness that you are indeed the Messenger of Allah.' Allah knows that you are indeed His Messenger, and Allah bears witness that the hypocrites are liars indeed.\" (63:1) Then the Messenger of Allah (ﷺ) called the hypocrites in order to seek forgiveness for them from Allah, but they turned away their heads.[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن زيد بن أرقم رضي الله عنه قال‏:‏ خرجنا مع رسول الله صلى الله عليه وسلم في سفر أصاب الناس فيه شدة، فقال عبد الله بن أبي‏:‏ لا تنفقوا على من عند رسول الله حتى ينفضوا وقال‏:‏ لئن رجعنا إلى المدينة ليخرجن الأعز منها الأذل فأتيت رسول الله صلى الله عليه وسلم، فأخبرته بذلك، فأرسل إلى عبد الله بن أبي ، فاجتهد يمينه‏:‏ ما فعل، فقالوا‏:‏ كذب زيد رسول الله صلى الله عليه وسلم فوقع في نفسي مما قالوا شدة حتى أنزل الله تعالى تصديقي ‏{‏إذا جاءك المنافقون‏}‏ ثم دعاهم النبي صلى الله عليه وسلم، ليستغفر لهم فلووا رءوسهم‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1534
    },
    {
      "hadithNumber": 1535,
      "english": {
        "narrated": "'Aishah (May Allah be pleased with her) said:",
        "hadith": "Hind, the wife of Abu Sufyan, said to the Prophet (ﷺ): Abu Sufyan is a niggardly man and does not give me and my children adequate provisions for maintenance unless I take something from his possession without his knowledge. The Prophet (ﷺ) said to her, \"Take from his possessions on a reasonable basis that much which may suffice for you and your children.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏خذي ما يكفيك وولدك بالمعروف‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1535
    },
    {
      "hadithNumber": 1536,
      "english": {
        "narrated": "Hudhaifah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"The person who goes about with calumnies will never enter Jannah.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا يدخل الجنة نمام‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1536
    },
    {
      "hadithNumber": 1537,
      "english": {
        "narrated": "Ibn 'Abbas (May Allah be pleased with them) said:",
        "hadith": "The Messenger of Allah (ﷺ) passed by two graves and said, \"Both of them (the persons in these graves) are being tortured, and they are not being tortured for a cardinal sin. But indeed they are great sins. One of them used not to save himself from being soiled with his urine, and the other one used to go about with calumnies (among the people to rouse hostilities, e.g., one goes to a person and tells him that so-and-so says about him such and such evil things).\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏وما يعذبان في كبير‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1537
    },
    {
      "hadithNumber": 1538,
      "english": {
        "narrated": "Ibn Mas'ud (May Allah be pleased with him) said:",
        "hadith": "The Prophet (ﷺ) said, \"Shall I tell you what 'Al-'Adhu' (falsehood and slandering) is? It is calumny which is committed among the people.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن ابن مسعود رضي الله عنه أن النبي صلى الله عليه وسلم قال‏:‏ “ ألا أنبئكم ما العِضَه‏؟‏ هي النميمة، القالة بين الناس‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ العضه: بفتح العين المهملة، وإسكان الضاد المعجمة، وبالهاء على وزن الوجه، وروي: العضة بكسر العين وفتح الضاد المعجمة على وزن العدة، وهي: الكذب والبهتان، وعلى الرواية الأولى: العضه مصدر، يقال: عضهه عضها، أي: رماه بالعضه .",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1538
    },
    {
      "hadithNumber": 1539,
      "english": {
        "narrated": "Ibn Mas'ud (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"None of my Companions should convey to me anything regarding another because I desire to meet everyone of you with a clean heart.\"[Abu Dawud and At- Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن ابن مسعود رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ “لا يُبلغني أحد من أصحابي عن أحد شيءا، فإني أحب أن أخرج إلىكم وأنا سليم الصدر‏\"‏‏.‏ ‏(‏‏(‏رواه أبوداود والترمذي‏)‏‏)‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1539
    },
    {
      "hadithNumber": 1540,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"People are like ores. Those who were excellent in the Days of Ignorance are excellent in Islam provided they acquire the knowledge and understanding of the religion. You will find the best people in it (Islam) those who had a deep hatred (for leadership). You will find the worst among the people a double-faced person who appears to some people with one face and to others with another face.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ “تجدون الناس معادن‏:‏ خيارهم في الجاهلية خيارهم في الإسلام إذا فقهوا، وتجدون خيار الناس في هذا الشأن أشدهم له كراهية، وتجدون شر الناس ذا الوجهين، الذي يأتي هؤلاء بوجه، وهؤلاء بوجه‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1540
    },
    {
      "hadithNumber": 1541,
      "english": {
        "narrated": "Muhammad bin Zaid reported:",
        "hadith": "Some people said to my grandfather, 'Abdullah bin 'Umar (May Allah be pleased with them): We visit our rulers and tell them things contrary to what we say when we leave them. 'Abdullah bin 'Umar (May Allah be pleased with them) replied: \"In the days of the Messenger of Allah (ﷺ), we counted this act as an act of hypocrisy.\"[Al-Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن محمد بن زيد أن ناسًا قالوا لجده عبد الله بن عمر رضي الله عنهما‏:‏ إنا ندخل على سلاطيننا فنقول لهم بخلاف ما نتكلم إذا خرجنا من عندهم‏.‏ قال‏:‏ كنا نعد هذا نفاقًا على عهد رسول الله صلى الله عليه وسلم ‏.‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1541
    },
    {
      "hadithNumber": 1542,
      "english": {
        "narrated": "Ibn Mas'ud (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Truth leads to piety and piety leads to Jannah. A man persists in speaking the truth till he is recorded with Allah as a truthful man. Falsehood leads to transgression and transgression leads to the Hell-fire. A man continues to speak falsehood till he is recorded with Allah as a great liar.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إن الصدق يهدي إلى البر، وإن البر يهدي إلى الجنة، وإن الرجل ليصدق حتى يكتب عند الله صديقًا، وإن الكذب يهدي إلى الفجور، وإن الفجور يهدي إلى النار، وإن الرجل ليكذب حتى يكتب عند الله كذابًا‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1542
    },
    {
      "hadithNumber": 1543,
      "english": {
        "narrated": "'Abdullah bin 'Amr bin Al-'As (May Allah be pleased with them) said:",
        "hadith": "The Prophet (ﷺ) said, \"Whosoever possesses these four characteristics, is a sheer hypocrite; and anyone who possesses one of them, possesses a characteristic of hypocrisy till he gives it up. (These are:) When he is entrusted with something, he proves dishonest; when he talks, he tells a lie; when he makes a covenant, he acts treacherously; and when he quarrels, he utters foul language.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏أربع من كن فيه كان منافقًا خالصًا، ومن كانت فيه خصلة منهن كانت فيه خصلة من نفاق حتى يدعها‏:‏ إذا أؤتمن خان، وإذا حدث كذب، وإذا عاهد غدر، وإذا خاصم فجر‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1543
    },
    {
      "hadithNumber": 1544,
      "english": {
        "narrated": "Ibn 'Abbas (May Allah be pleased with them) said:",
        "hadith": "The Prophet (ﷺ) said, \"He who narrates a dream which he has not seen will be put to trouble to join into a knot two barley seeds which he will not be able to do; and he who seeks to listen to the talk of a people (secretly) will have molten lead poured into his ears on the Day of Resurrection; and he who makes a picture (of people or other creatures with a soul, such as animals and insects) will be (severely punished), and he will be asked to infuse spirit therein, which he will not be able to do.\"[Al-Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ من تحلم بحلم لم يره، كُلف أن يعقد بين شعيرتين ولن يفعل، ومن استمع إلى حديث قوم وهم له كارهون، صب في أذنيه الآنُك يوم القيامة، ومن صور صورة، عذب وكلف أن ينفخ فيها الروح وليس بنافخ‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1544
    },
    {
      "hadithNumber": 1545,
      "english": {
        "narrated": "Ibn 'Umar (May Allah be pleased with them) reported:",
        "hadith": "The Prophet (ﷺ) as saying: \"The worst of lies is to pretend to have seen something which he has not seen.\"[Al- Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏أفرى الفرى أن يري الرجل عينيه ما لم تريا‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1545
    },
    {
      "hadithNumber": 1546,
      "english": {
        "narrated": "Sumurah bin Jundub (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) very often used to ask his Companions, \"Do any one of you has seen a dream?\" So dreams would be narrated to him by those whom Allah willed to relate. One day he (ﷺ) said, \"Last night I had a vision in which two men (angels) came to me and woke me up and said to me, 'Proceed!' I set out with them and we came across a man lying down, and behold, another man was standing over his head, holding a big rock. Behold, he was throwing the rock at the man's head, smashing it. When he struck him, the stone rolled away and he went after it to get it, and no sooner had he returned to this man, his head was healed and restored to its former condition. The thrower (of the rock) then did the same as he had done before. I said to my two companions, 'Subhan-Allah! Who are these?' They said: 'Proceed, proceed.' So we proceeded and came to a man lying in a prone position and another man standing over his head with an iron hook, and behold, he would put the hook in one side of the man's mouth and tear off that side of his face to the back (of the neck), and similarly tear his nose from front to back, and his eyes from front to back. Then he turned to the other side of the man's face and did just as he has done with the first side. He had hardly completed that (second) side when the first returned to its normal state. I said to my two companions, 'Subhan-Allah! Who are these?' They said, 'Proceed, proceed.' So we proceeded and came across something like a Tannur (a kind of baking oven, a pit usually clay-lined for baking bread).\" I (the narrator) think the Prophet (ﷺ) said, \"In that oven there was much noise and voices.\" The Prophet (ﷺ) added, \"We looked into it and found naked men and women, and behold, a flame of fire was reaching to them from underneath, and when it reached them they cried loudly. I asked, 'Who are these?' They said to me, 'Proceed, proceed.' And so we proceeded and came across a river.\" I (the narrator) think he said, \"-- red like blood.\" The Prophet (ﷺ) added, \"And behold, in the river there was a man swimming, and on the bank there was a man who had collected many stones. Behold, while the other man was swimming, he went near him. The former opened his mouth and the latter (on the bank) threw a stone into his mouth whereupon he went swimming again. Then again he (the former) returned to him (the latter), and every time the former returned, he opened his mouth, and the latter threw a stone into his mouth, (and so on) the performance was repeated. I asked my two companions, 'Who are these?' They replied, 'Proceed, proceed.' And we proceeded till we came to a man with a repulsive appearance, the most repulsive appearance you ever saw a man having! Beside him there was a fire, and he was kindling it and running around it. I asked my two companions, 'Who is this (man).' They said to me, 'Proceed, proceed!' So we proceeded till we reached a garden of deep green dense vegetation, having all sorts of spring colours. In the midst of the garden there was a very tall man, and I could hardly see his head because of his great height, and around him there were children in such a large number as I have never seen! I said to my two companions, 'Who is this?' They replied, 'Proceed, proceed.' So we proceeded till we came to a majestic, huge garden, greater and better than any garden I have ever seen! My two companions said to me, 'Ascend up' and I ascended up.\" The Prophet (ﷺ) added, \"So we ascended till we reached a city built of gold and silver bricks, and we went to its gate and asked (the gatekeeper) to open the gate, and it was opened; and we entered the city and found in it men with one side of their bodies as handsome as the most handsome person you have ever seen, and the other side as ugly as the ugliest person you have ever seen! My two companions ordered those men to throw themselves into the river. Behold, there was a river flowing across (the city), and its water was like milk in whiteness. Those men went and threw themselves in it and then returned to us after the ugliness (of their bodies) had disappeared, and they came in the best shape.\" The Prophet (ﷺ) further added, \"My two companions said to me: 'This place is the 'Adn Jannah, and that is your place.' I raised up my sight, and behold, there I saw a palace like a white cloud! My two companions said to me, 'That palace is your place,' I said to them, 'May Allah bless you both! Let me enter it.' They replied, 'As for now, you will not enter it, but you shall enter it (one day).' I said to them, 'I have seen many wonders tonight. What does all that mean which I have seen?' They replied, 'We will inform you: As for the first man you came upon, whose head was being smashed with the rock, he is the symbol of the one who studies the Qur'an and then neither recites it nor acts on its orders, and sleeps, neglecting the enjoined prayers. As for the man you came upon, whose sides of mouth, nostrils and eyes were torn off from front to back, he is the symbol of the man who goes out of his house in the morning and tells lies that are spread all over the world. And those naked men and women whom you saw in a construction resembling an oven, they are the adulterers and the adulteresses. And the man who was given a stone to swallow is the eater of Ar-Riba (usury), and the bad-looking man whom you saw near the fire, kindling it and going around it, is Malik, the gatekeeper of Hell, and the tall man you saw in the garden is (Prophet) Abraham, and the children around him are those who died upon Al-Fitrah (the Islamic Faith of Monotheism).\"' The narrator added: Some Muslims asked the Prophet (ﷺ) , \"O Messenger of Allah! What about the children of Al- Mushrikun (i.e., polytheists, pagans, idolaters, and disbelievers in the Oneness of Allah and in His Messenger Muhammad (ﷺ))?\" The Prophet (ﷺ) replied, \"And also the children of Al-Mushrikun.\" The Prophet (ﷺ) added: \"My two companions added, 'The men you saw half handsome and half ugly were these people who had mixed an act that was good with another that was bad, but Allah forgave them'.\"Another narration of Al-Bukhari is: The Messenger of Allah (ﷺ) said, \"One night two men came to me and took me to a blessed land.\" (The Messenger of Allah (ﷺ) told of the same incident as above) and said, \"After a while of walking we came upon a pit like an oven, narrow at the top and wide at the bottom with fire raging in it. When the flames rose up (the people in it) also rose up till they were about to come out; and when the fire subsided they, too, would go down with it. In it were naked men and women.\" (The remainder of the Hadith is the same as the above Hadith except that at the end of it, the Messenger of Allah said: \"We came upon a river of blood in the middle of which there was a man standing, and at the bank of the river there was a man with plenty of stones before him...\" In this narration we also find: \"They made me climb the tree and they made me enter an abode so beautiful the like of which I have never seen before. There (I saw) old men and youth.\" In this narration we also find: \"'The first house you entered was the abode of the believers in general, and the other house was the abode of the martyrs. I am Jibril (Gabriel), and this is Mika'il. Raise your head.' I looked up and saw something like clouds. They said to me, 'That is your abode.' I said, 'Shall I enter it?' They said, 'You have not completed your term of life yet. When you do, you will certainly enter it.\"'[Al-Bukhari]",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن سمرة بن جندب رضي الله عنه قال‏:‏ كان رسول الله صلى الله عليه وسلم مما يكثر أن يقول لأصحابه‏:‏‏(‏‏(‏هل رأى أحد منكم رؤيا‏؟‏‏)‏‏)‏ فيقص عليه من شاء الله أن يقص، وإنه قال لنا ذات غداة‏:‏‏(‏‏(‏إنه أتاني الليلة آتيان، وإنهما قالا لي‏:‏ انطلق، وإني انطلقت معهما، وإنا أتينا على رجل مضطجع، وإذا آخر قائم عليه بصخرة، وإذا هو يهوي بالصخرة لرأسه، فيثلغ رأسه، فيتدهده الحجر ها هنا، فيتبع الحجر فليأخذه، فلا يرجع  إليه حتى يصح رأسه كما كان، ثم يعود عليه، فيفعل به مثل ما فعل المرة الأولى‏!‏‏\"‏ قال‏:‏ ‏\"‏قلت لهما‏:‏ سبحان الله‏!‏ ما هذان‏؟‏ قالا لي‏:‏ انطلق انطلق، فانطلقنا، فأتينا على رجل مستلق لقفاه، وإذا آخر قائم عليه بكلوب من حديد، وإذا هو يأتي أحد شقي وجهه فيشرشر شدقه إلى قفاه، ومنخره إلى قفاه، وعينه إلى قفاه، ثم يتحول إلى الجانب الآخر، فيفعل به مثل ما فعل بالجانب الأول، فما يفرغ من ذلك الجانب حتى يصح ذلك الجانب كما كان، ثم يعود عليه، فيفعل مثل ما فعل في المرة الأولى‏\"‏ قال‏:‏ قلت‏:‏ سبحان الله‏؟‏ ما هذان‏؟‏ قال‏:‏ قالا لي‏:‏ انطلق انطلق، فانطلقنا، فأتينا على مثل التنور‏\"‏ فأحسب أنه قال‏:‏ ‏\"‏فإذا فيه‏:‏ لغط وأصوات، فاطلعنا فيه فإذا فيه رجال ونساء عراة، وإذا هم يأتيهم لهب من أسفل منهم فإذا أتاهم ذلك اللهب ضوضئوا‏.‏ قلت‏:‏ ما هؤلاء‏؟‏ قالا لي‏:‏ انطلق انطلق، فانطلقنا فأتينا على نهر‏\"‏ حسبت أنه كان يقول‏:‏ ‏\"‏أحمر مثل الدم، وإذا في النهر رجل سابح يسبح، وإذا على شط النهر رجل قد جمع عنده حجارة كثيرة، وإذا ذلك السابح يسب ما يسبح، ثم يأتي ذلك الذي قد جمع عنده الحجارة، فيفغر له فاه، فيلقمه حجرًا، فينطلق فيسبح، ثم يرجع  إليه، كلما رجع  إليه، فغر له فاه، فألقمه حجرًا، قلت لهما‏:‏ ما هذان‏؟‏ قالا لي‏:‏ انطلق انطلق، فانطلقنا، فأتينا على رجل كريه المرآة، أو كأكره ما أنت راء رجلا مرأى فإذا هو عنده نارٌ يحشها ويسعى حولها‏.‏ قلت لهما‏:‏ ما هذا‏؟‏ قال لي‏:‏ انطلق انطلق، فانطلقنا فأتينا على روضة معتمة فيها من كل نور الربيع، وإذا بين ظهري الروضة رجل طويل لا أكاد أرى رأسه طولا في السماء، وإذا حول الرجل من أكثر ولدان رأيتهم قط، قلت‏:‏ ما هذا‏!‏ وما هؤلاء‏؟‏ قالا لي‏:‏ انطلق انطلق، فانطلقنا، فأتينا إلى دوحة عظيمة لم أرَ دوحة قط أعظم منها، ولا أحسن‏!‏ قالا لي‏:‏ ارقَ لي‏:‏ ارقَ فيها، فارتقينا فيها إلى مدينة مبنية بلبن ذهب ولبن فضة، فأتينا باب المدينة فاستفتحنا، ففتح لنا، فدخلناها، فتلقانا رجال شطر من خلقهم كأحسن ما أنت راء‏!‏ وشطر منهم كأقبح ما أنت راء‏!‏ قالا لهم‏:‏ اذهبوا فقعوا في ذلك النهر، وإذا هو نهر معترض يجري كأن ماءه المحض في البياض، فذهبوا فوقعوا فيه‏.‏ ثم رجعوا إلينا قد ذهب ذلك السوء عنهم، فصاروا في أحسن صورة‏.‏ قال‏:‏ قالا لي‏:‏ هذه جنة عدن، وهذاك منزلك، فسما بصري صعدًا، فإذا قصر مثل الربابة البيضاء‏.‏ قالا لي‏:‏ هذاك منزلك‏؟‏ قلت لهما‏:‏ بارك الله فيكما، فذراني فأدخله‏.‏ قالا‏:‏ أما الآن فلا، وأنت داخله‏.‏ قلت لهما‏:‏ فإني رأيت منذ الليلة عجبًا‏؟‏ فما هذا الذي رأيت‏؟‏ قالا لي‏:‏ أما إنا سنخبرك‏:‏ أما الرجل الأول الذي أتيت عليه يثلغ رأسه بالحجر، فإنه الرجل يأخذ القرآن فيرفضه وينام عن الصلاة المكتوبة، وأما الرجل الذي أتيت عليه يشرشر شدقه إلى قفاه، ومنخره إلى قفاه، وعينه إلى قفاه، فإنه الرجل يغدو من بيته فيكذب الكذبة تبلغ الآفاق‏.‏ وأما الرجال والنساء العراة الذين هم في مثل بناء التنور، فإنهم الزناة والزواني، وأما الرجل الذي أتيت عليه يسبح في النهر، ويلقم الحجارة، فإنه آكل الربا، وأما الرجل الكرية المرآة الذي عند النار يحشها ويسعى حولها، فإنه مالك خازن جهنم، وأما الرجل الطويل الذي في الروضة، فإنه إبراهيم، وأما الولدان الذين حوله، فكل مولود مات على الفطرة‏\"‏ وفي رواية البرقاني‏:‏ ‏\"‏ولد على الفطرة‏\"‏ فقال بعض المسلمين‏:‏ يا رسول الله، وأولاد المشركين‏؟‏ فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏وأولاد المشركين، وأما القوم الذين كانوا شطر منهم حسن، وشطر منهم قبيح، فإنهم قوم خلطوا عملا صالحًا وآخر سيئًا، تجاوز الله عنهم‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏\n وفي رواية له‏:‏ ‏\"‏رأيت الليلة رجلين أتياني فأخرجاني إلى أرض مقدسة‏\"‏ ثم ذكره وقال‏:‏ ‏\"‏فانطلقنا إلى نقب مثل التنور، أعلاه ضيق وأسفله واسع؛ يتوقد تحته نارًا، فإذا ارتفعت ارتفعوا حتى كادوا أن يخرجوا، وإذا خمدت، رجعوا فيها، وفيها رجال ونساء عراة‏\"‏‏.‏ وفيها‏:‏ ‏\"‏حتى أتينا على نهر من دم‏\"‏ ولم يشك ‏\"‏فيه رجل قائم على وسط النهر، وعلى شط النهر رجل، وبين يديه حجارة، فأقبل الرجل الذي في النهر، فإذا أراد أن يخرج، رمى الرجل بحجر في فيه، فرده حيث كان، فجعل كلما جاء ليخرج جعل يرمي في فيه بحجر، فيرجع كما كان‏\"‏‏.‏ وفيها‏:‏ ‏\"‏فصعدا بي الشجرة، فأدخلاني دارًا لم أرَ قط أحسن منها، فيها رجال شيوخ وشباب‏\"‏‏.‏ وفيها‏:‏ ‏\"‏الذي رأيته يشق شدقه فكذاب، يحدث بالكذبة فتحمل عنه حتى تبلغ الآفاق، فيصنع به ما رأيت إلى يوم القيامة‏\"‏ وفيها‏:‏ ‏\"‏الذي رأيته يشدخ رأسه فرجل علمه الله القرآن، فنام عنه بالليل، ولم يعمل فيه بالنهار، فيفعل به إلى يوم القيامة، والدار الأولى التي دخلت دار عامة المؤمنين، وأما هذه الدار فدار الشهداء، وأنا جبريل، وهذا ميكائيل، فارفع رأسك، فرفعت رأسي، فإذا فوقي مثل السحاب، قالا‏:‏ ذاك منزلك، قلت‏:‏ دعاني أدخل منزلي، قالا‏:‏ إنه بقي لك عمر لم تستكمله، فلو استكملته، أتيت منزلك‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏قوله: «يثلغ رأسه» هو بالثاء المثلثة والغين المعجمة، أي: يشدخه ويشقه. قوله: «يتدهده» أي: يتدحرج. و «الكلوب» بفتح الكاف وضم اللام المشددة، وهو معروف. قوله: «فيشرشر» : أي: يقطع. قوله: «ضوضوا» وهو بضادين معجمتين: أي صاحوا. قوله: «فيفغر» هو بالفاء والغين المعجمة، أي: يفتح. قوله «المرآة» هو بفتح الميم، أي: المنظر. قوله: «يحشها» هو بفتح الياء وضم الحاء المهملة والشين المعجمة، أي: يوقدها. قوله: «روضة معتمة» هو بضم الميم وإسكان العين وفتح التاء وتشديد الميم، أي: وافية النبات طويلته. قوله: «دوحة» وهي بفتح الدال وإسكان الواو وبالحاء المهملة: وهي الشجرة الكبيرة. قوله: «المحض» هو بفتح الميم وإسكان الحاء المهملة وبالضاد المعجمة، وهو: اللبن. قوله «فسما بصري» أي: ارتفع. و «صعدا» بضم الصاد والعي، أي: مرتفعا. و «الربابة» بفتح الراء وبالباء الموحدة مكررة، وهي: السحابة",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1546
    },
    {
      "hadithNumber": 1547,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Prophet (ﷺ) said, \"It is enough for a man to prove himself a liar when he goes on narrating whatever he hears.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏كفى بالمرء كذبًا أن يحدث بكل ما سمع‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1547
    },
    {
      "hadithNumber": 1548,
      "english": {
        "narrated": "Samurah (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"He who relates from me something which he deems false is one of the liars.\"[Muslim]",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏من حدث عني بحديث يرى أنه كذب، فهو أحد الكاذبين‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1548
    },
    {
      "hadithNumber": 1549,
      "english": {
        "narrated": "Asma' (May Allah be pleased with her) reported:",
        "hadith": "A woman came to the Messenger of Allah (ﷺ) and said: \"I have a co-wife. \"Is there any harm for me if I give her the false impression of getting something from my husband which he has not in fact given me?\" The Messenger of Allah (ﷺ) said, \"The one who creates a false impression of receiving what one has not been given is like one who wears two garments of falsehood.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏المتشبع بما لم يعطَ كلابس ثوبي زور‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1549
    },
    {
      "hadithNumber": 1550,
      "english": {
        "narrated": "Abu Bakrah (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Shall I not inform you of one of the gravest of the cardinal sins?\" We said: \"Yes, O Messenger of Allah!\" He (ﷺ) said, \"To join others as partners with Allah in worship and to be undutiful to one's parents.\" The Messenger of Allah (ﷺ) sat up from his reclining position (in order to stress the importance of what he was going to say) and added, \"I warn you making a false statement and giving a false testimony. I warn you against making a false statement and giving a false testimony.\" The Messenger of Allah (ﷺ) kept on repeating this (warning) till we wished he should stop.[Al- Bukhari and Muslim]",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي بكر رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ألا أنبئكم بأكبر الكبائر‏؟‏‏\"‏ قلنا‏:‏ بلى يا رسول الله‏.‏ قال‏:‏ ‏\"‏الإشراك بالله، وعقوق الوالدين‏\"‏ وكان متكئا فجلس، فقال‏:‏ ‏\"‏ألا وقول الزور‏!‏‏\"‏ فما زال يكررها حتى قلنا‏:‏ ليته سكت‏.‏ متفق عليه‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1550
    },
    {
      "hadithNumber": 1551,
      "english": {
        "narrated": "Abu Zaid Thabit bin Ad-Dahhak Al-Ansari (May Allah be pleased with him( (he is one of those who gave their pledge of allegiance to the Messenger of Allah (ﷺ) under the Tree) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"He who swears by a religion other than that of Islam, is like what he has professed. He who kills himself with something, will be tormented with it on the Day of Resurrection. A person is not bound to fulfill a vow about something which he does not possess. Cursing a believer is like murdering him.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏من حلف على يمين بملة غير الإسلام كاذبًا متعمدًا، فهو كما قال، ومن قتل نفسه بشيء، عُذب به يوم القيامة، وليس على رجل نذر فيما لا يملكه، ولعن المؤمن كقتله‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1551
    },
    {
      "hadithNumber": 1552,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said: \"It does not befit a Siddiq (righteous Muslim) to frequently curse others.\"[Muslim]",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا ينبغي لصدِّيق أن يكون لعانًا‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1552
    },
    {
      "hadithNumber": 1553,
      "english": {
        "narrated": "Abud-Darda' (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Those who frequently resort to cursing (people) would neither be accepted as witnesses nor as intercessors on the Day of Resurrection.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا يكون اللعانون شفعاء، ولا شهداء يوم القيامة‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1553
    },
    {
      "hadithNumber": 1554,
      "english": {
        "narrated": "Samurah bin Jundub (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Do not curse one another, invoking Curse of Allah or Wrath of Allah or the fire of Hell.\"[Abu Dawud and At-Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا تلاعنوا بلعنة الله، ولا بغضبه، ولا بالنار‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1554
    },
    {
      "hadithNumber": 1555,
      "english": {
        "narrated": "Ibn Mas'ud (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"A true believer is not involved in taunting, or frequently cursing (others) or in indecency or abusing.\"[At-Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ليس المؤمن بالطعان، ولا اللعان، ولا الفاحش، ولا البذي‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1555
    },
    {
      "hadithNumber": 1556,
      "english": {
        "narrated": "Abud-Darda' (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"When a person curses somebody or something, the curse goes up to heaven and the gates of heaven get closed. Then it comes down to the earth and its gates get closed. Then it turns right and left, and if it does not find an entrance to go anywhere, it returns to the person or thing that was cursed; if he or it deserves to be cursed; otherwise it returns to the person who uttered it.\"[Abu Dawud].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إن العبد إذا لعن شيئًا، صعدت اللعنة إلى السماء، فتغلق أبواب السماء دونها، ثم تهبط إلى الأرض، فتغلق أبوابها دونها، ثم تأخذ يمينًا وشمالا، فإذا لم تجد مساغًا رجعت إلى الذي لُعن، فإن كان أهلا لذلك، وإلا رجعت إلى قائلها‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1556
    },
    {
      "hadithNumber": 1557,
      "english": {
        "narrated": "'Imran bin Husain (May Allah be pleased with him) said:",
        "hadith": "We were with the Messenger of Allah (ﷺ) on a journey and there was a woman from the Ansar riding a she-camel. She abused and invoked curse upon it. The Messenger of Allah (ﷺ) heard it and said, \"Off load the she- camel and set it free because it has been cursed.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏خذوا ما عليها ودعوها، فإنها ملعونة‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1557
    },
    {
      "hadithNumber": 1558,
      "english": {
        "narrated": "Abu Barzah Nadlah bin 'Ubaid Al-Aslami (May Allah be pleased with him) said:",
        "hadith": "A young woman was riding a she-camel on which there was the luggage of people. Suddenly she saw the Prophet (ﷺ). The pass of the mountain became narrow for her people (because of fear). The young woman said to the she-camel: \"Go ahead.\" When it did not move, she said, \"O Allah! Curse it.\" The Prophet (ﷺ) said, \"The she-camel that has been cursed should not accompany us.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا تصاحبنا ناقة عليها لعنة‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1558
    },
    {
      "hadithNumber": 1559,
      "english": {
        "narrated": "Ibn Mas'ud (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Reviling a Muslim is Fusuq (disobedience of Allah) and killing him is (tantamount to) disbelief.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏سباب المسلم فسوق، وقتاله كفر‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1559
    },
    {
      "hadithNumber": 1560,
      "english": {
        "narrated": "Abu Dharr (May Allah be pleased with him) reported:",
        "hadith": "I heard the Messenger of Allah (ﷺ) saying, \"When any Muslim accuses another Muslim of sin or of disbelief, the reproach rebounds upon the one who utters it, if the other person is not deserving of it.\"[Al- Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا يرمي رجل رجلا بالفسق أو الكفر، إلا ارتدت عليه، إن لم يكن صاحبه كذلك‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1560
    },
    {
      "hadithNumber": 1561,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"When two persons indulge in abusing each other, the beginner will be the sinner so long as the oppressed does not transgress the limits.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏المتسابان ما قالا فعلى البادي منهما حتى يعتدي المظلوم‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1561
    },
    {
      "hadithNumber": 1562,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "A drunkard was brought to the Prophet (ﷺ). He said, \"Give him a beating.\" Then some beat him with their hands, some with their shoes, and some with (a folded) piece of cloth. When he left, someone said to him: \"May Allah disgrace you!\" The Prophet (ﷺ) said, \"Do not help Satan overcome him by uttering such words.\"[Al- Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعنه قال‏:‏ أتي النبي صلى الله عليه وسلم برجل قد شرب قال‏:‏ ‏\"‏اضربوه‏\"‏ قال أبو هريرة‏:‏ فمنا الضارب بيده، والضارب بنعله، والضارب بثوبه‏.‏ فلما انصرف، قال بعض القوم‏:‏ أخزاك الله، قال‏:‏ ‏\"‏لا تقولوا هذا، لا تُعينوا عليه الشيطان‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1562
    },
    {
      "hadithNumber": 1563,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "I heard the Messenger of Allah (ﷺ) saying, \"He who accuses his slave of Zina will receive the punishment (Hadd) of slander on the Day of Resurrection, unless the accusation of Zina was true.\"[Al- Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏من قذف مملوكه بالزنا يقام عليه الحد يوم القيامة، إلا أن يكون كما قال‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1563
    },
    {
      "hadithNumber": 1564,
      "english": {
        "narrated": "'Aishah (May Allah be pleased with her) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Do not abuse the dead, because they have attained that which they had forwarded (i.e., their deeds, good or bad).\"[Al-Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا تسبوا الأموات فإنهم قد أفضوا إلى ما قدموا‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1564
    },
    {
      "hadithNumber": 1565,
      "english": {
        "narrated": "'Abdullah bin 'Amr bin Al-'As (May Allah be pleased with them) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"A (true) Muslim is one from whose tongue and hand the Muslims are safe; and a Muhajir (Emigrant) is he who leaves the deeds which Allah has prohibited.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏المسلم من سلم المسلمون من لسانه ويده، والمهاجر من هجر ما نهى الله عنه‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1565
    },
    {
      "hadithNumber": 1566,
      "english": {
        "narrated": "'Abdullah bin 'Amr bin Al-'As (May Allah be pleased with them) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"He who desires to be rescued from the fire of Hell and to enter Jannah, should die in a state of complete belief in Allah and the Last Day, and should do unto others what he wishes to be done unto him.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏من أحب أن يزحزح عن النار، ويدخل الجنة، فلتأته منيته وهو يؤمن بالله واليوم الآخر، وليأتِ إلى الناس الذي يحب أن يؤتى  إليه‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1566
    },
    {
      "hadithNumber": 1567,
      "english": {
        "narrated": "Anas bin Malik (May Allah be pleased with him) said:",
        "hadith": "The Prophet (ﷺ) said, \"Do not harbour grudge against one another, nor jealousy, nor enmity; and do not show your backs to one another; and become as fellow brothers and slaves of Allah. It is not lawful for a Muslim to avoid speaking with his brother beyond three days.\"[Al- Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا تباغضوا، ولا تحاسدوا ولا تدابروا، ولا تقاطعوا، وكونوا عباد الله إخوانًا، ولا يحل لمسلم أن يهجر أخاه فوق ثلاث‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1567
    },
    {
      "hadithNumber": 1568,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"The gates of Jannah are opened on Mondays and Thursdays, and then every slave (of Allah) is granted forgiveness if he does not associate anything with Allah in worship. But the person in whose heart there is rancour against his (Muslim) brother, they will not be pardoned and with regard to them it will be said twice: 'Hold both of them until they are reconciled with each other.\"'[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏تُفتح أبواب الجنة يوم الاثنين ويوم الخميس، فيغفر لكل عبد لا يشرك بالله شيئًا، إلا رجلا كانت بينه وبين أخيه شحناء فيقال‏:‏ أنظروا هذين حتى يصطلحا‏!‏ أنظروا هذين حتى يصطلحا‏!‏‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ وفي رواية له ‏\"‏تعرض الأعمال في كل يوم خميس واثنين‏\"‏ وذكر نحوه‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1568
    },
    {
      "hadithNumber": 1569,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Prophet (ﷺ) said, \"Beware of envy because envy consumes (destroys) the virtues just as the fire consumes the firewood,\" or he said \"grass.\"[Abu Dawud].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إياكم والحسد، فإن الحسد يأكل الحسنات كما تأكل النار الحطب، أو قال‏:‏ العشب‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1569
    },
    {
      "hadithNumber": 1570,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Beware of suspicion, for suspicion is the worst of false tales. Do not look for other's faults. Do not spy one another, and do not practise Najsh (means to offer a high price for something in order to allure another customer who is interested in the thing). Do not be jealous of one another and do not nurse enmity against one another. Do not sever ties with one another. Become the slaves of Allah, and be brothers to one another as He commanded. A Muslim is the brother of a Muslim. He should neither oppress him nor humiliate him. The piety is here! The piety is here!\" While saying so he pointed towards his chest. \"It is enough evil for a Muslim to look down upon his Muslim brother. All things of a Muslim are inviolable for his brother in Faith: his blood, his wealth and his honour. Verily, Allah does not look to your bodies nor to your faces but He looks to your hearts and your deeds.\"Another narration is: \"Do not feel envy against one another; do not nurse enmity; do not spy on one another and do not cheat one another. Be Allah's slaves, brethren to one another.\"Another narration is: \"Do not have estranged relations with one another. Do not nurse enmity and do not feel envy against one another. O Allah's worshippers! Be brothers!\"Another narration is: \"Do not estrange mutual relations and do not intervene into the transaction which is likely to be settled with another person.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏إياكم والظن، فإن الظن أكذب الحديث، ولا تحسسوا، ولا تجسسوا ولا تنافسوا، ولا تحاسدوا، ولا تباغضوا، ولا تدابروا، وكونوا عباد الله إخوانًا كما أمركم‏.‏ المسلم أخو المسلم، لا يظلمه، ولا يخذله ولا يحقره‏.‏ التقوى ههنا، ‏\"‏ ويشير إلى صدره ‏\"‏بحسب امرئ من الشر أن يحقر أخاه المسلم، كل المسلم على المسلم حرام‏:‏ دمه، وعرضه، وماله، إن الله لا ينظر إلى أجسادكم، ولا إلى صوركم، ولكن ينظر إلى قلوبكم وأعمالكم‏\"‏‏.‏ وفي رواية‏:‏ ‏\"‏لا تحاسدوا، ولا تباغضوا، ولا تجسسوا، ولا تحسسوا ولا تناجشوا وكونوا عباد الله إخوانًا‏\"‏‏.‏ \nوفي رواية‏:‏ ‏\"‏لا تقاطعوا، ولا تدابروا، ولا تباغضوا ولا تحاسدوا، وكونوا عباد الله إخوانًا‏\"‏‏.‏ وفي رواية‏:‏ ‏\"‏لا تهاجروا ولا يبع بعضكم على بيع بعض‏\"‏‏.‏\n‏(‏‏(‏رواه مسلم بكل هذه الروايات، وروى البخاري أكثرها‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1570
    },
    {
      "hadithNumber": 1571,
      "english": {
        "narrated": "Muawiyah (May Allah be pleased with him) said:",
        "hadith": "I heard the Messenger of Allah (ﷺ) saying, \"If you find faults with Muslims, you will corrupt them.\"[Abu Dawud].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إنك إن اتبعت عورات المسلمين أفسدتهم، أو كدت تفسدهم‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1571
    },
    {
      "hadithNumber": 1572,
      "english": {
        "narrated": "It has been reported that a man was brought before Abdullah bin Mas'ud (May Allah be pleased with him) because his beard was giving out smell of wine. Ibn Mas'ud said:",
        "hadith": "\"We have been prohibited from spying (on Muslims) and finding faults (with them). But we can take to task only and only if the sin is overt.[Abu Dawud].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن ابن مسعود رضي الله عنه أنه أتي برجل فقيل له، هذا فلان تقطر لحيته خمرًا، فقال‏:‏ إنَّا قد نهينا عن التجسس، ولكن إن يظهر لنا شئ، نأخذ به‏\"‏‏.‏ حديث حسن صحيح رواه أبو داود بإسناد على شرط البخاري ومسلم‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1572
    },
    {
      "hadithNumber": 1573,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Beware of suspicion, for suspicion is the worst of false tales.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إياكم والظن، فإن الظن أكذب الحديث‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1573
    },
    {
      "hadithNumber": 1574,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"It is enough evil for a Muslim to look down upon his (Muslim) brother.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏بحسب امرئ من الشر أن يحقر المسلم‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1574
    },
    {
      "hadithNumber": 1575,
      "english": {
        "narrated": "Ibn Mas'ud (May Allah be pleased with him) said:",
        "hadith": "The Prophet (ﷺ) said, \"The haughty, even with pride equal to a mustard seed in his heart, will not enter Jannah.\" A man enquired: \"What about that a person likes fine dress and fine shoes?\" He said: \"Allah is Beautiful and likes beauty. Pride amounts to disclaiming truth out of self- esteem, and despising people .\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن ابن مسعود رضي الله عنه عن النبي صلى الله عليه وسلم قال‏:‏ ‏\"‏لا يدخل الجنة من كان في قلبه مثقال ذرة من كبر‏\"‏ فقال رجل‏:‏ إن الرجل يحب أن يكون ثوبه حسنًا، ونعله حسنة، فقال‏:‏ ‏\"‏إن الله جميل يحب الجمال، الكبر بَطَر الحق، وغمط الناس‏\"‏‏.‏‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏  \nومعنى ‏\"‏بَطَر الحق‏\"‏‏:‏ دفعه، ‏\"‏وغمطهم‏\"‏‏:‏ احتقارهم، وقد سبق بيانه أوضح من هذا في باب الكبر‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1575
    },
    {
      "hadithNumber": 1576,
      "english": {
        "narrated": "Jundub bin 'Abdullah (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Once someone said: 'By Allah! Allah will not forgive such and such (a person).' Thereupon Allah, the Exalted and the Glorious, said: 'Who is he who takes an oath in My Name that I will not grant pardon to so-and-so? I have granted pardon to so-and-so and rendered your good deeds fruitless.\"'[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏قال رجل‏:‏ والله لا يغفر الله لفلان، فقال الله عز وجل‏:‏ من ذا الذي يتألى علي أن لا أغفر لفلان‏!‏ فإني قد غفرت له، وأحبطت عملك‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1576
    },
    {
      "hadithNumber": 1577,
      "english": {
        "narrated": "Wathilah bin Al-Asqa' (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Do not express pleasure at the misfortune of a (Muslim) brother lest Allah should bestow mercy upon him and make you suffer from a misfortune.\"[At- Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن واثلة بن الأسقع رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ لا تظهر الشماتة لأخيك، فيرحمه الله ويبتليك‏\"‏‏.‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن‏)‏‏)‏ \nوفي الباب حديث أبي هريرة السابق في باب التجسس‏:‏ ‏\"‏ كل المسلم على المسلم حرام‏\"‏ الحديث‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1577
    },
    {
      "hadithNumber": 1578,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Two matters are signs of disbelief on the part of those who indulge in them: Defaming and speaking evil of a person's lineage, and wailing over the dead.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ اثنتان في الناس هما بهم كفر‏:‏ الطعن في النسب، والنياحة على الميت‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1578
    },
    {
      "hadithNumber": 1579,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"He who takes up arms against us is none of us; and he who cheats us is none of us.\"[Muslim].Another narration of Muslim is: The Messenger of Allah (ﷺ) happened to pass by a heap of corn. He thrust his hand in that (heap) and his fingers felt wetness. He said to the owner of that heap of corn, \"What is this?\" He replied: \"O Messenger of Allah! These have been drenched by rainfall.\" He remarked, \"Why did you not place this (the drenched part of the heap) over the corn so that people might see it? He who deceives is not of us.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏ من حمل علينا السلاح، فليس منا، ومن غشنا، فليس منا‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ \nوفي رواية له أن رسول الله صلى الله عليه وسلم مر على صبرة طعام، فأدخل يده فيها، فنالت أصابعه بللا، فقال‏:‏ ‏\"‏ ما هذا ياصاحب الطعام‏؟‏‏\"‏ قال أصابته السماء يارسول الله، قال‏:‏ ‏\"‏ أفلا جعلته فوق الطعام حتى يراه الناس‏!‏ من غشنا فليس منا‏\"‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1579
    },
    {
      "hadithNumber": 1580,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Do not practise Najsh (to cheat).\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لا تناجشوا‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1580
    },
    {
      "hadithNumber": 1581,
      "english": {
        "narrated": "Ibn 'Umar (May Allah be pleased with them) said:",
        "hadith": "The Messenger of Allah (ﷺ) prohibited the practice of Najsh.[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن ابن عمر رضي الله عنهما، أن النبي صلى الله عليه وسلم نهى عن النَجَش، ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1581
    },
    {
      "hadithNumber": 1582,
      "english": {
        "narrated": "Ibn 'Umar (May Allah be pleased with them) said:",
        "hadith": "A man mentioned to the Messenger of Allah (ﷺ) that he was often deceived in dealings. The Messenger of Allah (ﷺ) said to him, \"When you enter into a transaction you should say: \"There should be no deception.\"'[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعنه قال‏:‏ ذكر رجل لرسول الله صلى الله عليه وسلم أنه يُخدع في البيوع فقال رسول الله صلى الله عليه وسلم‏:‏ ‏\"‏من بايعت‏؟‏ فقل ‏:‏ لا خلابة‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ ‏\"‏الخِلابة‏\"‏ بخاء معجمة مكسورة، وباء موحدة‏:‏ وهي الخديعة‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1582
    },
    {
      "hadithNumber": 1583,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"He who deceives another's wife or his slave is none of us.\"[Abu Dawud].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏من خبب زوجة امرئ، أو مملوكه، فليس منا‏\"‏‏.‏ \n‏\"‏خَبَب‏\"‏ بخاء معجمة، ثم باء موحدة مكررة‏:‏ أي‏:‏ أفسده وخدعه‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1583
    },
    {
      "hadithNumber": 1584,
      "english": {
        "narrated": "'Abdullah bin 'Amr bin Al-'As (May Allah be pleased with them) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Whosoever possesses these four characteristics is a sheer hypocrite; and anyone who possesses one of them possesses a characteristic of hypocrisy till he gives it up. These are: when he is entrusted with something, he proves dishonest; when he speaks, he tells a lie; when he makes a covenant, he proves treacherous; and when he quarrels, he behaves in very imprudent, evil, insulting manner.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ أربع من كن فيه، كان منافقًا خالصًا، ومن كانت فيه خصلة منهن، كان فيه خصلة من النفاق حتى يدعها‏:‏ إذا اؤتمن خان، وإذا حدث كذب، وإذا عاهد غدر، وإذا خاصم فجر‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1584
    },
    {
      "hadithNumber": 1585,
      "english": {
        "narrated": "Ibn Mas'ud, Ibn 'Umar and Anas (May Allah be pleased with them) said:",
        "hadith": "The Prophet (ﷺ) said, \"For every one who breaks his covenant, there will be a (huge) flag on the Day of Resurrection and it will be said: 'This flag proclaims a breach of covenant by so-and-so.\"'[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لكل غادر لواء يوم القيامة، يقال‏:‏ هذه غدرة فلان‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1585
    },
    {
      "hadithNumber": 1586,
      "english": {
        "narrated": "Abu Sa'id Al-Khudri (May Allah be pleased with him) said:",
        "hadith": "The Prophet (ﷺ) said, \"Every one who breaks a covenant will have a flag by his buttocks on the Day of Resurrection. It will be raised higher according to the nature of his breach. Behold, there will be no greater a sin with respect to breaking the covenant than that of a ruler who breaks his covenant with the Muslim masses.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لكل غادر لواء عند استه يوم القيامة يرفع له بقدر غدره، ألا لا غادر أعظم غدرًا من أمير عامة‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1586
    },
    {
      "hadithNumber": 1587,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) reported:",
        "hadith": "The Prophet (ﷺ) said, \"Allah, the Exalted, says: 'I will contend on the Day of Resurrection against three (types of) people: One who makes a covenant in My Name and then breaks it; one who sells a free man as a slave and devours his price; and one who hires a workman and having taken full work from him, does not pay him his wages.\"'[Al- Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ قال الله تعالى‏:‏ ثلاثة أنا خصمهم يوم القيامة ‏:‏ رجل أعطى بي ثم غدر، ورجل باع حرًا فأكل ثمنه، ورجل استأجر أجيرًا، فاستوفى منه، ولم يعطه أجره‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1587
    },
    {
      "hadithNumber": 1588,
      "english": {
        "narrated": "Abu Dharr (May Allah be pleased with him) said:",
        "hadith": "The Prophet (ﷺ) observed: \"There are three (types of) people to whom Allah will neither speak on the Day of Resurrection nor look at them nor purify them, and they will have a painful chastisement.\" The Messenger of Allah (ﷺ) repeated it three times. Abu Dharr (May Allah be pleased with him) remarked: \"They are ruined. Who are they, O Messenger of Allah?\" Upon this, the Messenger of Allah (ﷺ) said, \"One who lets down his lower garments (below his ankels) out of arrogance, one who boasts of his favours done to another; and who sells his goods by taking a false oath.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي ذر رضي الله عنه عن النبي صلى الله عليه وسلم قال‏:‏ ‏\"‏ ثلاثة لا يكلمهم الله يوم القيامة ولا ينظر  إليهم، ولا يزكيهم ولهم عذاب أليم‏\"‏ قال‏:‏ فقرأها رسول الله صلى الله عليه وسلم ثلاث مرار‏.‏ قال أبو ذر‏:‏ خابوا وخسروا من هم يا رسول الله‏؟‏ قال‏:‏ المسبل، والمنان، والمنفق سلعته بالحلف الكاذب‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ \nوفي رواية له ‏:‏ ‏\"‏ المسبل إزاره‏\"‏ يعني‏:‏ المسبل إزاره وثوبه أسفل من الكعبين للخُيلاء‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1588
    },
    {
      "hadithNumber": 1589,
      "english": {
        "narrated": "'Iyad bin Himar (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Verily, Allah has revealed to me that you should adopt humility. So that no one may wrong another and no one may be disdainful and haughty towards another.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إن الله تعالى أوحى إلي أن تواضعوا حتى لا يبغي أحد على أحد، ولا يفخر أحد على أحد‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1589
    },
    {
      "hadithNumber": 1590,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"When a person says: 'People have been ruined, he is the one to be ruined the most.\"'[Muslim]In another version: \"He himself is the most ruined among them.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إذا قال الرجل‏:‏ هلك الناس، فهو أهلكهم‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1590
    },
    {
      "hadithNumber": 1591,
      "english": {
        "narrated": "Anas bin Malik (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Do not desert (stop talking to) one another, do not nurse hatred towards one another, do not be jealous of one another, and become as fellow brothers and slaves of Allah. It is not lawful for a Muslim to stop talking to his brother (Muslim) for more than three days.\"[Al-Bukhari and Muslim]",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا تقاطعوا ولا تدابروا، ولا تباغضوا، ولا تحاسدوا، وكونوا عباد الله إخوانًا، ولا يحل لمسلم أن يهجر أخاه فوق ثلاث‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1591
    },
    {
      "hadithNumber": 1592,
      "english": {
        "narrated": "Abu Ayyub Al-Ansari (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"It is not lawful for a Muslim to desert (stop talking to) his brother beyond three nights, the one turning one way and the other turning to the other way when they meet, the better of the two is one who is the first to greet the other.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا يحل لمسلم أن يهجر أخاه فوق ثلاث ليال‏:‏ يلتقيان، فيعرض هذا ويعرض هذا، وخيرهما الذي يبدأ بالسلام‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1592
    },
    {
      "hadithNumber": 1593,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"People's deeds are presented before Allah on Mondays and Thursdays, and then every slave (of Allah) is granted forgiveness (of minor sins) if he does not associate anything with Allah in worship. But the person in whose heart there is rancour against his brother, will not be pardoned. With regard to them, it is said twice: 'Hold these two until they are reconciled'.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏تعرض الأعمال في كل اثنين وخميس، فيغفر الله لكل امرئ لا يشرك بالله شيئا، إلا امرءا كانت بينه وبين أخيه شحناء، فيقول‏:‏ اتركوا هذين حتى يصطلحا‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1593
    },
    {
      "hadithNumber": 1594,
      "english": {
        "narrated": "Jabir (May Allah be pleased with him) said:",
        "hadith": "I heard the Messenger of Allah (ﷺ) as saying, \"The Satan has despaired of being worshipped by those who engage in prayer in the Arabian Peninsula but (has not lost hope) in creating dissension among them.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إن الشيطان قد يئس أن يعبده المصلون في جزيرة العرب، ولكن في والتحريش بينهم ‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1594
    },
    {
      "hadithNumber": 1595,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"It is not lawful for a Muslim to forsake his (Muslim) brother beyond three days; and whosoever does so for more than three days, and then dies, will certainly enter the Hell.\"[Abu Dawud].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا يحل لمسلم أن يهجر أخاه فوق ثلاث، فمن هجر فوق ثلاث، فمات دخل النار‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1595
    },
    {
      "hadithNumber": 1596,
      "english": {
        "narrated": "Abu Khirash Hadrad bin Abu Hadrad Al-Aslami (May Allah be pleased with him) said:",
        "hadith": "I heard the Prophet (ﷺ) saying, \"Whosoever forsakes his brother for a year is like one who sheds his blood.\"[Abu Dawud].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏من هجر أخاه سنة فهو كسفك دمه‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1596
    },
    {
      "hadithNumber": 1597,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"It is not permissible for a believer to forsake his (Muslim) brother for more than three days. If three days have passed, he should meet him and greet him; and if other responds to it they will both share the reward; but if he does not respond, he will bear his sin and the one who (has taken the initiative to) greet (the other) will be absolved of the sin of forsaking (one's brother in Faith).\"[Abu Dawud].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا يحل لمؤمن أن يهجر مؤمنًا فوق ثلاث، فإن مرت به ثلاث، فليلقه، وليسلم عليه، فإن رد عليه السلام، فقد اشتركا في الأجر، وإن لم يرد عليه، فقد باء بالإثم، وخرج المسلم من الهجرة‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1597
    },
    {
      "hadithNumber": 1598,
      "english": {
        "narrated": "Ibn 'Umar (May Allah be pleased with them) said:",
        "hadith": "the Messenger of Allah (ﷺ) said, \"In the presence of three people, two should not hold secret counsel, to the exclusion of the third.\"[Al- Bukhari and Muslim].In Abu Dawud, Abu Salih related: I asked Ibn 'Umar: \"What if there are four people.\" He said, \"There is no harm in that.\"Malik reported in Al-Muwatta that 'Abdullah bin Dinar related: Ibn 'Umar and I were together in Khalid bin 'Uqbah's house which was situated in the market place. A man came to consult Ibn 'Umar. None besides me was present. Ibn 'Umar called another man in and we became four and said to me and the man he had called: Move away a bit because I have heard the Messenger of Allah (ﷺ) saying, \"The two people should not hold secret counsel together excluding the third.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن ابن عمر رضي الله عنهما أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏إذا كانوا ثلاثة فلا يتناجى اثنان دون الثالث‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ \n‏(‏‏(‏ورواه أبو دواد وزاد‏:‏ قال أبو صالح‏:‏ قلت لابن عمر‏:‏ فأربعة‏؟‏ قال‏:‏ لا يضرك‏.‏ ورواه مالك في الموطأ‏:‏ عن عبد الله بن دينار قال‏:‏ كنت أنا وابن عمر عند دار خالد بن عقبة التي في السوق، فجاء رجل يريد أن يناجيه، وليس مع ابن عمر أحد غيري، فدعا ابن عمر رجلا آخر حتى كنا أربعة فقال لي وللرجل الثالث الذي دعا‏:‏ استأخرا شيئًا، فإني سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏\"‏لا يتناجى اثنان دون واحد‏\"‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1598
    },
    {
      "hadithNumber": 1599,
      "english": {
        "narrated": "Ibn Mas'ud (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"When three of you are together, two of you must not converse privately ignoring the third till the number increases, lest the third should be grieved.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إذا كنتم ثلاثة، فلا يتناجى اثنان دون الآخر حتى تختلطوا بالناس، من أجل أن ذلك يحزنه‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1599
    },
    {
      "hadithNumber": 1600,
      "english": {
        "narrated": "Ibn 'Umar (May Allah be pleased with them) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"A woman was punished in Hell because of a cat which she had confined until it died. She did not give it to eat or to drink when it was confined, nor did she free it so that it might eat the vermin of the earth.\"[Al-Bukhari and Muslim]",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏عذبت امرأة في هِرة حبستها حتى ماتت، فدخلت فيها النار، لا هي أطعمتها وسقتها، إذ هي حبستها، ولا هي تركتها تأكل من خشاش الأرض‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1600
    },
    {
      "hadithNumber": 1601,
      "english": {
        "narrated": "Ibn 'Umar (May Allah be pleased with them) reported:",
        "hadith": "I happened to pass by some lads of the Quraish who had tied a bird at which they have been shooting arrows. Every arrow that they missed came into the possession of the owner of the bird. No sooner had they seen Ibn 'Umar, they dispersed. Thereupon, Ibn 'Umar said: \"Who has done this? May Allah curse him who has done so. Verily, the Messenger of Allah (ﷺ) has cursed anyone who makes a live thing the target (of one's marksmanship).\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏الغَرَض‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1601
    },
    {
      "hadithNumber": 1602,
      "english": {
        "narrated": "Anas (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) forbade animals being tied (as targets).[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أنس رضي الله عنه قال‏:‏ نهى رسول الله صلى الله عليه وسلم أن تُصبر البهائم‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏  \nومعناه‏:‏ تحبس للقتل‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1602
    },
    {
      "hadithNumber": 1603,
      "english": {
        "narrated": "Abu Ali Suwaid bin Muqarrin (May Allah be pleased with him) said:",
        "hadith": "I was the seventh child of Banu Muqarrin and we had only one slave-girl. When the youngest of us once happened to slap her (on the face) the Messenger of Allah (ﷺ) ordered us to set her free.[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏سابع إخوة لي‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1603
    },
    {
      "hadithNumber": 1604,
      "english": {
        "narrated": "Abu Mas'ud Al-Badri (May Allah be pleased with him) said:",
        "hadith": "I was beating my slave with a whip when I heard a voice behind me which said: \"Abu Mas'ud! Bear in mind...\" I did not recognize the voice for the intense anger I was in. Abu Mas'ud added: As he came near me, I found that he was the Messenger of Allah (ﷺ) who was saying, \"Abu Mas'ud! Bear in mind that Allah has more dominance upon you than you have upon your slave.\" Then I said: \"I will never beat any slave in future.\"Another narration is: The whip dropped from my hand in awe of the Prophet (ﷺ).Still another narration is: I said: \"He is free for the sake of Allah.\" He (ﷺ) said, \"If you had not done this, you would have been scorched by the Fire.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي مسعود البدري رضي الله عنه قال‏:‏ ‏\"‏كنتُ أضرب غلامًا لي بالوسط، فسمعت صوتًا من خلفي‏:‏ ‏\"‏اعلم أبا مسعود‏\"‏ فلم أفهم الصوت من الغضب، فلما دنا مني إذا هو رسول الله صلى الله عليه وسلم فإذا هو يقول‏:‏ ‏\"‏اعلم أبا مسعود أن الله أقدرُ عليك منك على هذا الغلام‏\"‏ فقلت‏:‏ لا أضرب مملوكًا بعده أبدًا‏.‏ \n‏(‏‏(‏وفي رواية‏:‏ فسقط السوط من يدي من هيبته‏)‏‏)‏\n‏(‏‏(‏وفي رواية‏:‏ فقلت‏:‏ يارسول الله هو حر لوجه الله تعالى، فقال‏:‏ ‏\"‏أما لو لم تفعل، للفحتك النار، أو لمستك النار‏\"‏ ‏(‏‏(‏رواه مسلم بهذه الروايات‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1604
    },
    {
      "hadithNumber": 1605,
      "english": {
        "narrated": "Ibn 'Umar (May Allah be pleased with them) reported:",
        "hadith": "The Prophet (ﷺ) said, \"The expiation for beating or slapping a slave on the face for something he has not done is to set him free.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏من ضرب غلامًا له حدًا لم يأتهِ، أو لطمه، فإن كفارته أن يعتقه‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1605
    },
    {
      "hadithNumber": 1606,
      "english": {
        "narrated": "It has been narrated that Hisham bin Hakim bin Hizam (May Allah be pleased with them) happened to pass by some (non-Arab) farmers of Syria who had been made to stand in the sun, and olive oil was poured on their heads. He said:",
        "hadith": "\"What is the matter?\" He was told that they had been detained for the non-payment of Jizyah. (Another narration says that they were being tortured for not having paid Al-Kharaj). Thereupon Hisham said: \"I bear testimony to the fact that I heard the Messenger of Allah (ﷺ) saying, 'Allah will torment those who torment people in the world.\"' Then he proceeded towards their Amir and reported this Hadith to him. The Amir then issued orders for their release.[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن هشام بن حكيم بن حزام رضي الله عنه أنه مر بالشام على أناس من الأنباط، وقد أقيموا في الشمس، وصُب على رءوسهم الزيت فقال‏:‏ ما هذا‏؟‏ يُعذبون في الخراج وفي رواية‏:‏ حُبسوا في الجزية‏.‏ فقال هشام‏:‏ أشهد لسمعت رسول الله صلى الله عليه وسلم  يقول‏:‏ ‏\"‏إن الله يعذب الذين يعذبون الناس في الدنيا‏\"‏ فدخل على الأمير، فحدثه، فأمر بهم فخلوا‏\"‏ ‏(‏‏(‏رواه مسلم‏.‏ ‏\"‏الأنباط‏\"‏ الفلاحون من العجم‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1606
    },
    {
      "hadithNumber": 1607,
      "english": {
        "narrated": "Ibn 'Abbas (May Allah be pleased with them) said:",
        "hadith": "The Messenger of Allah (ﷺ) saw an ass which had been branded on the face. He disapproved of it. Upon this Ibn 'Abbas (May Allah be pleased with them) said, \"By Allah, I shall not brand (the animal) but on a part at a distance from the face.\" Ibn 'Abbas (May Allah be pleased with them) then commanded branding on the hips; he was the first person to brand the animals on hips.[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن ابن عباس رضي الله عنهما قال‏:‏ رأى رسول الله صلى الله عليه وسلم حمارًا موسوم الوجه، فأنكر ذلك‏؟‏ فقال‏:‏ والله لا أسمه إلا أقصى شيء من الوجه، وأمر بحماره، فكوي في جاعرتيه، فهو أول من كوى الجاعرتين‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏((الجاعرتان)): ناحية الوركين حول الدبر.",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1607
    },
    {
      "hadithNumber": 1608,
      "english": {
        "narrated": "Ibn 'Abbas (May Allah be pleased with them) said:",
        "hadith": "An ass with a brand on the face happened to pass before the Prophet (ﷺ). Thereupon he said, \"May Allah curse the one who has branded it (on the face).\"[Muslim].Another narration in Muslim is: \"The Messenger of Allah (ﷺ) prohibited us from hitting across the face and branding on the face (of an animal).\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لعن الله الذي وسمه‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1608
    },
    {
      "hadithNumber": 1609,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) sent us on an expedition and said to us, \"If you find so- and-so (he named two persons belonging to the Quraish) commit them to the fire.\" When we were on the verge of departure, he said to us, \"I ordered you to burn so-and-so, but it is Allah Alone Who punishes with the fire. So if you find them put them to death.\"[Al- Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن أبي هريرة رضي الله عنه قال‏:‏ بعثنا رسول الله صلى الله عليه وسلم في بعث فقال‏:‏ ‏\"‏إن وجدتم فلانًا وفلانًا‏\"‏ لرجلين من قريش سماهما ‏\"‏فأحرقوهما بالنار‏\"‏ ثم قال رسول الله صلى الله عليه وسلم حين أردنا الخروج‏:‏ ‏\"‏إني كنت أمرتكم أن تحرقوا فلانًا وفلانًا، وإن النار لا يعذب بها إلا الله، فإن وجدتموهما فاقتلوهما‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1609
    },
    {
      "hadithNumber": 1610,
      "english": {
        "narrated": "Ibn Mas'ud (May Allah be pleased with him) reported:",
        "hadith": "We were with the Messenger of Allah (ﷺ) in a journey when he drew apart (to relieve nature). In his absence, we saw a red bird which had two young ones with it. We caught them and the red mother bird came, beating the earth with its wings. In the meantime the Prophet (ﷺ) returned and said, \"Who has put this bird to distress on account of its young? Return them to her.\" He (ﷺ) also noticed a mound of ants which we had burnt up. He asked, \"Who has set fire to this?\" We replied: \"We have done so.\" He (ﷺ) said, \"None can chastise with fire except the Rubb of the fire.\"[Abu Dawud].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن ابن مسعود رضي الله عنه قال‏:‏ كنا مع رسول الله صلى الله عليه وسلم في سفر، فانطلق لحاجته، فرأينا حمرة معها فرخان، فأخذنا فرخيها، فجاءت الحمرة فجعلت تعرش فجاء النبي صلى الله عليه وسلم فقال‏:‏ ‏\"‏من فجع هذه بولدها‏؟‏ ردوا ولدها  إليها‏\"‏ ورأى قرية نمل قد حرقناها، فقال‏:‏ ‏\"‏من حرق هذه‏؟‏‏\"‏ قلنا‏:‏ نحن‏.‏ قال‏:‏ ‏\"‏إنه لا ينبغي أن يعذِّب بالنار إلا رب النار‏\"‏‏.‏\nقوله‏:‏ ‏ ‏قرية نمل‏ ‏ معناه‏:‏ موضع النمل مع النمل.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1610
    },
    {
      "hadithNumber": 1611,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"It is an act of oppression on the part of a person to procrastinate in fulfilling his obligation; if the repayment of a debt due to any of you is undertaken by a rich person, you should agree to the substitution.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏مطل الغني ظلم وإذا أُتبع أحدكم على مليء فليتبع‏\"‏ ‏(‏‏(‏متفق عليه‏.‏ معنى ‏\"‏أتبع‏\"‏‏:‏ أحيل‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1611
    },
    {
      "hadithNumber": 1612,
      "english": {
        "narrated": "Ibn 'Abbas (May Allah be pleased with them) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"He who gives something (to someone) as a gift and then gets it back (from him or her) is like a dog which eats its own vomit.\"Another narration is: \"He who gets back his charity is like a dog which vomits and then returns to that and eats it.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن ابن عباس رضي الله عنهما أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏الذي يعود في هبته كالكلب يرجع في قيئه‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ \n‏(‏‏(‏وفي رواية‏:‏ ‏\"‏مثل الذي يرجع في صدقته، كمثل الكلب يقيء، ثم يعود في قيئه فيأكله‏\"‏‏.‏ وفي رواية‏:‏ ‏\"‏العائد في هبته كالعائد في قيئه‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1612
    },
    {
      "hadithNumber": 1613,
      "english": {
        "narrated": "'Umar bin Al-Khattab (May Allah be pleased with him) said:",
        "hadith": "I donated a horse in the way of Allah. Its new possessor did not treat it properly. I made my mind to buy it because I thought that he would sell it at a cheap price (now that it became weak and emaciated). I asked the Prophet (ﷺ) about it, whereupon he said, \"Do not buy it and do not get back your charity, for one who gets back the charity is like a dog that eats its own vomit.\"[Al-Bukhari and Muslim]",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن عمر بن الخطاب رضي الله عنه قال‏:‏ حملت على فرس في سبيل الله فأضاعه الذي كان عنده، فأردت أن أشتريه، وظننت أنه يبيعه برخص، فسألت النبي صلى الله عليه وسلم فقال‏:‏ ‏\"‏لا تشتره ولا تعد في صدقتك وإن أعطاكه بدرهم، فإن العائد في صدقته كالعائد في قيئه‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ \nقوله‏:‏ ‏\"‏حملت على فرس في سبيل الله‏\"‏ معناه‏:‏ تصدقت به على بعض المجاهدين‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1613
    },
    {
      "hadithNumber": 1614,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Prophet (ﷺ) said, \"Keep away from the seven fatalities.\" It was asked: \"What are they, O Messenger of Allah?\" He (ﷺ) replied, \"Associating anything with Allah in worship (i.e., committing an act of Shirk), sorcery, killing of one whom Allah has declared inviolable without a just cause, devouring the property of an orphan, the eating of usury (Riba), fleeing from the battlefield and accusing chaste believing women, who never even think of anything touching their chastity.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال‏:‏ ‏\"‏اجتنبوا السبع الموبقات‏\"‏ قالوا‏:‏ يا رسول الله وما هن‏؟‏ قال‏:‏ ‏\"‏الشرك بالله، والسحر وقتل النفس التي حرم الله إلا بالحق، وأكل الربا، وأكل مال اليتيم، والتولي يوم الزحف، وقذف المحصنات المؤمنات الغافلات‏\"‏ ‏(‏‏(‏متفق عليه‏.‏ ‏\"‏الموبقات‏\"‏ المهلكات‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1614
    },
    {
      "hadithNumber": 1615,
      "english": {
        "narrated": "`Abdullah bin Mas`ud (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) cursed the one who accepts Ar-Riba (the usury) and the one who pays it.\n\n[Muslim].\n\nThe narration in At-Tirmidhi adds: And the one who records it, and the two persons who stand witness to it.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لعن رسول الله صلى الله عليه وسلم آكل الربا وموكله‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1615
    },
    {
      "hadithNumber": 1616,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Almighty Allah says, 'I am the One Who is most free from want of partners. He who does a thing for the sake of someone else beside Me, I discard him and his polytheism..\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ قال الله تعالى‏:‏ أنا أغنى الشركاء عن الشرك، من عمل عملا أشرك فيه معي غيري، تركته وشركه‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1616
    },
    {
      "hadithNumber": 1617,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "I heard the Messenger of Allah (ﷺ) saying, \"The first to be judged on the Day of Resurrection will be a man who had died as a martyr. He will be brought forward. Allah will remind him of the favours He had bestowed upon him and the man will acknowledge them. Then He will ask him: 'What did you do to express gratitude for it?' The man will reply: 'I fought for Your Cause till I was martyred.' Allah will say: 'You have lied. You fought so that people might call you courageous; and they have done so.' Command will then be issued about him and he will be dragged on his face and thrown into Hell. Next a man who had acquired and imparted knowledge and read the Qur'an will be brought forward, Allah will remind him of the favours He had bestowed upon him and the man will acknowledge them. Then He will ask him: 'What did you do to express gratitude for it?' The man will reply: 'I acquired knowledge and taught it, and read the Qur'an for Your sake.' Allah will say to him: 'You have lied. You acquired knowledge so that people might call you a learned (man), and you read the Qur'an so that they might call you a reciter, and they have done so.' Command will then be issued about him, and he will be dragged on his face and thrown into Hell. Next a man whom Allah had made affluent and to whom Allah had given plenty of wealth, will be brought forward, Allah will remind him of the favours He had bestowed upon him and the man will acknowledge them. He will ask him: 'What did you do to express gratitude for it?' The man will reply: 'I did not neglect any of the ways You liked wealth to be spent liberally for Your sake'. Allah will say to him: 'You have lied. You did it so that people might call you generous, and they have done so.' Command will then be issued about him and he will be dragged on his face and thrown into Hell.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ إن أول الناس يقضى يوم القيامة عليه رجل اسُتشهد، فأتي به، فعرفه نعمته، فعرفها، قال‏:‏ فما عملت فيها‏؟‏ قال‏:‏ قاتلت فيك حتى اسُتشهدت، قال‏:‏ كذبت، ولكنك قاتلت لأن يقال‏:‏ جريء، فقد قيل، ثم أمر به، فسحب على وجهه حتى ألقي في النار‏.‏ ورجل تعلم العلم وعلمه، وقرأ القرآن، فأتي به، فعرفه نعمه فعرفها‏.‏ قال فما عملت فيها‏؟‏ قال تعلمت العلم وعلمته وقرأت فيك القرآن‏.‏ قال كذبت، ولكنك تعلمت ليقال‏:‏ عالم‏.‏ وقرأت القرآن ليقال‏:‏ هو قارئ، فقد قيل‏:‏ ثم أُمر به، فسُحب على وجهه حتى ألقي في النار، ورجل وسع الله عليه، وأعطاه من أصناف المال، فأتي به فعرفه نعمه، فعرفها‏.‏ قال‏:‏ فما عملت فيها ‏؟‏ قال‏:‏ ما تركت من سبيل تحب أن ينفق فيها إلا أنفقت فيها لك، قال‏:‏ كذبت، ولكنك فعلت ليقال‏:‏ جواد، فقد قيل، ثم أُمر به فسُحب على وجهه ثم ألقي في النار‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1617
    },
    {
      "hadithNumber": 1618,
      "english": {
        "narrated": "`Abdullah bin `Umar (May Allah be pleased with them) said:",
        "hadith": "Some people told me, \"We visit our rulers and we tell them things contrary to those which we say when we depart from them.\"\n`Abdullah bin `Umar (May Allah be pleased with them) replied: \"In the era of the Messenger of Allah (ﷺ) we considered this to be an act of hypocrisy.\"\n\n[Al-Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن ابن عمر رضي الله عنهما أن ناسًا قالوا له‏:‏ إنا ندخل على سلاطيننا فنقول لهم بخلاف ما نتكلم إذا خرجنا من عندهم‏؟‏ قال ابن عمر رضي الله عنهما‏:‏ كنا نعد هذا نفاقًا على عهد رسول الله صلى الله عليه وسلم ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1618
    },
    {
      "hadithNumber": 1619,
      "english": {
        "narrated": "Jundub (May Allah be pleased with him) said:",
        "hadith": "The Prophet (ﷺ) said, \"He who so acts to show off, Allah will disgrace him on the Day of Resurrection, and he who does good deeds so that people (may hold him in high esteem), Allah will expose his hidden evil intentions before the people on the Day of Resurrection.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن جُندب بن عبد الله بن سفيان رضي الله عنه قال‏:‏ قال النبي صلى الله عليه وسلم ‏:‏ ‏\"‏من سمَّع سمَّع الله به، ومن يرائي الله يرائي به‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ ‏(‏‏(‏رواه مسلم أيضًا من رواية ابن عباس رضي الله عنه‏)‏‏)‏‏.‏ \n‏\"‏سمَّع‏\"‏ بتشديد الميم، ومعناه‏:‏ أظهر عمله للناس رياء ‏\"‏ سمَّع الله به‏\"‏ أي فضحه يوم القيامة، ومعنى‏:‏ ‏\"‏ من راءى‏\"‏ أي‏:‏ من أظهر للناس العمل الصالح ليعظم عندهم ‏\"‏راءى الله به‏\"‏ أي‏:‏ أظهر سريرته على رءوس الخلائق‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1619
    },
    {
      "hadithNumber": 1620,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"A person who acquires (religious) knowledge, which is (normally) acquired to gain the Pleasure of Allah, (for the sole reason) to secure worldly comforts will not even smell the fragrance of Jannah on the Day of Resurrection (i.e., will not enter Jannah).\"[Abu Dawud].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ من تعلم علمًا مما يبتغى به وجه الله عز وجل لا يتعلمه إلا ليصيب به عرضًا من الدنيا، لم يجد عَرف الجنة يوم القيامة‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1620
    },
    {
      "hadithNumber": 1621,
      "english": {
        "narrated": "Abu Dharr (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) was asked: \"Tell us about a person who does some good deed and people praise him, will this be considered as showing off?\" He replied, \"This is the glad tidings which a believer receives (in this life).\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ تلك عاجل بشرى المؤمن‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1621
    },
    {
      "hadithNumber": 1622,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Prophet (ﷺ) said, \"Allah has written the very portion of Zina which a man will indulge in. There will be no escape from it. The Zina of the eye is the (lustful) look, the Zina of the ears is the listening (to voluptuous songs or talk), the Zina of the tongue is (the licentious) speech, the Zina of the hand is the (lustful) grip, the Zina of the feet is the walking (to the place where he intends to commit Zina), the heart yearns and desires and the private parts approve all that or disapprove it.\"[Al-Bukhari and Muslim].This is the wording in Muslim; Al-Bukhari wording is a bit short.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏كُتب على ابن آدم نصيبه من الزنا مدرك ذلك لا محالة‏:‏ العينان زناهما النظر، والأذنان زناهما الاستماع، واللسان زناه الكلام، واليد زناها البطش، والرجل زناها الخطا، والقلب يهوى ويتمنى، ويصدق ذلك الفرج أو يكذبه‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1622
    },
    {
      "hadithNumber": 1623,
      "english": {
        "narrated": "Abu Sa'id Al-Khudri (May Allah be pleased with him) said:",
        "hadith": "The Prophet (ﷺ) said, \"Avoid sitting on roadsides.\" His Companions said: \"O Messenger of Allah (ﷺ), there is no other alternative but to sit there to talk.\" Thereupon the Messenger of Allah (ﷺ) said, \"If you have to sit at all, then fulfill the rights of the road.\" They asked: \"What are their rights?\" Thereupon he said, \"Lowering the gaze (so that you may not stare at unlawful things); refraining from doing some harm to others, responding to greeting (i.e., saying 'Wa'alaikumus- salam' to one another) and commanding the good and forbidding the evil.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي سعيد الخُدري رضي الله عنه عن النبي صلى الله عليه وسلم  قال‏:‏ ‏\"‏إياكم والجلوس في الطرقات‏\"‏‏.‏ قالوا‏:‏ يا رسول الله ما لنا من مجالسنا بُد نتحدث فيها‏.‏ فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏فإذا أبيتم إلا المجلس، فأعطوا الطريق حقه‏\"‏ قالوا‏:‏ وما حق الطريق يا رسول الله‏؟‏ قال‏:‏ ‏\"‏غض البصر،  وكف الأذى، ورد السلام، والأمر المعروف والنهي عن المنكر‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1623
    },
    {
      "hadithNumber": 1624,
      "english": {
        "narrated": "Abu Talhah Zaid bin Sahl (May Allah be pleased with him) said:",
        "hadith": "We were sitting and talking on a platform in front of our house when the Messenger of Allah (ﷺ) stopped by us and said, \"Why do you sit on roads? Avoid sitting in them.\" We replied: \"We sit there intending no harm. We only sit and discuss (religious) knowledge and talk.\" He said, \"If you have to sit, you should fulfill the rights of the road: Lower your gaze, respond to greetings and talk in a good manner.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي طلحة زيد بن سهل رضي الله عنه قال‏:‏ كنا قعودًا بالأفنية نتحدث فيها فجاء رسول الله صلى الله عليه وسلم  فقالم علينا فقال‏:‏ ‏\"‏ما لكم ولمجالس الصعدات‏؟‏ فقلنا‏:‏ إنما قعدنا لغير ما بأس، قعدنا نتذاكر، ونتحدث‏.‏ قال‏:‏ ‏\"‏إما لا فأدوا حقها‏:‏ غض البصر، ورد السلام، وحسن الكلام‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ ‏\"‏الصُّعُدات‏\"‏ بضم الصاد والعين، أي‏:‏ الطرقات‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1624
    },
    {
      "hadithNumber": 1625,
      "english": {
        "narrated": "Jarir bin 'Abdullah (May Allah be pleased with him) said:",
        "hadith": "I asked the Messenger of Allah (ﷺ) about (the Islamic ruling on) accidental glance (i.e., at a woman one is not Islamically allowed to look at) and he ordered me to turn my eyes away.[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏اصرف بصرك‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1625
    },
    {
      "hadithNumber": 1626,
      "english": {
        "narrated": "Umm Salamah (May Allah be pleased with her) said:",
        "hadith": "I was with the Messenger of Allah (ﷺ) along with Maimunah (May Allah be pleased with her) when Ibn Umm Maktum (May Allah be pleased with him) (who was blind) came to visit him. (This incident took place after the order of Hijab). The Prophet (ﷺ) told us to hide ourselves from him (i.e., observe Hijab). We said: \"O Messenger of Allah (ﷺ), he is blind and is unable to see us, nor does he know us.\" He replied; \"Are you also blind and unable to see him?\"[Abu Dawud and At- Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أم سلمة رضي الله عنها قالت‏:‏ كنت عند رسول الله صلى الله عليه وسلم وعنده ميمونة، فأقبل ابن أم مكتوم، وذلك بعد أن أُمرنا بالحجاب فقال النبي صلى الله عليه وسلم ‏:‏ ‏\"‏احتجبا منه‏\"‏ فقلنا‏:‏ يا رسول الله إلىس هو أعمى لا يبصرنا، ولا يعرفنا‏؟‏ فقال النبي صلى الله عليه وسلم ‏:‏ ‏\"‏أفعمياوان أنتما ألستما تبصرانه‏؟‏‏!‏‏\"‏ ‏(‏‏(‏رواه أبو داود والترمذي‏:‏ وقال حديث حسن صحيح‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1626
    },
    {
      "hadithNumber": 1627,
      "english": {
        "narrated": "Abu Sa'id Al-Khudri (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"A man must not look at a man's private parts nor must a woman look at a woman's private parts; neither should two men lie naked under one cover, nor should two women lie naked under the same cover.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا ينظر الرجل إلى عورة الرجل، ولا المرأة إلى عورة المرأة، ولا يفضي الرجل إلى الرجل في ثوب واحد، ولا تفضي المرأة إلى المرأة في ثوب واحد‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1627
    },
    {
      "hadithNumber": 1628,
      "english": {
        "narrated": "'Uqbah bin 'Amir (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Avoid (entering a place) in which are women (uncovered or simply to mix with them in seclusion).\" A man from the Ansar said, \"Tell me about the brother of a woman's husband.\" He replied, \"The brother of a woman's husband is death.\"[Al- Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن عقبة بن عامر رضي الله عنه أن رسول الله صلى الله عليه وسلم  قال‏:‏ ‏\"‏إياكم والدخول على النساء‏\"‏، فقال رجل من الأنصار‏:‏ أفرأيت الحمو‏؟‏ قال‏:‏ ‏\"‏الحمو الموت‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ ‏\n‏الحمو‏ ‏ قريب الزوج كأخيه، وابن أخيه، وابن عمه‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1628
    },
    {
      "hadithNumber": 1629,
      "english": {
        "narrated": "Ibn Abbas (May Allah be pleased with them) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"No one of you should meet a woman in privacy unless she is accompanied by a Mahram (i.e., a relative within the prohibited degrees).\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا يخلون أحدكم بامرأة إلا مع ذي محرم‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1629
    },
    {
      "hadithNumber": 1630,
      "english": {
        "narrated": "Buraidah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"The sanctity of the wives of Mujahidun (i.e., those who strive hard and fight in the way of Allah) for those who remain at home (i.e., those who do not go to the battlefield to fight Jihad) is like the sanctity of their own mothers. Anyone who remains behind to look after the family of a Mujahid and betrays his trust, will be made to stand on the Day of Resurrection before the Mujahid who will take away from his meritorious deeds whatever he likes till he is satisfied.\" The Messenger of Allah (ﷺ) turned toward us and said, \"Now, what do you think (i.e., will he leave anything with him)?\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن بريدة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏حرمة نساء المجاهدين على القاعدين كحرمة أمهاتهم، ما من رجل من القاعدين يخلف رجلا من المجاهدين في أهله، فيخونه فيهم إلا وقف له يوم القيامة، فيأخذ من حسناته ما شاء حتى يرضى‏\"‏ ثم التفت إلينا رسول الله صلى الله عليه وسلم  وقال‏:‏ ‏\"‏ما ظنكم‏؟‏‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1630
    },
    {
      "hadithNumber": 1631,
      "english": {
        "narrated": "Ibn 'Abbas (May Allah be pleased with them) said:",
        "hadith": "The Messenger of Allah (ﷺ) cursed those men who are effeminate, and women who imitate men.Another narration is: The Messenger of Allah (ﷺ) cursed men who copy women and cursed women who copy men.[Al-Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن ابن عباس رضي الله عنهما قال‏:‏ لعن رسول الله صلى الله عليه وسلم  المخنثين من الرجال، والمترجلات من النساء‏.‏ \nوفي رواية‏:‏ لعن رسول الله صلى الله عليه وسلم المتشبهين من الرجال بالنساء، والمتشبهات من النساء بالرجال‏.‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1631
    },
    {
      "hadithNumber": 1632,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) cursed a man who puts on the dress of women, and a woman who puts on the dress of men.[Abu Dawud].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي هريرة رضي الله عنه قال‏:‏ لعن رسول الله صلى الله عليه وسلم  الرجل يلبس لبسة المرأة، والمرأة تلبس لبسة الرجل‏.‏ ‏(‏‏(‏رواه أبو داود بإسناد صحيح‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1632
    },
    {
      "hadithNumber": 1633,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"There are two types of people who will be punished in Hell and whom I have not seen: men having whips like the tails of cows and they will be beating people with them, and, women who will be dressed but appear to be naked, inviting to evil; and they themselves will be inclined to it. Their heads will appear like the humps of the Bactrian camel inclined to one side. They will not enter Jannah and they will not smell its fragrance which is perceptible from such and such a distance.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏صِنفان من أهل النار لم أرهما‏:‏ قوم معهم سياط كأذناب البقر يضربون بها الناس، ونساء كاسيات عاريات مميلات مائلات، رءوسهن كأسنمة البخت المائلة لا يدخلن الجنة، ولا يجدن ريحها، وإن ريحها ليوجد من مسيرة كذا وكذا‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1633
    },
    {
      "hadithNumber": 1634,
      "english": {
        "narrated": "Jabir (May Allah be pleased with him) said:",
        "hadith": "I heard the Messenger of Allah (ﷺ) as saying: \"Do not eat with your left hand, because Satan eats and drinks with his left hand.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا تأكلوا بالشمال، فإن الشيطان يأكل ويشرب بشماله‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1634
    },
    {
      "hadithNumber": 1635,
      "english": {
        "narrated": "Ibn 'Umar (May Allah be pleased with them) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"No person should eat and drink with his left hand for Satan eats with his left hand and drinks with his left hand.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا يأكلن أحدكم بشماله، ولا يشربن بها‏.‏ فإن الشيطان يأكل بشماله ويشرب بها‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1635
    },
    {
      "hadithNumber": 1636,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "I heard the Messenger of Allah (ﷺ) as saying: \"Jews and Christians do not dye their hair, so act differently from them.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إن اليهود والنصارى لا يصبغون، فخالفوهم‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1636
    },
    {
      "hadithNumber": 1637,
      "english": {
        "narrated": "Jabir (May Allah be pleased with him) said:",
        "hadith": "Abu Quhafah, father of Abu Bakr (May Allah be pleased with them) was presented to the Messenger of Allah (ﷺ) on the day of the conquest of Makkah and his head and beard were snow white. The Messenger of Allah (ﷺ) said, \"Change it (i.e., dye it and avoid black colour).\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏غيروا هذا واجتنبوا السواد‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1637
    },
    {
      "hadithNumber": 1638,
      "english": {
        "narrated": "Ibn 'Umar (May Allah be pleased with them) said:",
        "hadith": "The Messenger of Allah (ﷺ) forbade shaving a part of the head.[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن ابن عمر رضي الله عنهما قال‏:‏ نهى رسول الله صلى الله عليه وسلم  عن القزع‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1638
    },
    {
      "hadithNumber": 1639,
      "english": {
        "narrated": "Ibn 'Umar (May Allah be pleased with them) said:",
        "hadith": "The Messenger of Allah (ﷺ) saw a boy, some portion of whose head was shaved and some of it was left out. He prohibited them from that and said, \"Shave the whole of it or leave the whole of it.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏احلقوه كله، أو اتركوه كله‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1639
    },
    {
      "hadithNumber": 1640,
      "english": {
        "narrated": "'Abdullah bin Ja'far (May Allah be pleased with them) said:",
        "hadith": "The Prophet (ﷺ) gave respite for three days to the family of Ja'far (after his martydom). Then he came and said, \"Don't weep for my brother after this day.\" He said, \"Bring all of my nephews to me.\" We were accordingly brought as if we were chickens. Then he said, \"Call for me a barber.\" He directed him to shave our heads which he did.[Abu Dawud].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن عبد الله بن جعفر رضي الله عنهما أن النبي صلى الله عليه وسلم  أمهل آل جعفر رضي الله عنه ثلاثًا، ثم أتاهم فقال‏:‏ ‏\"‏لا تبكوا على أخي بعد اليوم‏\"‏‏.‏ ثم قال‏:‏ ‏\"‏ادعوا لي بني أخي‏\"‏ فجيء بنا كأننا أفرخ فقال‏:‏ ‏\"‏ادعوا لي الحلاق‏\"‏ فأمره، فحلق رءوسنا‏\"‏‏.‏ رواه أبو داود بإسناد صحيح على شرط البخاري ومسلم‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1640
    },
    {
      "hadithNumber": 1641,
      "english": {
        "narrated": "'Ali (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) prohibited a woman from shaving her head.[An- Nasa'i].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن علي قال‏:‏ نهى رسول الله صلى الله عليه وسلم  أن تحلق المرأة رأسها‏.‏ ‏(‏‏(‏رواه النسائي‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1641
    },
    {
      "hadithNumber": 1642,
      "english": {
        "narrated": "Asma' (May Allah be pleased with her) said:",
        "hadith": "A woman came to the Prophet (ﷺ) and said: \"O Messenger of Allah! I have a daughter who had an attack of small pox and her hair fell off. Now I want to celebrate her marriage. Can I get her a wig?\" Thereupon the Prophet (ﷺ) said, \"Allah has cursed the maker and wearer of a wig.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعَنْ أسْمَاءَ رَضِيَ اللَّه عنْهَا: أنَّ امْرأَةً سألتِ النبيَّ ﷺ فَقَالتْ: يا رَسُولَ اللَّه، إنَّ ابْنَتِي أصَابَتْهَا الْحَصْبةُ، فتَمَرَّقَ شَعْرُهَا، وإنِّي زَوَّجْتُها، أفَأَصِلُ فِيهِ؟ فقالَ: لَعَنَ اللَّه الْواصِلةَ والْمَوصولة متفقٌ عليه.\nوفي روايةٍ: الواصِلَةَ والمُسْتوصِلَةَ. قَوْلَهَا:\"فَتَمرَّقَ\"هو بالرَّاءِ، ومعناهُ: انْتثر وَسَقَطَ،\"والْوَاصِلة\": التي تَصِلُ شَعْرهَا، أو شَعْر غَيْرِهَا بشَعْرٍ آخَرَ.\"والمَوْصُولة\": التي يُوصَلُ شَعْرُهَا. \"والمُستَوصِلَةُ\": التي تَسْأَلُ منْ يَفْعَلُ ذلكَ لَهَا.",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1642
    },
    {
      "hadithNumber": 1643,
      "english": {
        "narrated": "",
        "hadith": "A similar narration was narrated on the authority of 'Aishah.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعَنْ عائشة رضي اللَّه عنْهَا نَحْوُهُ، متفقٌ عليه.",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1643
    },
    {
      "hadithNumber": 1644,
      "english": {
        "narrated": "Humaid bin 'Abdur-Rahman (May Allah be pleased wth him) said:",
        "hadith": "I saw Mu'awiyah (May Allah be pleased with him) during the Hajj (pilgrimage) standing on the pulpit. He took from the guard a bunch of hair, and said: \"O people of Al-Madinah! Where are your scholars? (Why do they do not prohibit you) I heard the Prophet (ﷺ) prohibiting from using this (false hair) and saying, 'The people of Bani Israel were ruined when their women wore such hair.\"'[Al-Bukhari and Muslim]",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"إنًَّمَا هَلَكَتْ بنُو إسْرَائِيل حِينَ اتخذ هذه نِسَاؤُهُمْ\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1644
    },
    {
      "hadithNumber": 1645,
      "english": {
        "narrated": "Ibn 'Umar (May Allah be pleased with them) said:",
        "hadith": "The Messenger of Allah (ﷺ) cursed the maker and wearer of a wig and the tattooer and the one who is tattooed.[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن ابن عمر رضي الله عنه أن رسول الله صلى الله عليه وسلم  لعن الواصلة والمستوصلة والواشمة والمستوشمة ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1645
    },
    {
      "hadithNumber": 1646,
      "english": {
        "narrated": "Ibn Mas'ud (May Allah be pleased with him) said:",
        "hadith": "Allah has cursed those women who practise tattooing and those women who have themselves tattooed, and those women who get their hair removed from their eyebrows and faces (except the beard and the mustache), and those who make artificial spaces between their teeth for beauty, whereby they change Allah's creation. A woman started to argue with him, saying: \"What is all this?\" He replied: \"Why should I not curse those whom the Messenger of Allah (ﷺ) cursed and who are cursed in Allah's Book? Allah, the Exalted, has said in His Book:\"And whatsoever the Messenger (Muhammad (ﷺ)) gives you, take it; and whatsoever he forbids you, abstain (from it).\" (59:7)[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1646
    },
    {
      "hadithNumber": 1647,
      "english": {
        "narrated": "'Aishah (May Allah be pleased with her) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"He who does something contrary to our way (i.e., Islam) will have it rejected.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏من عمل عملا ليس عليه أمرنا فهو رد‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1647
    },
    {
      "hadithNumber": 1648,
      "english": {
        "narrated": "Abu Qatadah (May Allah be pleased with him) said:",
        "hadith": "The Prophet (ﷺ) said, \"Do not touch your private parts with your right hand while urinating, nor for washing or cleaning (your private parts); and do not breathe into the drinking vessel from which you drink.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إذا بال أحدكم، فلا يؤخذن ذكره بيمينه، ولا يستنجي بيمينه، ولا يتنفس في الإناء‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1648
    },
    {
      "hadithNumber": 1649,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"None of you should walk wearing one shoe; you should either wear them both or take them off both.\"[Al- Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم  قال‏:‏ ‏\"‏لا يمشي أحدكم في نعل واحدة لينعلهما جميعًا او ليخلعهما جميعًا‏\"‏‏.‏  \nوفي رواية ‏\"‏ أو ليحفهما جميعًا ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1649
    },
    {
      "hadithNumber": 1650,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "I heard the Messenger of Allah (ﷺ) saying, \"When the lace of one of the shoes of any one of you is cut off, he should not walk with the other until he has got the lace repaired.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إذا انقطع شسع نعل أحدكم، فلا يمشِ في الأخرى حتى يصلحها‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1650
    },
    {
      "hadithNumber": 1651,
      "english": {
        "narrated": "Jabir (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) forbade a person wearing (tying up) his shoe while standing.[Abu Dawud with a good Isnad].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن جابر رضي الله عنه أن رسول الله صلى الله عليه وسلم نهى أن ينتعل الرجل قائمًا‏\"‏‏.‏ ((رواه أبو داود بإسناد حسن ))",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1651
    },
    {
      "hadithNumber": 1652,
      "english": {
        "narrated": "Ibn 'Umar (May Allah be pleased with them) said:",
        "hadith": "The Prophet (ﷺ) said, \"Do not keep the fire burning in your homes when you go to bed.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا تتركوا النار في بيوتكم حين تنامون‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1652
    },
    {
      "hadithNumber": 1653,
      "english": {
        "narrated": "Abu Musa Al-Ash'ari (May Allah be pleased with him) said:",
        "hadith": "A house in Al-Madinah was burnt with its occupants inside it one night. When this was reported to the Messenger of Allah (ﷺ) he said, \"Fire is your enemy. So, put it out before going to bed.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إن هذه النار عدو لكم، فإذا نمتم فأطفئوها‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1653
    },
    {
      "hadithNumber": 1654,
      "english": {
        "narrated": "Jabir (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Cover up the (kitchen) containers (i.e., pots, pans, etc.), tie up the mouth of the water-skin, lock up the doors and extinguish the lamps, because Satan can neither untie the water-skin nor open the door nor uncover the containers. If one can cover the cooking pot even by placing a piece of wood across it, and pronounce the Name of Allah on it, let him do it. A mouse can sometimes cause a house to burn along its dwellers.\"[Muslim]",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن جابر رضي الله عنه عن النبي صلى الله عليه وسلم  قال‏:‏ ‏\"‏غطوا الإناء، وأوكئوا السقاء، وأغلقوا الأبواب، وأطفئوا السراج، فإن الشيطان لا يحل سقاء، ولايفتح بابًا ولايكشف إناءً، إن لم يجد أحدكم إلا أن يعرض على إنائه عودا، ويذكر اسم الله، فليفعل، فإن الفويسقة تضرم على أهل البيت بيتهم‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏ ‏\"‏الفويسقة‏:‏ الفأرة، و‏\"‏تضرم‏\"‏‏:‏ تحرق‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1654
    },
    {
      "hadithNumber": 1655,
      "english": {
        "narrated": "'Umar (May Allah be pleased with him) said:",
        "hadith": "We have been forbidden to go into excess.[Al-Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏نهينا عن التكلف‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1655
    },
    {
      "hadithNumber": 1656,
      "english": {
        "narrated": "Masruq (May Allah be pleased with him) said:",
        "hadith": "We visited 'Abdullah bin Mas'ud (May Allah be pleased with him) and he said to us: O people! He who has the knowledge of any matter may convey it to the others. And he who has no knowledge, thereof, should say: \"Allahu a'lam (Allah knows better).\" It is a part and parcel of knowledge that a man who has no knowledge of a matter should say: \"Allah knows better.\" Allah said to His Prophet (ﷺ):\"Say (O Muhammad (ﷺ)): 'No wage do I ask of you for this (the Qur'an), nor am I one of the Mutakallifun (those who pretend and fabricate things which do not exist).\"' (38:86)[Al-Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن مسروق قال ‏:‏ دخلنا على عبدالله بن مسعود رضي الله عنه فقال ‏:‏ يا أيها الناس من علم شيئا فليقل به، ومن لم يعلم، فليقل ‏:‏الله أعلم، فإن من العلم أن يقول الرجل لما لا يعلم‏:‏ الله أعلم ‏.‏ قال الله تعالى لنبيه صلى الله عليه وسلم ‏:‏‏{‏قل ما أسألكم عليه من أجر وما أنا من المتكلفين‏}‏‏.‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1656
    },
    {
      "hadithNumber": 1657,
      "english": {
        "narrated": "'Umar bin Al-Khattab (May Allah be pleased with him) said:",
        "hadith": "The Prophet (ﷺ) said, \"The deceased is tortured in his grave for bewailing over him.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن عمر بن الخطاب رضي الله عنه قال‏:‏ قال النبي صلى الله عليه وسلم  ‏:‏‏\"‏الميت يُعذب في قبره بما نِيح عليه ‏\"‏‏. وَفِي روايةٍ:\"مَا نِيحَ علَيْهِ\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1657
    },
    {
      "hadithNumber": 1658,
      "english": {
        "narrated": "Ibn Mas'ud (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"He who (on befalling a calamity) slaps his cheeks, tears his clothes and follows the ways and traditions of the Days of Ignorance is none of us.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ليس منا من ضرب الخدود، وشق الجيوب، ودعا بدعوى الجاهليه‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1658
    },
    {
      "hadithNumber": 1659,
      "english": {
        "narrated": "Abu Burdah (May Allah be pleased with him) reported:",
        "hadith": "(My father) Abu Musa got seriously ill and lost his consciousness. His head was in the lap of a woman of the family and she began to wail. When Abu Musa recovered his consciousness, he said: \"I am innocent of those from whom Messenger of Allah (ﷺ) is innocent. Verily, the Messenger of Allah (ﷺ) declared himself free of (the responsibility) for a woman who wails, shaves her head and tears up her clothes.\"[Al- Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏الصالقة‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1659
    },
    {
      "hadithNumber": 1660,
      "english": {
        "narrated": "Al-Mughirah bin Shu'bah (May Allah be pleased with him) said:",
        "hadith": "I heard the Messenger of Allah (ﷺ) saying, \"He who allows (others) to wail over his death, will be punished for it on the Day of Resurrection.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏من نِيح عليه، فإنه يُعذب بما نِيح عليه يوم القيامة‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1660
    },
    {
      "hadithNumber": 1661,
      "english": {
        "narrated": "Umm 'Atiyyah (May Allah be pleased with her) said:",
        "hadith": "At the time of giving the pledge of allegiance, the Messenger of Allah (ﷺ) took from us an oath that we would not wail.[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أم عطية نَُسيبة -بضم النون وفتحها- رضي الله عنها قالت ‏:‏ أخذ علينا رسول الله صلى الله عليه وسلم  عند البيعة أن لا ننوح‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1661
    },
    {
      "hadithNumber": 1662,
      "english": {
        "narrated": "An-Nu'man bin Bashir (May Allah be pleased with them) said:",
        "hadith": "When 'Abdullah bin Rawahah (May Allah be pleased with him) became unconscious, his sister began to weep and shout: \"Alas! For the mountain among men. Alas! for such and such (mentioning his virtuous qualities).\" When he recovered his consciousness, he said: \"I was asked (disapprovingly, by the angels) about everything you said concerning me whether I am as you said.\"[Al- Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن النعمان بن بشير رضي الله عنه قال‏:‏ أغمي على عبد الله بن رواحة رضي الله عنه فجعلت أخته تبكي، وتقول‏:‏ واجبلاه، وا كذا وا كذا‏:‏ تعدد عليه  فقال حين أفاق‏:‏ ما قلت شيئًا ألا قيل لي ‏:‏أنت كذلك‏؟‏‏!‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1662
    },
    {
      "hadithNumber": 1663,
      "english": {
        "narrated": "Ibn 'Umar (May Allah be pleased with them) said:",
        "hadith": "The Messenger of Allah (ﷺ) visited Sa'd bin 'Ubadah during his illness. He was accompanied by 'Abdur-Rahman bin 'Auf, Sa'd bin Abu Waqqas and 'Abdullah bin Mas'ud (May Allah be pleased with them). When they entered his house, they found him unconscious. The Messenger of Allah asked, \"Has he died?\" They replied: \"No, O Messenger of Allah.\" Hearing this the Messenger of Allah (ﷺ) began to weep. When his Companions saw this, they also began to weep too. He said, \"Listen attentively: Allah does not punish for the shedding of tears or the grief of the heart, but takes to task or show mercy because of the utterances of this (and he pointed to his tongue).\"[Al- Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن ابن عمر رضي الله عنهما قال‏:‏ اشتكى سعد بن عبادة رضي الله عنه شكوى فأتاه رسول الله صلى الله عليه وسلم  يعوده مع عبد الرحمن بن عوف، وسعد بن أبي وقاص، وعبد الله بن مسعود رضي الله عنهم، فلما دخل عليه، وجده في غشية فقال‏:‏ ‏\"‏أقضي‏؟‏‏\"‏ قالوا‏:‏ لا يا رسول الله فبكى رسول الله صلى الله عليه وسلم  فلما رأى القوم بكاء النبي صلى الله عليه وسلم  بكوا، قال‏:‏ ‏\"‏ألا تسمعون‏؟‏ إن الله لا يُعذب بدمع العين، ولا بحزن القلب، ولكن يعذب بهذا‏\"‏ وأشار إلى لسانه ‏\"‏أو يرحم‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1663
    },
    {
      "hadithNumber": 1664,
      "english": {
        "narrated": "Abu Malik Al-Ash'ari (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"If the wailing woman does not repent before she dies, she will be made to stand on the Day of Resurrection wearing a garment of pitch and a garment of scabies (Allah knows the nature thereof).\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏النائحة إذا لم تتب قبل موتها تقام يوم القيامة وعليها سربال من قطران، ودرع من جرب‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1664
    },
    {
      "hadithNumber": 1665,
      "english": {
        "narrated": "Asid bin Abu Usaid reported:",
        "hadith": "A woman who had taken a pledge of allegiance at the hand of the Messenger of Allah (ﷺ) said: \"Among the matters in respect of which we gave the Messenger of Allah (ﷺ) the pledge not to disobey him in any Ma'ruf [i.e., all that Islam ordains (V:60:12)] was that we should not slap our faces, bewail, tear our clothes up and tear out our hair (in grief).\"[Abu Dawud].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أسيد بن أبي أسيد التابعي عن امرأة من المبايعات قالت‏:‏ كان فيما أخذ علينا رسول الله صلى الله عليه وسلم، في المعروف الذي أخذ علينا أن لا نعصيه فيه‏:‏ أن لا نخمش وجهًا، ولا ندعو ويلا، ولا نشق جيبًا، وأن لا ننشر شعرًا‏\"‏‏. ((رواه أبو داود بإسناد حسن  ))‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1665
    },
    {
      "hadithNumber": 1666,
      "english": {
        "narrated": "Abu Musa (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"If anyone dies and the mourner gets up and says: 'Alas! For the mountain among men. Alas! For the chief ...' and such like, Allah will put two angels in charge of him who will beat on the breast and ask him (disapproving): 'Were you like that?' \"[At- Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ما من ميت يموت، فيقوم باكيهم، فيقول‏:‏ واجبلاه، وأسيداه، أو نحو ذلك إلا وكل به ملكان يلهزانه‏:‏ أهكذا كنت‏؟‏‏!‏‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1666
    },
    {
      "hadithNumber": 1667,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Two things are signs of disbelief on the part of those who indulge in them: Slandering one's lineage and wailing over the dead.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏اثنان في الناس هما بهم كفر‏:‏ الطعن في النسب، والنياحة على الميت‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1667
    },
    {
      "hadithNumber": 1668,
      "english": {
        "narrated": "'Aishah (May Allah be pleased with her) said:",
        "hadith": "Some people asked the Messenger of Allah (ﷺ) about soothsayers. He (ﷺ) said, \"They are of no account.\" Upon this they said to him, \"O Messenger of Allah! But they sometimes make true predictions.\" Thereupon the Messenger of Allah (ﷺ) said, \"That is a word pertaining to truth which a jinn snatches (from the angels) and whispers into the ears of his friend (the soothsayers) who will then mix more than a hundred lies with it.\"[Al-Bukhari and Muslim].The narration in Al-Bukhari is: \"The angels descend in the clouds and mention matters which has been decreed in heaven; Satan steals a hearing (listens to it stealthily) and communicates it to the soothsayers who tell along with it a hundred lies.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن عائشة رضي الله عنها قالت‏:‏ سأل رسول الله صلى الله عليه وسلم  أناس عن الكهان، فقال‏:‏ ‏\"‏ليسوا بشيء‏\"‏ فقالوا‏:‏ يا رسول الله إنهم يحدثونا أحيانًا بشيء، فيكون حقًا‏؟‏ فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏تلك الكلمة من الحق يخطفها الجني‏.‏ فيقرها في أذن وليه، فيخلطون معها مائة كذبة‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏  \nوفي رواية للبخاري عن عائشة رضي الله عنها أنها سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏\"‏إن الملائكة تنزل في العَنان -وهو السحاب-‏.‏ فتذكر الأمر قضي في السماء، فيسترق الشيطان السمع، فيسمعه، فيوحيه إلى الكهان، فيكذبون معها مائة كذبة من عند أنفسهم‏\"‏‏ \nقَولُهُ: «فَيَقُرُّهَا» هو بفتح الياء وضم القاف والراء، أي: يُلْقِيها، «والعَنانِ» بفتح العين.",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1668
    },
    {
      "hadithNumber": 1669,
      "english": {
        "narrated": "",
        "hadith": "Narrated Safiyyah, daughter of Abu 'Ubaid, on the authority of some of the wives of the Prophet (ﷺ) who said, \"He who goes to one who claims to tell about matters of the Unseen and believes in him, his Salat (prayers) will not be accepted for forty days.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏من أتي عرافًا فسأله عن شيء، فصدقه، لم تقبل له صلاة أربعين يومًا‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1669
    },
    {
      "hadithNumber": 1670,
      "english": {
        "narrated": "Qabisah bin Al-Mukhariq (May Allah be pleased with him) said:",
        "hadith": "I heard the Messenger of Allah (ﷺ) saying, \"The practice of 'Iyafah, the interpretation of omens from the flight of birds, the practice of divination by drawing lines on the ground and taking evil omens are all practices of Al-Jibt (the idol, the diviner, or sorcerer).\"[Abu Dawud].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏العِيافة، والطِّيَرة، والطرق، من الجبت‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1670
    },
    {
      "hadithNumber": 1671,
      "english": {
        "narrated": "Ibn 'Abbas (May Allah be pleased with them) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"He who acquires a branch of the knowledge of astrology, learns a branch of magic (of which he acquires more as long as) he continues to do so.\"[Abu Dawud].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏من اقتبس علمًا من النجوم، اقتبس شعبة من السحر زاد ما زاد‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1671
    },
    {
      "hadithNumber": 1672,
      "english": {
        "narrated": "Mu'awiyah bin Al-Hakam (May Allah be pleased with him) reported:",
        "hadith": "I said: \"O Messenger of Allah, I have recently emerged from ignorance and Allah has favoured me with Islam. There are still some men among us who visit the soothsayers to consult them (on matters relating to the future).\" He (ﷺ) replied, \"Do not visit them.\" I said: \"There are some men who are guided by omens.\" He replied, \"These are the ideas which come up in their minds but you should not be influenced by them (i.e., these things) should not prevent them from pursuing their works.\" I said: \"There are some men who practise divination by drawing lines on the ground.\" The Messenger of Allah (ﷺ) replied, \"There was a Prophet who drew lines, the line which agrees with the line drawn by that Prophet would be correct.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن معاوية بن الحكم رضي الله عنه قال‏:‏ قلت يا رسول الله إني حديث عهد بجاهلية، وقد جاء الله تعالى بالإسلام، وإن منا رجالا يأتون الكهان‏؟‏ قال‏:‏ ‏\"‏فلا تأتهم‏\"‏ قلت‏:‏ ومنا رجال يتطيرون‏؟‏ قال‏:‏ ‏\"‏ذلك شيء يجدونه في صدورهم، فلا يصدهم‏\"‏ قلت‏:‏ ومنا رجال يخطون‏؟‏ قال‏:‏ ‏\"‏كان نبي من الأنبياء يخط، فمن وافق خطه، فذاك‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1672
    },
    {
      "hadithNumber": 1673,
      "english": {
        "narrated": "Abu Mas'ud Al-Badri (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) prohibited the price of a dog, the earning of an prostitute, and the money given to a soothsayer.[Al- Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏نهى عن ثمن الكلب، ومهر البغي وحُلوان الكاهن‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1673
    },
    {
      "hadithNumber": 1674,
      "english": {
        "narrated": "Anas (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Not the transmission of disease of one person to another and no evil omen, but I am pleased with good omens.\" He was asked: \"What is good omen?\" He replied, \"A good word.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن أنس رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏لا عدوى ولا طِيَرة ويعجبني الفأل‏\"‏ قالوا‏:‏ وما الفأل‏؟‏ قال‏:‏ ‏\"‏كلمة طيبة‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1674
    },
    {
      "hadithNumber": 1675,
      "english": {
        "narrated": "Ibn 'Umar (May Allah be pleased with them) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"There is no infection and no evil omen; but if there is anything (that may be a source of trouble) then it could be a house, a horse, and a woman.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا عدوى ولا طِيَرة، وإن كان الشؤم في شيء ففي الدار والمرأة، والفرس‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1675
    },
    {
      "hadithNumber": 1676,
      "english": {
        "narrated": "Buraidah (May Allah be pleased with him) said:",
        "hadith": "The Prophet never took ill omens.[Abu Dawud].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن بريدة رضي الله عنه أن النبي صلى الله عليه وسلم  كان لا يتطير‏.‏ ‏(‏‏(‏رواه أبو داود بإسناد صحيح‏)‏‏)‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1676
    },
    {
      "hadithNumber": 1677,
      "english": {
        "narrated": "'Urwah bin 'Amir (May Allah be pleased with him) said:",
        "hadith": "When talking of omens was mentioned in the presence of the Messenger of Allah (ﷺ) he said, \"The best type of omen is the good omen.\" He added, \"A Muslim should not refrain from anything because of an omen.\" He (ﷺ) told them, \"When any of you sees anything which he dislikes, he should say: 'Allahuma la ya'ti bil-hasanati illa Anta, wa la yadfa'us- sayyi'ati illa Anta, wa la hawla wa la quwwata illa Bika (O Allah ! You Alone bring good things; You Alone avert evil things, and there is no might or power but in You).\"'[Abu Dawud with Sahih Isnad].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏أحسنها الفأل، ولا ترد مسلمًا فإذا رأى أحدكم ما يكره، فليقل‏:‏ اللهم لا يأتي بالحسنات إلا أنت، ولا يدفع السيئات إلا أنت، ولا حول ولا قوة إلا بك‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1677
    },
    {
      "hadithNumber": 1678,
      "english": {
        "narrated": "Ibn 'Umar (May Allah be pleased with them) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Those who draw pictures will be punished on the Day of Resurrection; and it will be said to them: 'Breathe soul into what you have created.\"'[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إن الذين يصنعون هذه الصور يعذبون يوم القيامة، يقال لهم‏:‏ أحيوا ما خلقتم‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1678
    },
    {
      "hadithNumber": 1679,
      "english": {
        "narrated": "'Aishah (May Allah be pleased with her) said:",
        "hadith": "The Messenger of Allah (ﷺ) visited me after returning from a journey, and I had a shelf with a thin cloth curtain hanging over it and on which there were portraits. When he saw it, the colour of his face changed (because of anger) and he said, \"O 'Aishah! the most grievous torment from Allah on the Day of Resurrection will be for those who imitate (Allah) in the act of His creation.\" 'Aishah said: We tore it into pieces and made a cushion or two cushions out of that.[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏يا عائشة، أشد الناس عذابًا عن الله يوم القيامة الذين يضاهون بخلق الله‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1679
    },
    {
      "hadithNumber": 1680,
      "english": {
        "narrated": "Ibn 'Abbas (May Allah be pleased with them) said:",
        "hadith": "I heard the Messenger of Allah (ﷺ) saying, \"Every painter will go to Hell, and for every portrait he has made, there will be appointed one who will chastise him in the Hell.\" Ibn 'Abbas said: If you have to do it, draw pictures of trees and other inanimate things.[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن ابن عباس رضي الله عنهما قال‏:‏ سمعت رسول الله صلى الله عليه وسلم  يقول‏:‏ ‏\"‏كل مصور في النار يجعل له بكل صورة صورها نفس فيعذبه في جهنم‏\"‏ قال ابن عباس‏:‏ فإن كنت لابد فاعلا، فاصنع الشجر وما لا ورح فيه‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1680
    },
    {
      "hadithNumber": 1681,
      "english": {
        "narrated": "Ibn 'Abbas (May Allah be pleased with them) said:",
        "hadith": "I heard the Messenger of Allah (ﷺ) saying, \"Whosoever makes a picture, will be punished on the Day of Resurrection, and will be asked to infuse soul therein, which he will not be able to do.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏من صور في الدنيا، كُلف أن يَنفخ فيها الروح يوم القيامة وليس بنافخ‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1681
    },
    {
      "hadithNumber": 1682,
      "english": {
        "narrated": "Ibn Mas'ud (May Allah be pleased with him) said:",
        "hadith": "I heard the Messenger of Allah (ﷺ) saying, \"Those who will receive the most severe punishment from Allah on the Day of Resurrection will be painters (of living objects).\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إن أشد الناس عذابًا يوم القيامة المصورون‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1682
    },
    {
      "hadithNumber": 1683,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"The Almighty Allah said: 'Who is more an oppressor than him who goes to create like My creation? Let him make an ant or a grain of corn or a grain of barley.\"'[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏قال الله تعالى‏:‏ ‏{‏ومن أظلم ممن ذهب يخلق كخلقي‏!‏ فليخلقوا ذرة أو ليخلقوا حبة، أو ليخلقوا شعيرة‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1683
    },
    {
      "hadithNumber": 1684,
      "english": {
        "narrated": "Abu Talhah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"The angels do not enter a house in which there is a dog or a portrait.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا تدخل الملائكة بيتًا فيه كلب ولا صورة‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1684
    },
    {
      "hadithNumber": 1685,
      "english": {
        "narrated": "Ibn 'Umar (May Allah be pleased with them) said:",
        "hadith": "Jibril (Gabriel) promised to visit the Messenger of Allah (ﷺ) but delayed and this grieved him very much. When he came out of his house, Jibril met him. The Messenger of Allah (ﷺ) asked him about the reason of delay, and he replied: \"We do not enter a house in which there is a dog or a portrait.\"[Al-Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏راث‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1685
    },
    {
      "hadithNumber": 1686,
      "english": {
        "narrated": "'Aishah (May Allah be pleased with her) said:",
        "hadith": "Jibril (Gabriel) (ﷺ) made a promise with the Messenger of Allah (ﷺ) to come at a definite hour; that hour came but he did not visit him. There was a staff in the hand of the Messenger of Allah (ﷺ). He threw it from his hand and said, \"Never does Allah back out of His Promise, nor do His messengers.\" Then he noticed a puppy under his bed and said, \"O 'Aishah, when did this dog enter?\" She said: \"By Allah, I don't know.\" He then commanded that it should be turned out. No sooner than had they expelled it, Jibril came and the Messenger of Allah (ﷺ) said to him, \"You promised to visit me. I waited for you but you did not come.\" Whereupon he said: \"The dog kept me from coming. We do not enter a house in which there is a dog or a picture.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن عائشة رضي الله عنها قالت‏:‏ واعد رسول الله صلى الله عليه وسلم  جبريل عليه السلام في ساعة أن يأتيه، فجاءت تلك الساعة ولم يأته‏!‏ قالت‏:‏ وكان بيده عصًا، فطرحها من يده وهو يقول‏:‏ ‏\"‏ما يخلف الله وعده ولا رسله‏\"‏ ثم التفت، فإذا جرو كلب تحت سريره‏.‏ فقال‏:‏ ‏\"‏متى دخل هذا الكلب‏؟‏‏\"‏ فقلت‏:‏ والله ما دريت به، فأمر به فأخرج، فجاءه جبريل عليه السلام‏:‏ فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏وعدتني، فجلست لك ولم تأتني‏\"‏ فقال‏:‏ منعني الكلب الذي كان في بيتك، إنا لا ندخل بيتًا فيه كلب ولا صورة‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1686
    },
    {
      "hadithNumber": 1687,
      "english": {
        "narrated": "Abul-Haiyaj Haiyan bin Husain said:",
        "hadith": "'Ali bin Abu Talib (May Allah be pleased with him) said to me: \"Shall I not send you to do a task that the Messenger of Allah (ﷺ) had assigned to me? Spare no portrait unwiped out, and leave not a high grave unlevelled.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي الهياج حيان بن حصين قال‏:‏ قال لي علي بن أبي طالب رضي الله عنه‏:‏ ألا أبعثك على ما بعثني عليه رسول الله صلى الله عليه وسلم ‏؟‏ أن لا تدع صورة إلا طمستها، ولا قبرًا مشرفًا إلا سويته‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1687
    },
    {
      "hadithNumber": 1688,
      "english": {
        "narrated": "Ibn 'Umar (May Allah be pleased with them) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"He who keeps a dog other than one for guarding the fields or herds or hunting, will lose two Qirat every day out of his rewards.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏من اقتنى كلبًا إلا كلب صيد أو ماشية فإنه ينقص فإنه ينقص من أجره كل يوم قيراطان‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1688
    },
    {
      "hadithNumber": 1689,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"He who keeps a dog, will lose out of his good deeds equal to one Qirat every day, except one who keeps it for guarding the fields or the herd.\"[Al-Bukhari and Muslim].In a narration of Muslim, the Messenger of Allah (ﷺ) is reported to have said: \"He who keeps a dog for any reason other than to guard his property (lands) or his flock of sheep, his good deeds equal to two Qirat will be deducted every day.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏من أمسك كلبًا فإنه ينقص كل يوم من عمله قيراط إلا كلب حرث أو ماشية‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏  \nوفي رواية لمسلم‏:‏ ‏\"‏من اقتنى كلبًا ليس بكلب صيد، ولا ماشية ولا أرض، فإنه ينقص من أجره قيراطان كل يوم‏\"‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1689
    },
    {
      "hadithNumber": 1690,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Angels do not accompany the travellers who have with them a dog or a bell.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا تصحب الملائكة رفقة كلب أو جرس‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1690
    },
    {
      "hadithNumber": 1691,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Prophet (ﷺ) said, \"The bell is one of the musical instruments of Satan.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏الجرس مزامير الشيطان‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1691
    },
    {
      "hadithNumber": 1692,
      "english": {
        "narrated": "Ibn 'Umar (May Allah be pleased with them) said:",
        "hadith": "The Messenger of Allah (ﷺ) prohibited riding a camel which eats dung, or animal or human waste.[Abu Dawud].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن ابن عمر رضي الله عنهما قال‏:‏ نهى رسول الله صلى الله عليه وسلم  عن الجلالة في الإبل أن يركب عليها‏.‏ ((رواه أبو داود بإسناد صحيح ))",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1692
    },
    {
      "hadithNumber": 1693,
      "english": {
        "narrated": "Anas bin Malik (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Spitting in the mosque is a sin, and its expiation is that the spittle should be buried in earth.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏البصاق في المسجد خطيئة، وكفارتها دفنها‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1693
    },
    {
      "hadithNumber": 1694,
      "english": {
        "narrated": "'Aishah (May Allah be pleased with her) said:",
        "hadith": "The Messenger of Allah (ﷺ) saw spittle or snot or sputum, sticking to the wall towards Qiblah and scratched it off.[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن عائشة رضي الله عنها أن رسول الله صلى الله عليه وسلم رأى في جدار القبلة مخاطا أو بزاقا أو نخامة فحكه ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1694
    },
    {
      "hadithNumber": 1695,
      "english": {
        "narrated": "Anas (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"It is not proper to use the mosque for urinating or easing oneself. They are merely built for the remembrance of Allah and the recitation of the Qur'an\", or as he stated.[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إن هذه المساجد لا تصلح لشيء من البول ولا القذر، إنما هي لذكر الله تعالى، وقراءة القرآن‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1695
    },
    {
      "hadithNumber": 1696,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"If anyone hears a man inquiring in the mosque about something he has lost, he should say: 'La raddaha Allahu 'alaika (May Allah not restore it to you),' for mosques are not built for this purpose.\"[Muslim]",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏من سمع رجلا ينشد ضالة في المسجد فليقل‏:‏ لا ردها الله عليك، فإن المساجد لم تبنَ لهذا‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1696
    },
    {
      "hadithNumber": 1697,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah said, \"When you see someone buying or selling in the mosque, say to him: 'La arbaha-Allahu tijarataka (May Allah not make your bargain profitable)!' When you see someone announcing something lost in it, say: 'May Allah not restore it to you!\"'[At-Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إذا رأيتم من يبيع أو يبتاع في المسجد، فقولوا‏:‏ لا أربح الله تجارتك، وإذا رأيتم من ينشد ضالة فقولوا‏:‏ لا ردها الله عليك‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1697
    },
    {
      "hadithNumber": 1698,
      "english": {
        "narrated": "Buraidah (May Allah be pleased with him) said:",
        "hadith": "A man announced (the loss of his camel) in the mosque, uttering these words: \"Has any one seen my red camel?\" Upon this the Messenger of Allah (ﷺ) said, \"May it not be restored to you! The mosques are built for what they are meant to be (i.e., prayer, remembrance of Allah, acquiring knowledge, etc.).\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا وجدت، إنما بنيت المساجد لم بنيت له‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1698
    },
    {
      "hadithNumber": 1699,
      "english": {
        "narrated": "'Amr bin Shu'aib on the authority of his grandfather (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) prohibited (us) from buying and selling in the mosque; (he also prohibited us from) making announcement in it about something lost and from reciting poems in it.[Abu Dawud and At- Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن عمرو بن شعيب، عن أبيه، عن جده رضي الله عنه أن رسول الله صلى الله عليه وسلم  نهى عن الشراء والبيع في المسجد، وأن تنشد فيه ضالة، أو ينشد فيه شعر‏.‏ ‏(‏‏(‏رواه أبو داود، والترمذي وقال حديث حسن‏)‏‏)‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1699
    },
    {
      "hadithNumber": 1700,
      "english": {
        "narrated": "As-Sa'ib bin Yazid (May Allah be pleased with him) said:",
        "hadith": "While I was in the mosque, someone threw a pebble at me, and when I looked up, I saw that it was 'Umar bin Al-Khattab, who said: \"Go and call me these two men.\" I brought them and 'Umar (May Allah be pleased with him) asked them: \"Where are you from?\" On their replying that they belonged to At-Taif, he said: \"Had you been the inhabitants of Al-Madinah, I would have given you a beating for raising your voices in the mosque of the Messenger of Allah (ﷺ).\"[Al- Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن السائب بن زيد الصحابي رضي الله عنه قال‏:‏ كنت في المسجد فحصبني رجل، فنظرت فإذا عمر بن الخطاب رضي الله عنه فقال‏:‏ اذهب فائتني بهذين، فجئته بهما، فقال‏:‏ من أين أنتما‏؟‏ فقالا‏:‏ من أهل الطائف، فقال‏:‏ لو كنتما من أهل البلد، لأوجعتكما، ترفعان أصواتكما في مسجد رسول الله صلى الله عليه وسلم  ‏!‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1700
    },
    {
      "hadithNumber": 1701,
      "english": {
        "narrated": "Ibn 'Umar (May Allah be pleased with them) said:",
        "hadith": "The Prophet (ﷺ) said, \"He who has eaten garlic should not come to our mosque.\"[Al-Bukhari and Muslim].The narration in Muslim is: \"He who has eaten garlic should not come to our mosques.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن ابن عمر رضي الله عنه أن النبي صلى الله عليه وسلم  قال‏:‏ ‏\"‏من أكل من هذه الشجرة -يعني الثوم- فلا يقربن مسجدنا‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ وفي رواية لمسلم‏:‏ ‏\"‏مساجدنا‏\"‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1701
    },
    {
      "hadithNumber": 1702,
      "english": {
        "narrated": "Anas (May Allah be pleased with him) said:",
        "hadith": "The Prophet (ﷺ) said, \"He who has eaten from this plant (i.e., garlic) should not approach us and should not offer Salat (prayer) along with us.\"[Al- Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏من أكل من هذه الشجرة، فلا يقربنا، ولا يصلين معنا‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1702
    },
    {
      "hadithNumber": 1703,
      "english": {
        "narrated": "Jabir (May Allah be pleased with him) said:",
        "hadith": "The Prophet (ﷺ) said, \"He who has eaten garlic or onion should keep away from us or our mosques.\"[Al-Bukhari and Muslim].The narration in Muslim is: \"He who has eaten onion or garlic or leek should not approach our mosque, because the angels are also offended by the strong smells) that offend the children of Adam.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن جابر رضي الله عنه قال‏:‏ قال النبي صلى الله عليه وسلم ‏:‏ ‏\"‏من أكل ثومًا أو بصلا فليعتزلنا، أو فليعتزل مسجدنا‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏  \nوفي رواية لمسلم‏:‏ ‏\"‏من أكل البصل، والثوم، الكراث، فلا يقربن مسجدنا، فإن الملائكة تتأذى مما يتأذى منه بنو آدم‏\"‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1703
    },
    {
      "hadithNumber": 1704,
      "english": {
        "narrated": "It has been narrated that 'Umar (May Allah be pleased with him) said in the sermon of Friday prayer:",
        "hadith": "\"O you people! You eat garlic and onion. I think the odour of these to be very offensive. I saw that if the Messenger of Allah (ﷺ) happened to find a man with such offensive odour in the mosque, he would order him to be taken out of the mosque and sent to Al-Baqi'. He who wants to eat any of these, should cook them till their odour dies out.[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن عمر بن الخطاب رضي الله عنه أنه خطب يوم الجمعة فقال في خطبته‏:‏ ثم إنكم أيها الناس تأكلون شجرتين ما أراهما إلا خبيثتين‏:‏ البصل، والثوم -لقد رأيت رسول الله صلى الله عليه وسلم  إذا وجد ريحهما من الرجل في المسجد أمر به، فأخرج إلى البقيع، فمن أكلهما، فليمتهما طبخًا‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1704
    },
    {
      "hadithNumber": 1705,
      "english": {
        "narrated": "Mu'adh bin Anas Al-Juhani (May Allah be pleased with him) said:",
        "hadith": "The Prophet (ﷺ) forbade (us) from sitting with our legs drawn up to our belly (Ihtiba') during the Friday Khutbah (religious talk before the prayer).[Abu Dawud and At-Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن معاذ بن أنس الجهني، رضي الله عنه، أن النبي صلى الله عليه وسلم نهى عن الحبوة يوم الجمعة والإمام يخطب ‏(‏‏(‏رواه أبو داود والترمذي وقالا‏:‏ حديث حسن‏)‏‏)‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1705
    },
    {
      "hadithNumber": 1706,
      "english": {
        "narrated": "Umm Salamah (May Allah be pleased with her) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"When anyone of you intends to sacrifice the animal and enter in the month of Dhul-Hijjah, he should not get his hair cut or nails pared till he has offered his sacrifice.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏من كان له ذبح يذبحه، فإذا أهل هلال ذي الحجة، فلا  يأخذن من شعره ولا من أظفاره شيئًا حتى يضحي‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1706
    },
    {
      "hadithNumber": 1707,
      "english": {
        "narrated": "Ibn 'Umar (May Allah be pleased with them) said:",
        "hadith": "The Prophet (ﷺ) said, \"Allah has prohibited you from taking an oath by your fathers. He who must take an oath, may do so by swearing in the Name of Allah or he should remain silent.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن ابن عمر، رضي الله عنهما، عن النبي صلى الله عليه وسلم ، قال‏:‏ ‏\"‏إن الله تعالى ينهاكم أن تحلفوا بآبائكم، فمن كان حالفًا، فليحلف بالله، أو ليصمت‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏  \nوفي رواية في الصحيح ‏\"‏فمن كان حالفًا فلا يحلف إلا بالله أو ليسكت‏\"‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1707
    },
    {
      "hadithNumber": 1708,
      "english": {
        "narrated": "'Abdur-Rahman bin Samurah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Swear neither by the name of Taghut (i.e., false deities, false leaders, etc.) nor by your fathers.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن عبد الرحمن بن سَمُرَة، رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏لا تحلفوا بالطواغي، ولا بآبائكم‏\"‏‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ \n‏\"‏الطواغي‏\"‏‏:‏ جمع طاغية، وهي الأصنام، ومنه الحديث‏:‏ ‏\"‏هذه طاغية دوس‏\"‏‏:‏ أي‏:‏ صنمهم ومعبودهم، وروي في غير مسلم‏:‏ ‏\"‏بالطواغيت‏\"‏ جمع طاغوت، وهو الشيطان والصنم‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1708
    },
    {
      "hadithNumber": 1709,
      "english": {
        "narrated": "Buraidah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"He who swears by Amanah (trust) is not one of us.\"[Abu Dawud with authentic Isnad].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏من حلف بالأمانة، فليس منا‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1709
    },
    {
      "hadithNumber": 1710,
      "english": {
        "narrated": "Buraidah (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"If anyone swears that in such and such case he will be free from Islam and afterwards he turns out to be a liar, he will be as he has sworn; but if he is speaking the truth, he will not revert safely to Islam.\"[Abu Dawud].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏من حلف فقال‏:‏ إني بريء من الإسلام، فإن كان كاذبًا، فهو كما قال، وإن كان صادقًا، فلن يرجع إلى الإسلام سالمًا‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1710
    },
    {
      "hadithNumber": 1711,
      "english": {
        "narrated": "Ibn 'Umar (May Allah be pleased with them) said:",
        "hadith": "I heard a man saying: \"No, by the Ka'bah.\" I admonished him: \"Do not swear by any thing besides Allah, for I heard the Messenger of Allah (ﷺ) saying, 'He who swears by anyone or anything other than Allah, has indeed committed an act of Kufr or Shirk'.\"[At- Tirmidhi].[Some 'Ulama' are of the opinion that the words of the Prophet (ﷺ) that \"He who swears by anyone or anything other than Allah has indeed committed an act of Kufr or Shirk,\" are in the nature of extreme admonition. And in fact, it is not Shirk. The same applies to the saying of the Prophet (ﷺ), who said, \"showing off is Shirk.\"]",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن ابن عمر رضي الله عنهما أنه سمع رجلا يقول‏:‏ لا والكعبة، قال ابن عمر‏:‏ لا تحلف بغير الله، فإني سمعت رسول الله صلى الله عليه وسلم  يقول‏:‏ ‏\"‏من حلف بغير الله، فقد كفر أو أشرك‏\"‏‏.‏‏(‏‏(‏ رواه الترمذي وقال حديث حسن‏)‏‏)‏\tوفسر بعض العلماء قوله‏:‏ ‏\"‏كفر أو أشرك‏\"‏ على التغليظ، كما روي أن النبي صلى الله عليه وسلم  قال‏:‏ ‏\"‏الرياء شرك‏\"‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1711
    },
    {
      "hadithNumber": 1712,
      "english": {
        "narrated": "Ibn Mas'ud (May Allah be pleased with him) said:",
        "hadith": "The Prophet (ﷺ) said, \"He who takes oath to acquire the property of a Muslim unjustly will meet Allah and He will be angry with him\" then he recited:\"Verily, those who purchase a small gain at the cost of Allah's Covenant and their oaths, they shall have no portion in the Hereafter. Neither will Allah speak to them nor look at them on the Day of Resurrection nor will He purify them, and they shall have a painful torment.\" (3:77)[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏من خلف على مال امرئ مسلم بغير حقه، لقي الله وهو عليه غضبان‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1712
    },
    {
      "hadithNumber": 1713,
      "english": {
        "narrated": "Abu Umamah Iyas bin Tha'labah Al-Harithi (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"He who misappropriates the right of a Muslim by taking a false oath, Allah will condemn him to the fire of Hell and will forbid Jannah for him.\" A person asked: \"O Messenger of Allah, even if it is something insignificant?\" He replied, \"Yes, even if it is the twig of the Arak tree.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي أُمامة إياس بن ثعلبة الحارثي رضي الله عنه أن رسول الله صلى الله عليه وسلم  قال‏:‏ ‏\"‏من اقتطع حق امرئ مسلم بيمينه، فقد أوجب الله له النار‏.‏ -وحرم عليه الجنة‏\"‏ فقال له رجل‏:‏ وإن كان شيئًا يسيرًا يا رسول الله‏؟‏ قال‏:‏ ‏\"‏وإن كان قضيبًا من أراك‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1713
    },
    {
      "hadithNumber": 1714,
      "english": {
        "narrated": "'Abdullah bin 'Amr bin Al-As (May Allah be pleased with them) said:",
        "hadith": "The Prophet (ﷺ) said, \"Of the major sins are: Associating anything in worship with Allah, disobedience to the parents, killing without justification and taking a false oath (intentionally).\"[Al- Bukhari].Another narration is: A bedouin came to the Prophet (ﷺ) and asked him: \"O Messenger of Allah, what are the cardinal sins?\" He (ﷺ) replied, \"Associating anything with Allah in worship.\" The man asked: \"(What is) next?\" The Messenger of Allah (ﷺ) replied, \"Al-Yamin Al-Ghamus.\" He asked: \"What do you mean by Al-Yamin Al-Ghamus?\" The Messenger of Allah (ﷺ) replied, \"Swearing falsely to usurp the property of a Muslim.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏الكبائر‏:‏ الإشراك بالله، وعقوق الوالدين، وقتل النفس، واليمين الغموس‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1714
    },
    {
      "hadithNumber": 1715,
      "english": {
        "narrated": "'Abdur-Rahman bin Samurah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said to me, \"When you take an oath and consider something else to be better than it, make expiation for your oath and choose the better alternative.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏وإذا حلفت على يمين، فرأيت غيرها خيرًا منها، فائت الذي هو خير، وكفر عن يمينك‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1715
    },
    {
      "hadithNumber": 1716,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"When you swear an oath and consider something else to be better than it, make expiation for your oath and do the thing that is better.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏من حلف على يمين، فرأى غيرها خيرًا منها، فليكفر عن يمينه، وليفعل الذي هو خير‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1716
    },
    {
      "hadithNumber": 1717,
      "english": {
        "narrated": "Abu Musa (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Verily, I swear by Allah, if Allah wills, I shall not swear to do something but that if I consider something else to be better than it, then I shall make expiation for my oath and adopt the thing that is better.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إني والله إن شاء الله لا أحلف على يمين، ثم أرى خيرًا منها إلا كفرت عن يميني، وأتيت الذي هو خير‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1717
    },
    {
      "hadithNumber": 1718,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Persistence in respect of his oath about his family is more sinful with Allah than the payment of its expiation prescribed by Allah.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏لأن يلج أحدكم في يمينه في أهله آثم له عند الله تعالى من أن يعطي كفارته التي فرض الله عليه‏\"‏‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ قوله‏:‏ ‏\"‏يلَجّ‏\"‏ بفتح اللام، وتشديد الجيم‏:‏ أي يتمادى فيها، ولا يكفر، قوله‏:‏ ‏\"‏آثم‏\"‏ هو بالثاء المثلثة، أي‏:‏ أكثر إثمًا‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1718
    },
    {
      "hadithNumber": 1719,
      "english": {
        "narrated": "'Aishah (May Allah be pleased with her) reported:",
        "hadith": "The Ayah: \"Allah will not punish you for what is unintentional in your oaths ...\" was revealed in respect of those persons who are in the habit of repeating: 'No, by Allah'; and 'Yes, by Allah.'[Al- Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن عائشة رضي الله عنها قالت‏:‏ أنزلت هذه الآية‏:‏ ‏{‏لا يؤاخذكم الله باللغو في أيمانكم‏}‏ في قول الرجل‏:‏ لا والله، وبلى والله‏.‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1719
    },
    {
      "hadithNumber": 1720,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "I heard the Messenger of Allah (ﷺ) saying, \"Swearing produces a ready sale for a commodity, but blots out the blessing.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏الحلف منفقة للسلعة، ممحقة للكسب‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1720
    },
    {
      "hadithNumber": 1721,
      "english": {
        "narrated": "Abu Qatadah (May Allah be pleased with him) said:",
        "hadith": "I heard the Messenger of Allah (ﷺ) saying, \"Beware of excessive swearing in sale, because it may promote trade but this practice will eliminate the blessing.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إياكم وكثرة الحلف في البيع، فإنه ينفق ثم يمحق‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1721
    },
    {
      "hadithNumber": 1722,
      "english": {
        "narrated": "Jabir (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"No one should ask in the Face of Allah for anything except Jannah.\"[Abu Dawud].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا يسأل بوجه الله إلا الجنة‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1722
    },
    {
      "hadithNumber": 1723,
      "english": {
        "narrated": "Ibn 'Umar (May Allah be pleased with them) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Grant shelter to him who begs for it in the Name of Allah, give to him who begs in the Name of Allah, accept the invitation of him who invites you, and requite him who does a favour to you, but if you are unable to requite him, go on praying for him till you are sure that you have requited him adequately.\"[Abu Dawud and An- Nasa'i].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏من استعاذ بالله فأعيذوه، ومن سأل بالله، فأعطوه، ومن دعاكم فأجيبوه، ومن صنع إليكم معروفًا فكافئوه، فإن لم تجدوا ما تكافئونه به، فادعوا له حتى تروا أنكم قد كافأتموه‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1723
    },
    {
      "hadithNumber": 1724,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Prophet (ﷺ) said, \"The most disgraceful man near Allah is a man who calls himself (or likes others to call him) Malikul-Amlak (i.e., king of kings).\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إن أخنع اسم عند الله عز وجل رجل تسمى ملك الأملاك‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1724
    },
    {
      "hadithNumber": 1725,
      "english": {
        "narrated": "Buraidah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Do not address a hypocrite with the title of chief, (or similar titles of respect) for even if he deserves this title you will invite Allah's Wrath by using it for him.\"[Abu Dawud].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا تقولوا للمنافق سيد، فإنه إن يكن سيدًا، فقد أسخطتم ربكم عز وجل‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1725
    },
    {
      "hadithNumber": 1726,
      "english": {
        "narrated": "Jabir (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) visited Umm Sa'ib (or Umm Musaiyyab) and asked her, \"What ails you O Umm Sa'ib (or Umm Musaiyyab)? You are shivering.\" She replied: \"It is a fever, may Allah not bless it!\" He said to her, \"Do not revile fever, for it cleanses out the sins of the sons of Adam in the same way that a furnace removes the dirt of iron.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن جابر رضي الله عنه أن رسول الله صلى الله عليه وسلم  دخل على أم السائب، أو أم المسيب فقال‏:‏ ‏\"‏مالك يا أم السائب -أو يا أم المسيب- تزفزفين‏؟‏ ‏\"‏ قالت‏:‏ الحمى لا بارك الله فيها، فقال‏:‏ ‏\"‏لا تسبي الحمى، فإنها تذهب خطايا بني آدم، كما يذهب الكير خبث الحديد‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ «تُزَفْزِفِينَ» أيْ تَتَحَرَّكِينَ حَرَكَةً سَريعَةً، وَمَعْنَاهُ: تَرْتَعِدِين. وَهُوَ بِضَمِّ التاء وبالزاي المكررة والفاء المكررة، وَرُوِيَ أيضًا بالراء المكررة والقافينِ.",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1726
    },
    {
      "hadithNumber": 1727,
      "english": {
        "narrated": "Abul-Mundhir Ubaiy bin Ka'b (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Do not revile the wind. When you experience something abominable (about it), supplicate: 'Allahumma inna nas'aluka min khairi hadhihir-rihi, wa khairi ma fiha, wa khairi ma umirat bihi. Wa na'udhu bika min sharri hadhihir-rihi, wa sharri ma fiha, wa sharri ma umirat bihi. (O Allah, we beg of You the good of this wind and the good of that which it contains and the good of that which it has been commanded; and we seek refuge in you from the evil of this wind and the evil of that which it contains and the evil of that which it has been commanded).\"[At-Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا تسبوا الريح، فإذا رأيتم ما تكرهون، فقولوا‏:‏ اللهم إنا نسألك من خير هذه الريح وخير ما فيها وخير ما أُمرت به، ونعوذ بك من شر هذه الريح وشر ما فيها وشر ما أُمرت به‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1727
    },
    {
      "hadithNumber": 1728,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "I heard the Messenger of Allah (ﷺ) saying, \"The wind is the Blessing of Allah. Sometimes it brings His Mercy and sometimes it brings His Chastisement. When you experience it, do not revile it but beg of Allah its good; and seek Allah's Refuge against its evil.\"[Abu Dawud with good Isnad].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏الريح من روح الله، تأتي بالرحمة، وتأتي بالعذاب، فإذا رأيتموها فلا تسبوها، وسلوا الله خيرها، واستعيذوا بالله من شرها‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1728
    },
    {
      "hadithNumber": 1729,
      "english": {
        "narrated": "'Aishah (May Allah be pleased with her) said:",
        "hadith": "Whenever the wind blew strongly, The Prophet (ﷺ) would say: \"Allahumma inni as'aluka khairaha, wa khaira ma fiha, wa khaira ma ursilat bihi. Wa a'udhu bika min sharriha, wa sharri ma fiha, wa sharri ma ursilat bihi. (O Allah, I beg of You its good and the good of that which it contains and the good of the purpose for which it has been sent; and I seek Your Refuge from its evil and the evil of that which it contains and the evil of the purpose for which it has been sent).\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن عائشة رضي الله عنها قالت‏:‏ كان النبي صلى الله عليه وسلم  إذا عصفت الريح قال‏:‏ اللهم إني أسألك خيرها، وخير ما فيها، وخير ما أُرسلت به، وأعوذ بك من شرها، وشر ما فيها، وشر ما أُرسلت به‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1729
    },
    {
      "hadithNumber": 1730,
      "english": {
        "narrated": "Zaid bin Khalid Al-Juhani (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Do not revile the rooster for it wakes you up for prayer.\"[Abu Dawud].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا تسبوا الديك، فإنه يوقظ للصلاة‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1730
    },
    {
      "hadithNumber": 1731,
      "english": {
        "narrated": "Zaid bin Khalid (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) led the Fajr prayer at Al-Hudaibiyyah after a rainfall during the night. At the conclusion of prayer, he turned towards the people and said, \"Do you know what your Rubb has said?\" They replied: \"Allah and His Messenger know better.\" Upon this he remarked, \"He has said: 'Some of My slaves have entered the morning as My believers and some as unbelievers. He who said: We have had a rainfall due to the Grace and Mercy of Allah, believes in Me and disbelieves in the stars; and he who said: We have had a rainfall due to the rising of such and such star, disbelieves in Me and affirms his faith in the stars.\"'[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن زيد بن خالد رضي الله عنه قال‏:‏ صلى بنا رسول الله صلى الله عليه وسلم  صلاة الصبح بالحديبية في أثر سماء كانت من الليل، فلما انصرف أقبل على الناس، فقال‏:‏ ‏\"‏هل تدرون ماذا قال ربكم‏؟‏ ‏\"‏ قالوا‏:‏ الله ورسوله أعلم‏.‏ قال‏:‏  قال‏:‏ ‏\"‏أصبح من عبادي مؤمن بي وكافر بي ، فأما من قال‏:‏ مُطِرْنَا بفضل الله ورحمته، فذلك مؤمن بي كافر بالكواكب، وأما من قال‏:‏ مُطِرْنَا بنوء كذا وكذا، فذلك كافر بي مؤمن بالكواكب‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏\nوالسماء هنا‏:‏ المطر‏‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1731
    },
    {
      "hadithNumber": 1732,
      "english": {
        "narrated": "Ibn 'Umar (May Allah be pleased with them) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"When a person calls his brother (in Islam) a disbeliever, one of them will certainly deserve the title. If the addressee is so as he has asserted, the disbelief of the man is confirmed, but if it is untrue, then it will revert to him.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إذا قال رجل لأخيه‏:‏ يا كافر، فقد باء بها أحدهما، فإن كان كما قال وإلا رجعت عليه‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1732
    },
    {
      "hadithNumber": 1733,
      "english": {
        "narrated": "Abu Dharr (May Allah be pleased with him) said:",
        "hadith": "I heard the Messenger of Allah (ﷺ) saying, \"If somebody accuses another of disbelief or calls him the enemy of Allah, such an accusation will revert to him (the accuser) if the accused is innocent.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏من دعا رجلا بالكفر، أو قال‏:‏ عدو الله، وليس كذلك إلا حار عليه‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1733
    },
    {
      "hadithNumber": 1734,
      "english": {
        "narrated": "Ibn Mas'ud (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"A true believer does not taunt or curse or abuse or talk indecently.\"[At-Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ليس المؤمن بالطعان، ولا اللعان، ولا الفاحش، ولا البذي‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1734
    },
    {
      "hadithNumber": 1735,
      "english": {
        "narrated": "Anas (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Indecency does not leave anything untainted and decency does not leave anything ungraced and embellished.\"[At- Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ما كان الفحش في شيء إلا شانه، وما كان الحياء في شيء إلا زانه‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1735
    },
    {
      "hadithNumber": 1736,
      "english": {
        "narrated": "Ibn Mas'ud (May Allah be pleased with him) said:",
        "hadith": "The Prophet (ﷺ) said, \"Ruined are Al-Mutanatti'un.\" He repeated this thrice.[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن ابن مسعود رضي الله عنه أن النبي صلى الله عليه وسلم  قال‏:‏ ‏\"‏هلك المتنطعون‏\"‏، قالها ثلاثًا‏.‏ ‏(‏‏(‏رواه مسلم‏.‏‏\"‏المتنطعون‏\"‏‏:‏ المبالغون في الأمور‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1736
    },
    {
      "hadithNumber": 1737,
      "english": {
        "narrated": "'Abdullah bin 'Amr bin Al-As (May Allah be pleased with them) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Verily, Allah dislikes an eloquent person who rolls his tongue as a cow rolls its tongue (while eating).\"[Abu Dawud and At- Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إن الله يبغض البليغ من الرجال الذي يتخلل بلسانه كما تتخلل البقرة‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1737
    },
    {
      "hadithNumber": 1738,
      "english": {
        "narrated": "Jabir bin 'Abdullah (May Allah be pleased with them) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"The dearest and the closest of you to me on the Day of Resurrection will be those who are the best in behaviour; and the most hateful and the farthest from me on the Day of Resurrection will be the talkative and the most pretentious and the most rhetorical.\"[At-Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إن من أحبكم إلي، وأقربكم مني مجلسًا يوم القيامة، أحاسنكم أخلاقًا، وإن أبغضكم إلي وأبعدكم مني يوم القيامة، والثرثارون، والمتشدقون، والمتفيهقون‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1738
    },
    {
      "hadithNumber": 1739,
      "english": {
        "narrated": "'Aishah (May Allah be pleased with her) said:",
        "hadith": "The Prophet (ﷺ) said, \"None of you should say: 'My soul has become evil.' He should say: 'My soul is in bad shape.\"'[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا يقولن أحدكم خبثت نفسي، ولكن ليقل‏:‏ لقست نفسي‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1739
    },
    {
      "hadithNumber": 1740,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"None of you should use the word Al-Karm for grapes, for Al-Karm is a Muslim (worthy of respect).\"[Al- Bukhari and Muslim]Another narration is: \"Verily, Al-Karm is the heart of a true believer.\"Another narration is: \"People have named grapes as Al-Karm; verily, only the heart of a believer is Al-Karm.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏لا تسموا العنب الكَرْم، فإن الكَرْم المسلم‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ ‏(‏‏(‏وهذا لفظ مسلم‏)‏‏)‏‏.‏ \nوفي رواية‏:‏ ‏\"‏فإنما الكرم قلب المؤمن‏\"‏ وفي رواية للبخاري ومسلم‏:‏ ‏\"‏يقولون الكرم، إنما الكرم قلب المؤمن‏\"‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1740
    },
    {
      "hadithNumber": 1741,
      "english": {
        "narrated": "Wa'il bin Hujr (May Allah be pleased with him) said:",
        "hadith": "The Prophet (ﷺ) said, \"Do not say Al-Karm when talking about grapes but say Al-'Inab or Al-Habalah.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا تقولوا‏:‏ الكَرْم، ولكن قولوا‏:‏ العنب، والحَبَْلة‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1741
    },
    {
      "hadithNumber": 1742,
      "english": {
        "narrated": "Ibn Mas'ud (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"No woman should touch another woman's body and then describe the details of her figure to her husband in such a manner as if he was looking at her.\"[Al- Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا تباشر المرأة المرأة، فتصفها لزوجها كأنه ينظر إليها‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1742
    },
    {
      "hadithNumber": 1743,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"You must not supplicate: 'O Allah! forgive me if You wish; O Allah bestow mercy on me if You wish.' But beg from Allah with certitude for no one has the power to compel Allah.\"[Al-Bukhari and Muslim]Another narration of Muslim is: \"A supplication should be made in full confidence and one should persistently express his desire (before Allah) in his supplication, for no bounty is too great for Allah to bestow (upon his slaves).\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم  قال‏:‏ ‏\"‏لا يقولن أحدكم‏:‏ اللهم اغفر لي إن شئت‏:‏ اللهم ارحمني إن شئت، ليعزم المسألة، فإنه لا مكره له‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ ‏(‏‏(‏وفي رواية لمسلم‏:‏ ‏\"‏ولكن ليعزم، وليعظم الرغبة، فإن الله تعالى، لا يتعاظمه شيء أعطاه‏\"‏‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1743
    },
    {
      "hadithNumber": 1744,
      "english": {
        "narrated": "Anas (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"When one of you supplicates, let him be decisive and he should not say: 'O Allah, bestow upon me such and such if You wish', because no one has the power to compel Him.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إذا دعا أحدكم، فليعزم المسألة، ولا يقولن‏:‏ اللهم إن شئت، فأعطني، فإنه لا مستكره له‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1744
    },
    {
      "hadithNumber": 1745,
      "english": {
        "narrated": "Hudhaifah bin Yaman (May Allah be pleased with him) said:",
        "hadith": "The Prophet (ﷺ) said, \"Say not: 'What Allah wills and so-and-so wills', but say: 'What Allah wills, and then what so-and-so wills.\"'[Abu Dawud with authentic Isnad].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا تقولوا‏:‏ ما شاء الله وشاء فلان، ولكن قولوا‏:‏ ما شاء الله، ثم شاء فلان‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1745
    },
    {
      "hadithNumber": 1746,
      "english": {
        "narrated": "Abu Barzah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) disliked going to bed before the 'Isha' (night) prayer and indulging in conversation after it.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن أبي برزة رضي الله عنه أن رسول الله صلى الله عليه وسلم  كان يكره النوم قبل العشاء والحديث بعدها‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1746
    },
    {
      "hadithNumber": 1747,
      "english": {
        "narrated": "Ibn 'Umar (May Allah be pleased with them) said:",
        "hadith": "Once, towards the end of his life, the Messenger of Allah (ﷺ) concluded the 'Isha' (night) prayer and said, \"After one hundred years from tonight none of the people on the surface of the earth will survive.\"[Al- Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏أرأيتكم ليلتكم هذه‏؟‏ فإن على رأس مائة سنة لا يبقي ممن هو على ظهر الأرض اليوم أحد‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1747
    },
    {
      "hadithNumber": 1748,
      "english": {
        "narrated": "Anas (May Allah be pleased with him) said:",
        "hadith": "Once the Prophet (ﷺ) delayed the 'Isha' (night) prayer till midnight. He (ﷺ) turned to us after the prayer and said, \"All the people slept after offering their prayers, but you who waited, will be accounted as if you were engaged in your prayer throughout the period.\"[Al- Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ألا إن الناس قد صلوا‏.‏ ثم رقدوا، وإنكم لن تزالوا في صلاة ما انتظرتم الصلاة‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1748
    },
    {
      "hadithNumber": 1749,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"If a man calls his wife to his bed and she refuses, and thus he spends the night angry with her, the angels continue cursing her till the morning.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إذا دعا الرجل امرأته إلى فراشه فأبت، فبات غضبان عليها، لعنتها الملائكة حتى تصبح‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1749
    },
    {
      "hadithNumber": 1750,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"It is not lawful for a woman to observe an optional Saum (fast) without the permission of her husband when he is at home. Nor should she allow anyone to enter his house without his permission.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا يحل للمرأة أن تصوم وزوجها شاهد إلا بإذنه، ولا تأذن في بيته إلا بإذنه‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1750
    },
    {
      "hadithNumber": 1751,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Prophet (ﷺ) said, \"Does he who raises up his head before the Imam not fear that Allah will make his head that of a donkey or make his appearance similar to that of donkey?\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏أما يخشى أحدكم إذا رفع رأسه قبل الإمام أن يجعل الله رأسه رأس حمار‏!‏ أو يجعل الله صورته صورة حمار‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1751
    },
    {
      "hadithNumber": 1752,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "We are prohibited from placing the hand on the side during As-Salat (the prayer).[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم‏:‏ نهى عن الخصر في الصلاة‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1752
    },
    {
      "hadithNumber": 1753,
      "english": {
        "narrated": "'Aishah (May Allah be pleased with her) said:",
        "hadith": "I heard the Messenger of Allah (ﷺ) saying, \"No Salat (prayer) should be performed when the food has been served, nor should it be performed when a person is in need of relieving himself.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"لا صَلاَةَ بِحَضْرَةِ طَعَامٍ، وَلاَ وَهُوَ يُدَافِعُهُ الأَخْبَثَانِ\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1753
    },
    {
      "hadithNumber": 1754,
      "english": {
        "narrated": "Anas bin Malik (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"How is it that some people raise their eyes towards the sky during As-Salat (the prayer)?\" He stressed (this point) and added, \"People must refrain from raising their eyes towards heaven in Salat (prayer), or else their sights will certainly be snatched away.\"[Al-Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن أنس بن مالك قَالَ : قَالَ رسولُ اللهِ : « مَا بَالُ أقْوامٍ يَرْفَعُونَ أبْصَارَهُمْ إِلَى السَّمَاءِ في صَلاَتِهِمْ » ! فَاشْتَدَّ قَولُهُ في ذَلِكَ حَتَّى قَالَ : « لَيَنْتَهُنَّ عَنْ ذَلِكَ ، أَوْ لَتُخطفَنَّ أَبْصَارُهُمْ » ! . رواه البخاري",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1754
    },
    {
      "hadithNumber": 1755,
      "english": {
        "narrated": "'Aishah (May Allah be pleased with her) said:",
        "hadith": "I asked the Messenger of Allah (ﷺ) about random looks in Salat (prayer), and he replied, \"It is something which Satan snatches from the slave's Salat.\"[Al-Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏هو اختلاس يختلسه الشيطان من صلاة العبد‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1755
    },
    {
      "hadithNumber": 1756,
      "english": {
        "narrated": "Anas (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said to me, \"Beware of looking around in Salat (prayer), because random looks in Salat are a cause of destruction. If there should be no help from it, it is permissible in the voluntary and not in obligatory Salat.\"[At-Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إياك والالتفات في الصلاة، فإن الالتفات في الصلاة هلكة، فإن كان لابد، ففي التطوع لا في الفريضة‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1756
    },
    {
      "hadithNumber": 1757,
      "english": {
        "narrated": "Abu Marthad Kannaz bin Husain (May Allah be pleased with him) said:",
        "hadith": "I heard the Messenger of Allah (ﷺ) saying: \"Do not offer Salat (prayer) facing the graves and do not sit on them.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا تصلوا إلى القبور، ولا تجلسوا عليها‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1757
    },
    {
      "hadithNumber": 1758,
      "english": {
        "narrated": "Abul-Juhaim 'Abdullah bin Al-Harith (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"If the person who passes in front of a praying person, realizes the enormity of the sinfulness of this act, it will have been better for him to wait forty than to pass in front of him.\"[Al-Bukhari and Muslim].[The narrator was not sure whether the Prophet (ﷺ) said forty days, months or years.]",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لو يعلم المار بين المصلي ماذا عليه لكان أن يقف أربعين خيرًا له من أن يمر بين يديه‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1758
    },
    {
      "hadithNumber": 1759,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Prophet (ﷺ) said, \"When the Iqamah is called, no prayer should be performed except the obligatory prayer.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إذا أقيمت الصلاة، فلا صلاة إلا المكتوبة‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1759
    },
    {
      "hadithNumber": 1760,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) reported:",
        "hadith": "The Prophet (ﷺ) said, \"Do not choose the Friday night among all other nights for standing in (Tahajjud) prayer, and do not choose Friday among all other days for Saum (fasting) except that one you have accustomed to.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا تخصوا ليلة الجمعة بقيام من بين الليالي، ولا تخصوا يوم الجمعة بصيام من بين الأيام إلا أن يكون في صوم يصومه أحدكم‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1760
    },
    {
      "hadithNumber": 1761,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "I heard the Messenger of Allah (ﷺ) as saying: \"None of you should observe fast on Friday except that he should observe fast either one day before it or one day after it.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا يصومن أحدكم يوم الجمعة إلا يومًا قبله أو بعده‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1761
    },
    {
      "hadithNumber": 1762,
      "english": {
        "narrated": "Muhammad bin 'Abbad (May Allah be pleased with him) said:",
        "hadith": "I asked Jabir (May Allah be pleased with him). Did the Prophet (ﷺ) prohibit fasting on Friday?\" He said, \"Yes.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن محمد بن عباد قال‏:‏ سألت جابرًا رضي الله عنه‏:‏ أنهى النبي صلى الله عليه وسلم  عن صوم يوم الجمعة‏؟‏ قال‏:‏ نعم ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1762
    },
    {
      "hadithNumber": 1763,
      "english": {
        "narrated": "",
        "hadith": "Juwairiyah bint Al-Harith (May Allah be pleased with her), the Mother of the Believers, said that the Prophet (ﷺ) visited her on a Friday and she was observing fast. He asked, \"Did you observe fast yesterday?\" She said, \"No.\" He asked, \"Do you intend to observe fast tomorrow?\" She said, \"No.\" He said, \"In that case, give up your fast today.\"[Al-Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أم المؤمنين جويرة بنت الحارس رضي الله عنها أن النبي صلى الله عليه وسلم  دخل عليها يوم الجمعة وهي صائمة، فقال‏:‏ ‏\"‏ أصمت أمس‏؟‏‏\"‏ قالت‏:‏ لا، قال‏:‏ ‏\"‏ تريدين أن تصومي غدا ‏\"‏ قالت‏:‏ لا، قال ‏:‏ ‏\"‏فأفطري‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1763
    },
    {
      "hadithNumber": 1764,
      "english": {
        "narrated": "Abu Hurairah and 'Aishah (May Allah be pleased with them) said:",
        "hadith": "The Prophet (ﷺ) prohibited observing continuous voluntary fasts beyond one day.[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن أبي هريرة وعائشة رضي الله عنهما أن النبي صلى الله عليه وسلم  نهى عن الوصال‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1764
    },
    {
      "hadithNumber": 1765,
      "english": {
        "narrated": "Ibn 'Umar (May Allah be pleased with them) said:",
        "hadith": "The Messenger of Allah (ﷺ) prohibited observing continuous fasts beyond one day. The Companions submitted: \"But you do it.\" He replied, \"I am not like you. I am given to eat and to drink (from Allah).\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إني لست مثلكم، إني أُطعم وأُسقى‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1765
    },
    {
      "hadithNumber": 1766,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"It is much better for one of you to sit on a live coal, which will burn his clothes and get to his skin than to sit on a grave.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لأن يجلس أحدكم على جمرة، فتحرق ثيابه، فتخلص على جلده خير له من أن يجلس على قبر‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1766
    },
    {
      "hadithNumber": 1767,
      "english": {
        "narrated": "Jabir (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) forbade that the graves should be plastered (made into permanent structures), used as sitting places (for the people) or building over them.[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن جابر رضي الله عنه قال‏:‏ نهى رسول الله صلى الله عليه وسلم أن يجصص القبر، وأن يقعد عليه، وأن يبنى عليه‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1767
    },
    {
      "hadithNumber": 1768,
      "english": {
        "narrated": "Jarir bin Abdullah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"If a slave runs away from his master, his responsibility to him is absolved.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏أيما عبد أبق، فقد برئت منه الذمة ‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1768
    },
    {
      "hadithNumber": 1769,
      "english": {
        "narrated": "Jarir bin Abdullah (May Allah be pleased with him) said:",
        "hadith": "The Prophet (ﷺ) said, \"When the slave runs away from his master, his Salat (prayer) will not be accepted.\"[Muslim].Another narration is: \"He is guilty of disbelief (i.e., in case he believes in the lawfulness of doing so).\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعنه عن النبي صلى الله عليه وسلم  ‏:‏ ‏\"‏إذا أبق العبد، لم تقبل له صلاة ‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏ ‏.‏ وفي رواية‏:‏ ‏\"‏فقد كفر ‏\"‏ ‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1769
    },
    {
      "hadithNumber": 1770,
      "english": {
        "narrated": "'Aishah (May Allah be pleased with her) reported:",
        "hadith": "The Quraish were anxious about a woman from Banu Makhzum who had committed theft and asked : \"Who will speak to the Messenger of Allah (ﷺ) about her?\" Then they said: \"No one will be bold enough to do so except Usamah bin Zaid, the (Companion who was) dearly loved by the Messenger of Allah (ﷺ).\" So Usamah (May Allah be pleased with him) spoke to him and the Messenger of Allah (ﷺ) (angrily) said, \"Are you interceding regarding one of the punishments prescribed by Allah?\" He then got up and delivered an address in which he said, \"Indeed what destroyed the people before you was just that when a person of high rank among them committed a theft, they spared him; but if the same crime was done by a poor person they inflicted the prescribed punishment on him. I swear by Allah that if Fatimah daughter of Muhammad should steal, I would have her hand cut off.\"[Al-Bukhari and Muslim].In another narration 'Aishah (May Allah be pleased with her) said: (Upon hearing the intercession of Usamah), the face of the Messenger of Allah (ﷺ) changed color (because of anger) and he said, \"Do you dare to intercede in matters prescribed by Allah?\" Usamah pleaded: \"O Messenger of Allah! Pray for my forgiveness.\" 'Aishah (May Allah be pleased with her) added: Thereafter the Messenger of Allah (ﷺ) gave orders to have that woman's hand cut off.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن عائشة رضي الله عنها، أن قريشًا أهمهم شأن المرأة المخزومية التي سرقت فقالوا‏:‏ من يكلم فيها رسول الله صلى الله عليه وسلم ‏؟‏ فقالوا‏:‏ ومن يجترئ عليه إلا أسامة بن زيد، حب رسول الله صلى الله عليه وسلم ‏:‏، فكلمه أسامة فقال صلى الله عليه وسلم ‏:‏“أتشفع في حد من حدود الله تعالى‏؟‏ “ثم قام فاختطب، ثم قال‏:‏ “إنما أهلك الذين قبلكم أنهم كانوا إذا سرق فيهم الشريف تركوه، وإذا سرق فيهم الضعيف، أقاموا عليه الحد، وايم الله لو أن فاطمة بنت محمد سرقت لقطعت يدها” ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏  \nوفي رواية فتلون وجه رسول الله صلى الله عليه وسلم ‏\"‏ فقال‏:‏ ‏\"‏أتشفع في حد من حدود الله‏؟‏‏\"‏ قال أسامة‏:‏ استغفر لي يا رسول الله قال‏:‏ ثم أمر بتلك المرأة فقطعت يدها‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1770
    },
    {
      "hadithNumber": 1771,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Avoid two habits which provoke cursing.\" The Companions said: \"What are those things which provoke cursing?\" He said, \"Relieving on the thoroughfares or under the shades where people take shelter and rest.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏الذي يتخلى في طريق الناس أو في ظلهم‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1771
    },
    {
      "hadithNumber": 1772,
      "english": {
        "narrated": "Jabir (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) forbade urinating into stagnant water.[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن جابر رضي الله عنه ‏:‏ أن رسول الله صلى الله عليه وسلم  نهى أن يبال في الماء الراكد‏.‏‏ رواه مسلم‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1772
    },
    {
      "hadithNumber": 1773,
      "english": {
        "narrated": "An-Nu'man bin Bashir (May Allah be pleased with them) said:",
        "hadith": "My father took me to the Messenger of Allah (ﷺ) and said to him: \"I have gifted one of my slaves to this son of mine.\" The Messenger of Allah (ﷺ) said, \"Have you given such gift to every son of yours?\" He replied, \"No.\" Thereupon he said, \"Take this gift back.\"Another narration is: The Messenger of Allah (ﷺ) said, \"Be mindful of your obligation to Allah and do justice in respect of your children.\" My father came back and revoked his gift.Another narration is: The Messenger of Allah (ﷺ) asked, \"Have you other children besides this one?\" He said, \"Yes.\" The Messenger of Allah (ﷺ) asked, \"Have you awarded a gift like this to all of them.\" He said, \"No.\" The Messenger of Allah (ﷺ) said, \"I am not going to bear witness to this act of injustice.\"Another narration is: The Messenger of Allah (ﷺ) asked, \"Do you not except goodness from all of them as you except from him?\" He said, \"Yes, of course.\" The Messenger of Allah (ﷺ) said, \"Then don't do this (i.e., do not give a gift to one son only).\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن النعمان بن بشير رضي الله عنهما أن أبًا له أتي به رسول الله صلى الله عليه وسلم  فقال‏:‏ إني نحلت ابني هذا غلامًا كان لي، فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏أكل ولدك نحلته مثل هذا‏؟‏‏\"‏ فقال‏:‏ لا، فقال رسول الله صلى الله عليه وسلم  فأرجعه‏\"‏‏.‏ \nوفي رواية‏:‏ فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏أفعلت هذا بولدك كلهم‏؟‏‏\"‏ قال‏:‏ لا، قال‏:‏ ‏\"‏اتقوا الله واعدلوا بين أولادكم‏\"‏ فرجع أبي، فرد تلك الصدقة‏.‏\nوفي رواية‏:‏ فقال رسول الله صلى الله عليه وسلم ‏:‏ “يا بشير ألك ولد سوى هذا‏؟‏” قال‏:‏ نعم، قال‏:‏ “أكلهم وهبت له مثل هذا‏؟‏‏\"‏ قال‏:‏ لا، قال‏:‏ ‏\"‏فلا تشهدني إذًا فإني لا أشهد على جور‏\"‏ وفي رواية ‏\"‏لا تشهدني على جور‏\"‏\nوفي رواية‏:‏ ‏\"‏أشهد على هذا غيري‏\"‏ ثم قال‏:‏ ‏\"‏أيسرك أن يكونوا إليك في البر سواء‏؟‏‏\"‏ قال‏\"‏ بلى، قال‏:‏ ‏\"‏فلا إذًا‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1773
    },
    {
      "hadithNumber": 1774,
      "english": {
        "narrated": "Zainab bint Abu Salamah (May Allah be pleased with them) said:",
        "hadith": "I went to Umm Habibah (May Allah be pleased with her) the wife of the Prophet (ﷺ), when her father Abu Sufyan bin Harb (May Allah be pleased with him) died. Umm Habibah (May Allah be pleased with her) sent for a yellow coloured perfume or something else like it, and she applied it to a slave-girl and then rubbed it on her own cheeks and said: \"By Allah, I have no need for perfume, I heard the Messenger of Allah (ﷺ) saying from the pulpit, 'It is not permissible for a woman who believes in Allah and the Last Day to mourn for the dead beyond three days, except for the death of her husband; in which case the period of mourning is of four months and ten days.\"' Zainab said: I then visited Zainab, daughter of Jahsh (May Allah be pleased with her) when her brother died; she sent for perfume and applied it and then said: \"Beware! By Allah, I don't feel any need of perfume but I heard the Messenger of Allah (ﷺ) saying from the pulpit, 'It is not permissible for a woman who believes in Allah and the Last Day to mourn the dead beyond three days except in case of her husband (for whom the period is) four months and ten days.\"'[Al-Bukhari and Muslim]",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد على ميت فوق ثلاث ليال، إلا على زوج أربعة أشهر وعشرا‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1774
    },
    {
      "hadithNumber": 1775,
      "english": {
        "narrated": "Anas bin Malik (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) forbade that a person in the city should make a deal on behalf of a villager on commission even if he is his real brother.\"[Al-Bukhari and Muslim]",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن أنس رضي الله عنه قال‏:‏ نهى رسول الله صلى الله عليه وسلم  أن يبيع حاضر لباد وإن كان أخاه لأبيه وأمه‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1775
    },
    {
      "hadithNumber": 1776,
      "english": {
        "narrated": "Ibn 'Umar (May Allah be pleased with them) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Do not meet the merchandise till they arrive in the market.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن ابن عمر قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏”لا تتلقوا السلع حتى يهبط بها إلى الأسواق‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1776
    },
    {
      "hadithNumber": 1777,
      "english": {
        "narrated": "Ibn 'Abbas (May Allah be pleased with them) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"The caravans carrying merchandise should not be met on the way to purchase from them; a man in the city should not sell for a man of the desert.\"Tawus asked him (Ibn 'Abbas): \"What do these words really imply?\" He said: \"He should not work as an agent on his behalf.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن ابن عباس رضي الله عنهما قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ “لا تتلقوا الركبان، ولا يبع حاضر لباد‏\"‏ فقال له طاوس‏:‏ ما قوله‏:‏ لا بيع حاضر لباد‏؟‏ قال‏:‏ لا يكون له سمسارًا‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1777
    },
    {
      "hadithNumber": 1778,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) forbade that a man in the city should be the commission agent of a man from the desert and prohibited the practice of Najsh (i.e., offering a high price for something in order to allure another customer who is interested in the thing); and that a man should make an offer while the offer of his brother is pending; or that he should make a proposal of marriage while that of his brother is pending; or that a woman should try that a sister of hers might be divorced so that she might take her place.Another narration is: The Messenger of Allah (ﷺ) forbade the people from meeting the caravan on the way for entering into business transaction with them; and the selling of the goods by a dweller of the city on behalf of a man of the desert; and the seeking by a woman the divorce of her sister (from her husband); and the practice of Najsh and leaving the animals unmilked (for sometime for the purpose of accumulation of milk to deceive the buyer).[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي هريرة رضي الله عنه قال‏:‏ نهى رسول الله صلى الله عليه وسلم  أن يبيع حاضر لباد، ولا تناجشوا ولا يبيع الرجل على بيع أخيه، ولا يخطب على خطبة أخيه، ولا تسأل المرأة طلاق أختها لتكفأ ما في إنائها‏.‏ \nوفي رواية قال‏:‏ نهى رسول الله صلى الله عليه وسلم عن التلقي وأن يبتاع المهاجر للأعرابي، وأن تشترط المرأة طلاق أختها، وأن يستام الرجل على سوم أخيه، ونهى عن النجش والتصرية‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1778
    },
    {
      "hadithNumber": 1779,
      "english": {
        "narrated": "Ibn 'Umar (May Allah be pleased with them) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"A person should not enter into a transaction when his (Muslim) brother has already negotiated, nor should he make a proposal of marriage when that of his brother is pending, except with the permission of the latter.\"[Al-Bukhari and Muslim]",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا يبع بعضكم على بيع بعض، ولا يخطب على خطبة أخيه إلا أن يأذن له‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1779
    },
    {
      "hadithNumber": 1780,
      "english": {
        "narrated": "'Uqbah bin 'Amir (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"A Mu'min is the brother of another Mu'min; and thus it is not permissible for a Mu'min to make an offer while the offer of his brother is pending, nor should he make a proposal of marriage while that of his brother is pending till he withdraws his proposal.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏المؤمن أخو المؤمن، فلا يحل لمؤمن أن يبتاع على بيع أخيه ولا يخطب على خطبة أخيه حتى يذر‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1780
    },
    {
      "hadithNumber": 1781,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Verily, Allah likes three things for you and disapproves three things for you. He likes that you should worship Him Alone, not to associate anything with Him (in worship) and to hold fast to the Rope of Allah and not to be divided among yourselves; and He disapproves for you irrelevant talk, persistent questioning and the squandering of the wealth.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إن الله تعالى يرضى لكم ثلاثا، ويكره لكم ثلاثًا‏:‏ فيرضى لكم أن تعبدوه، ولا تشركوا به شيئًا، وأن تعتصموا بحبل الله جميعًا ولا تفرقوا، ويكره لكم‏:‏ قيل وقال، وكثرة السؤال، وإضاعة المال‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1781
    },
    {
      "hadithNumber": 1782,
      "english": {
        "narrated": "Warrad, the scribe of Al-Mughirah bin Shu'bah (May Allah be pleased with him) said:",
        "hadith": "Al-Mughirah bin Shu'bah dictated a letter to me addressed to Mu'awiyah (May Allah be pleased with him) that the Prophet (ﷺ) used to supplicate at the end of each obligatory Salat (prescribed prayer): \"La ilaha illallahu, wahadahu la sharika lahu, lahul-mulku, wa lahul-hamdu, wa Huwa 'ala kulli shai'in Qadir. Allahumma la mani'a lima a'taita, wa la mu'tiya lima mana'ta, wa la yanfa'u dhal-jaddi mink-al-jaddu. (There is no true god except Allah, the One, Who has no partner. His is the sovereignty and His is the praise, and He is Able to do everything. O Allah! Nobody can withhold what You give; and nobody can give what You withhold; and the high status of a person is of no avail against Your Will).\" He also wrote to him that the Prophet (ﷺ) used to forbid irrelevant talk, wasteful expenditure, persistent questioning, disobedience of parents (especially mothers), infanticide of daughters by burying them alive, depriving others of their rights and acquisition of property wrongfully.[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن وراد كاتب المغيرة شعبة قال‏:‏ أملى على المغيرة بن شعبة في كتاب إلى معاوية رضي الله عنه ، أن النبي صلى الله عليه وسلم أن يقول في دبر كل صلاة مكتوبة‏:‏ ‏\"‏لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، اللهم لا مانع لما أعطيت، ولا معطي لما منعت، ولا ينفع ذا الجد منك الجد‏\"‏ وكتب إليه أنه ‏\"‏كان ينهى عن قيل وقال، وإضاعة المال، وكثرة السؤال، وكان ينهى عن عقوق الأمهات، ووأد البنات، ومنع وهات” ‏(‏‏(‏متفق عليه وسبق شرحه‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1782
    },
    {
      "hadithNumber": 1783,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"None of you should point at his brother with a weapon because he does not know that Satan may make it lose from his hand and, as a result, he may fall into a pit of Hell-fire (by accidentally killing him).\"[Al-Bukhari and Muslim].The narration in Muslim is: Abul-Qasim (i.e., the Messenger of Allah) (ﷺ) said, \"He who points at his (Muslim) brother with a weapon is cursed by the angels even if the other person should be his real brother.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن أبي هريرة رضي الله عنه عن رسول الله صلى الله عليه وسلم  قال‏:‏ “لا يُشر أحدكم إلى أخيه بالسلاح، فإنه لا يدري لعل الشيطان ينزع في يده، فيقع في حفرة من النار‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏  \nوفي رواية لمسلم قال‏:‏ قال أبو القاسم صلى الله عليه وسلم ‏:‏ “من أشار إلى أخيه بحديدة، فإن الملائكة تلعنه، حتى ينزع وإن كان أخاه لأبيه وأمه‏\"‏‏.‏\nقوله صلى الله عليه وسلم ‏:‏ ‏\"‏ينزِع‏\"‏ ضبط بالعين المهملة مع كسر الزاي، وبالغين المعجمة مع فتحها، ومعناهما متقارب، ومعناه بالمهملة يرمي، وبالمعجمة أيضًا يرمي ويفسد، وأصل النزع الطعن والفساد‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1783
    },
    {
      "hadithNumber": 1784,
      "english": {
        "narrated": "Jabir (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) prohibited from presenting a drawn sword to another.\"[Abu Dawud and At- Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏نهى رسول الله صلى الله عليه وسلم  أن يتعاطى السيف مسلولا‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1784
    },
    {
      "hadithNumber": 1785,
      "english": {
        "narrated": "Abu Sha'tha' said:",
        "hadith": "We were sitting with Abu Hurairah (May Allah be pleased with him) in the mosque when the Mu'adhdhin proclaimed the Adhan. A man stood up in the mosque and started walking out. Abu Hurairah (May Allah be pleased with him) stared at him till he went out of the mosque. Upon this Abu Hurairah (May Allah be pleased with him) said: Indeed, this man has disobeyed Abul-Qasim (ﷺ).[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن أبي الشعثاء قال‏:‏ كنا قعودًا مع أبي هريرة رضي الله عنه في المسجد فأذن المؤذن، فقام رجل من المسجد يمشي، فأتبعه أبو هريرة بصره حتى خرج من المسجد فقال أبو هريرة‏:‏ أما هذا فقد عصى أبا القاسم صلى الله عليه وسلم ‏\"‏ ‏(‏‏(‏‏رواه مسلم‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1785
    },
    {
      "hadithNumber": 1786,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"He who is presented with a flower of sweet basil should not reject it, because it is light in weight and pleasant in odour.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن أبي هريرة رضي الله عنه، قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ “من عرض عليه ريحان، فلا يرده، فإنه خفيف المحمل طيب الريح‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1786
    },
    {
      "hadithNumber": 1787,
      "english": {
        "narrated": "Anas bin Malik (May Allah be pleased with him) reported:",
        "hadith": "The Prophet (ﷺ) never refused a gift of perfume.[Al- Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أنس بن مالك رضي الله عنه أن النبي صلى الله عليه وسلم  كان لا يرد الطيب” ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1787
    },
    {
      "hadithNumber": 1788,
      "english": {
        "narrated": "Abu Musa Al-Ash'ari (May Allah be pleased with him) said:",
        "hadith": "The Prophet (ﷺ) heard a person lauding another person or praising him too much. Thereupon he said, \"You killed the man,\" or he said, \"You ruined the man.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي موسى الأشعري رضي الله عنه قال‏:‏ سمع رسول الله صلى الله عليه وسلم  رجلا يُثني على رجل ويُطريه في المدحة، فقال‏:‏ ‏\"‏أهلكتم، أو قطعتم ظهر الرجل‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ (23).‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1788
    },
    {
      "hadithNumber": 1789,
      "english": {
        "narrated": "Abu Bakrah (May Allah be pleased with him) reported:",
        "hadith": "Mention of a man was made to the Prophet (ﷺ) and someone praised him whereupon he (ﷺ) said, \"Woe be to you! You have broken the neck of your friend!\" He repeated this several times and added, \"If one of you has to praise his friend at all, he should say: 'I reckon him to be such and such and Allah knows him well', if you think him to be so-and-so, you will be accountable to Allah because no one can testify the purity of others against Allah.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي بكر رضي الله عنه أن رجلا ذُكر عند النبي صلى الله عليه وسلم ، فأثنى عليه رجل خيرًا، فقال النبي صلى الله عليه وسلم ‏:‏ ‏\"‏ويحك‏!‏ قطعت عنق صاحبك‏\"‏ يقوله مرارًا ‏\"‏وإن كان أحدكم مادحًا لا محالة، فليقل‏:‏ أحسب كذا وكذا إن كان يرى أنه كذلك وحسيبه الله، ولا يزكي على الله أحدًا‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1789
    },
    {
      "hadithNumber": 1790,
      "english": {
        "narrated": "Hammam bin Al- Harith (May Allah be pleased with him) reported:",
        "hadith": "A person began to praise 'Uthman (May Allah be pleased with him), and Al-Miqdad (May Allah be pleased with him) sat upon his knees and began to throw pebbles upon the flatterer's face. 'Uthman (May Allah be pleased with him) said: \"What is the matter with you?\" He said: \"Verily, the Messenger of Allah (ﷺ) said, 'When you see those who shower undue praises upon others throw dust upon their faces.\"'[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن همام بن الحارث، عن المقداد، رضي الله عنه أم رجلا جعل يمدح عثمان رضي الله عنه ، فعمد المقداد، فجثا على ركبتيه، فجعل يحثو في وجهه الحصباء، فقال له عثمان‏:‏ ما شأنك‏؟‏ فقال‏:‏ إن رسول الله صلى الله عليه وسلم  قال‏:‏ “إذا رأيتم المادحين، فاحثوا في وجوههم التراب‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ \nفهذه الأحاديث في النهي، وجاء في الإباحة أحاديث كثيرة صحيحة‏.‏\nقال العلماء‏:‏ وطريق الجمع بين الأحاديث أن يقال‏:‏ إن كان الممدوح عنده كمال إيمان ويقين، ورياضة نفس، ومعرفة تامة بحيث لا يفتن، ولا يغتر بذلك، ولا تلعب به نفسه، فليس بحرام ولا مكروه، وإن خيف عليه شيء من هذه الأمور، كره مدحه في وجهه كراهة شديدة، وعلى هذا التفصيل تنزل الأحاديث المختلفة في ذلك‏.‏ ومما جاء في الإباحة قوله صلى الله عليه وسلم لأبي بكر رضي الله عنه‏:‏ “أرجو أن تكون منهم‏\"‏ أي من الذين يُدعون من جميع أبواب الجنة لدخولها، وفي الحديث الآخر‏:‏ ‏\"‏لست منهم‏\"‏ أي‏:‏ لست من الذين يُسبلون أُزرهم خيلاء‏.‏ وقال صلى الله عليه وسلم لعمر رضي الله عنه‏:‏ “ما رآك الشيطان سالكًا فجًا إلا سلك فجًا غير فجك” والأحاديث في الإباحة كثيرة، وقد ذكرت جملة من أطرافها في كتاب‏:‏ ‏\"‏الأذكار‏\"‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1790
    },
    {
      "hadithNumber": 1791,
      "english": {
        "narrated": "Ibn 'Abbas (May Allah be pleased with them) reported:",
        "hadith": "'Umar bin Al- Khattab (May Allah be pleased with him) set out for Ash-Sham (the region comprising Syria, Palestine, Lebanon and Jordan). As he reached at Sargh (a town by the side of Hijaz) he came across the governor of Al-Ajnad, Abu 'Ubaidah bin Al-Jarrah (May Allah be pleased with him) and his companions. They informed him that an   had broken out in Syria. Ibn 'Abbas relates: 'Umar (May Allah be pleased with him) said to me: \"Call to me the earliest Muhajirun (Emigrants).\" So I called them. He sought their advice and told them that an epidemic had broken out in Ash-Sham. There was a difference of opinion whether they should proceed further or retreat to their homes in such a situation. Some of them said: \"You have set forth to fight the enemy, and therefore you should not go back;\" whereas some of them said: \"As you have along with you many eminent Companions of Messenger of Allah (ﷺ), we would not advice you to set forth to the place of the plague (and thus expose them deliberately to a danger).\" 'Umar (May Allah be pleased with him) said: \"You can now go away.\" He said: \"Call to me the Ansar (the Helpers).\" So I called them to him, and he consulted them and they differed in their opinions as well. He said: \"Now, you may go.\" He again said: \"Call the old (wise people) of the Quraish who had emigrated before the conquest of Makkah.\" I called them. 'Umar (May Allah be pleased with him) consulted them in this issue and not even two persons among them differed in the opinions. They said: \"We think that you should go back along with the people and do not take them to this scourge. 'Umar (May Allah be pleased with him) made an announcement to the people, saying: \"In the morning I intend to go back, and I want you to do the same.\" Abu 'Ubaidah bin Al-Jarrah (May Allah be pleased with him) said: \"Are you going to run away from the Divine Decree?\" Thereupon 'Umar (May Allah be pleased with him) said: \"O Abu 'Ubaidah ! Had it been someone else to say this.\" ('Umar (May Allah be pleased with him) did not like to differ with him). He said: \"Yes, we are running from the Divine Decree to the Divine Decree. What do you think if you have camels and you happen to get down a valley having two sides, one of them covered with foliage and the other being barren, will you not act according to the Divine Decree if you graze them in vegetative land? In case you graze them in the barren land, even then you will be doing so according to the Divine Decree.There happened to come 'Abdur-Rahman bin 'Auf who had been absent for some of his needs. He said: I have knowledge about it. I heard the Messenger of Allah (ﷺ) saying, \"If you get wind of the outbreak of plague in a land, you should not enter it; but if it spreads in the land where you are, you should not depart from it.\" Thereupon 'Umar bin Khattab (May Allah be pleased with him) praised Allah and went back.[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن ابن عباس رضي الله عنه أن عمر بن الخطاب رضي الله عنه خرج إلى الشام حتى إذا كان بسرغ لقيه أمراء الأجناد -أبو عبيدة بن الجراح وأصحابه- فأخبروه أن الوباء قد وقع بالشام، قال بن عباس‏:‏ فقال عمر‏:‏ ادع لي المهاجرين الأولين، فدعوتهم، فاستشارهم، وأخبرهم أن الوباء قد وقع بالشام، فاختلفوا، فقال بعضهم‏:‏ خرجت لأمر، ولا نرى أن ترجع عنه‏.‏ وقال بعضهم‏:‏ معك بقية الناس وأصحاب رسول الله صلى الله عليه وسلم  ، ولا نرى أن تقدمهم على هذا الوباء‏.‏ فقال‏:‏ ارتفعوا عني، ثم قال‏:‏ ادع لي الأنصار، فدعوتهم، فاستشارهم، فسلكوا سبيل المهاجرين، واختلفوا كاختلافهم، فقال‏:‏ ارتفعوا عني، ثم قال‏:‏ ادع لي من كان ها هنا من مشيخة قريش من مهاجرة الفتح، فدعوتهم، فلم يختلف عليه منهم رجلان، فقالوا‏:‏ نرى أن ترجع بالناس، ولا تقدمهم على هذا الوباء، فنادى عمر رضي الله عنه في الناس‏:‏ إني مصبح على ظهر، فأصبحوا عليه فقال أبو عبيدة بن الجراح رضي الله عنه ‏:‏ أفرار من قدر الله‏؟‏ فقال عمر رضي الله عنه ‏:‏ لو غيرك قالها يا أبا عبيدة‏!‏ -وكان عمر يكره خلافه- نعم نفر من قدر الله إلى قدر الله، أرأيت لو كان لك إبل، فهبطت وادياً له عدوتان، إحداهما خصبة، والأخرى جدبة، أليس إن رعيت الخصبة رعيتها بقدر الله، وإن رعيت الجدبة رعيتها بقدر الله‏؟‏ قال‏:‏ فجاء عبد الرحمن بن عوف رضي الله عنه ، وكان متغيباً في بعض حاجته، فقال‏:‏ إن عندي من هذا علما، سمعت رسول الله صلى الله عليه وسلم  يقول‏:‏ “إذا سمعتم به بأرض، فلا تقدموا عليه، وإذا وقع بأرض وأنتم بها، فلا تخرجوا فرارا منه‏\"‏ فحمد الله تعالى عمر رضي الله عنه وانصرف‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏\nوالعدوة‏:‏ جانب الوادي‏‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1791
    },
    {
      "hadithNumber": 1792,
      "english": {
        "narrated": "Usamah bin Zaid (May Allah be pleased with him) said:",
        "hadith": "The Prophet (ﷺ) said, \"If you get wind of the outbreak of plague in a land, do not enter it; and if it breaks out in a land in which you are, do not leave it.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إذا سمعتم الطاعون بأرض، فلا تدخلوها، وإذا وقع بأرض، وأنتم فيها، فلا تخرجوا منها‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1792
    },
    {
      "hadithNumber": 1793,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Prophet (ﷺ) said, \"Avoid the seven destructive things.\" It was asked: (by those present): \"What are they, O Messenger of Allah?\" He replied, \"Associating anyone or anything with Allah in worship; practising sorcery, killing of someone without a just cause whom Allah has forbidden, devouring the property of an orphan, eating of usury, fleeing from the battlefield and slandering chaste women who never even think of anything touching chastity and are good believers.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن أبي  هريرة رضي الله عنه عن النبي صلى الله عليه وسلم  قال‏:‏ “أجتنبوا السبع الموبقات” قالوا‏:‏ يا رسول الله وما هن‏؟‏ قال‏:‏ ‏\"‏الشرك بالله، والسحر، وقتل النفس التى حرم الله إلا بالحق، وأكل الربا، وأكل مال اليتيم، والتولي يوم الزحف، وقذف المحصنات الغافلات” ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1793
    },
    {
      "hadithNumber": 1794,
      "english": {
        "narrated": "Ibn 'Umar (May Allah be pleased with them) said:",
        "hadith": "The Messenger of Allah (ﷺ) forbade travelling to the land of the enemy carrying the Qur'an.[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏نهى رسول الله صلى الله عليه وسلم  أن يسافر بالقرآن إلى أرض العدو‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1794
    },
    {
      "hadithNumber": 1795,
      "english": {
        "narrated": "Umm Salamah (May Allah be pleased with her) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Whosoever drinks in utensils of silver, in fact, kindles in his belly the fire of Hell.\"[Al-Bukhari and Muslim].The narration of Muslim is: \"Verily, the person who eats or drinks in utensils made of gold and silver.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن أم سلمة رضي الله عنها أن رسول الله صلى الله عليه وسلم  قال‏:‏ ‏\"‏الذي يشرب في آنية الفضة إنما يجرجر في بطنه نار جهنم‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏  \nوفي رواية لمسلم‏:‏ ‏\"‏أن الذي يأكل أو يشرب في آنية الفضة والذهب‏\"‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1795
    },
    {
      "hadithNumber": 1796,
      "english": {
        "narrated": "Hudhaifah (May Allah be pleased with him) reported:",
        "hadith": "The Prophet (ﷺ) prohibited us from wearing silk or Dibaj and from drinking out of gold and silver vessels and said, \"These are meant for them (non- Muslims) in this world and for you in the Hereafter.\"In another narration Hudhaifah (May Allah be pleased with him) said: The Messenger of Allah (ﷺ) said, \"Do not wear silk and Dibaj, nor eat or drink from utensils made of gold and silver.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن حذيفة رضي الله عنه، قال‏:‏ إن النبي صلى الله عليه وسلم  نهانا عن الحرير، والديباج والشرب في آنية الذهب والفضة، وقال‏:‏ ‏\"‏هن لهم في الدنيا وهم لكم في الاخرة‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏  \nوفي رواية في الصحيحين عن حذيفة رضي الله عنه، قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏\"‏لا تلبسوا الحرير ولا الديباج، ولا تشربوا في آنية الذهب والفضة ولا تأكلوا في صحافها‏\"‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1796
    },
    {
      "hadithNumber": 1797,
      "english": {
        "narrated": "Anas bin Sirin (May Allah be pleased with him) said:",
        "hadith": "I was with Anas bin Malik (May Allah be pleased with him) in the company of some Magians when Faludhaj (a sweet made of flour and honey) was brought in a silver utensil, and Anas did not take it. The man was told to change the utensil. So he changed the utensil and when he brought it to Anas, he took it.[Al-Baihaqi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أنس بن سيرين قال‏:‏ كنت مع أنس بن مالك رضي الله عنه عند نفر من المجوس، فجيء بفالوذج على إناء من فضة، فلم يأكله، فقيل له‏:‏ حوله، فحوله على إناء من خلنج، وجيء به فأكله‏.‏ ‏(‏‏(‏رواه البيهقي بإسناد حسن‏)‏‏)‏‏.الخلنج الجفنة ‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1797
    },
    {
      "hadithNumber": 1798,
      "english": {
        "narrated": "Anas (May Allah be pleased with him) said:",
        "hadith": "The Prophet (ﷺ) prohibited men from wearing saffron-dyed clothes.[Al- Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن أنس رضي الله عنه قال‏:‏ نهى النبي صلى الله عليه وسلم  أن يتزعفر الرجل‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1798
    },
    {
      "hadithNumber": 1799,
      "english": {
        "narrated": "'Abdullah bin 'Amr bin Al-'As (May Allah be pleased with them) said:",
        "hadith": "The Prophet (ﷺ) saw me dressed in two saffron-coloured garments and asked, \"Has your mother commanded you to wear these?\" I asked him, \"Shall I wash them out?\" He replied, \"You had better set them to fire.\"Another narration is: \"These are garments of the disbelievers. So do not wear them.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن عبد الله بن عمرو بن العاص رضي الله عنه قال‏:‏ رأى النبي صلى الله عليه وسلم  علي  ثوبين معصفرين فقال‏:‏ ‏\"‏أمك أمرتك بهذا‏؟‏‏\"‏ قلت‏:‏ أغسلهما‏؟‏ قال‏:‏ ‏\"‏بل احرقهما‏\"‏‏.‏ \nوفي رواية فقال‏:‏ ‏\"‏إن هذا من ثياب الكفار فلا تلبسها‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1799
    },
    {
      "hadithNumber": 1800,
      "english": {
        "narrated": "'Ali (May Allah be pleased with him) said:",
        "hadith": "I have retained in my memory the saying of the Messenger of Allah (ﷺ) that: \"No one is considered an orphan after he has attained the age of maturity; and it is unlawful to remain silent from dawn till night.\"[Abu Dawud with Hasan (good) Isnad].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا يتم بعد احتلام، ولا صمات يوم إلى الليل‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1800
    },
    {
      "hadithNumber": 1801,
      "english": {
        "narrated": "Qais bin Abu Hazim (May Allah be pleased with him) said:",
        "hadith": "Abu Bakr (May Allah be pleased with him) came upon a woman named Zainab from the Ahmas tribe and noticed that she was observing total silence. He said: \"What has happened to her? Why does she not speak?'' People informed him that she had sworn to remain silent. He then said to her: \"You should speak, it is not permissible (to observe silence), for it is an act of the Days of Ignorance (Jahiliyyah).\" (After hearing this) she started speaking.\n\n[Al-Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن قيس بن أبي  حازم قال‏:‏ دخل أبو بكر الصديق رضي الله عنه على امرأة من أحمس يقال لها‏:‏ زينب، فرأها لا تتكلم‏.‏ فقال‏:‏ ما لها لا تتكلم‏؟‏ فقالوا‏:‏ حجت مصمته، فقال لها‏:‏ تكلمي فإن هذا لا يحل، هذا من عمل الجاهلية‏!‏ فتكلمت‏.‏ رواه البخاري",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1801
    },
    {
      "hadithNumber": 1802,
      "english": {
        "narrated": "Sa'd bin Abu Waqqas (May Allah be pleased with him) said:",
        "hadith": "The Prophet (ﷺ) said, \"He who (falsely) attributes his fatherhood to anyone besides his real father, knowing that he is not his father, will be forbidden to enter Jannah.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏من ادعى إلى غير أبيه وهو يعلم أنه غير أبيه، فالجنة عليه حرام‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1802
    },
    {
      "hadithNumber": 1803,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Prophet (ﷺ) said, \"Do not turn away from your fathers, for he who turns away from his father, will be guilty of committing an act of disbelief.\"[Al-Bukhari and Muslim]",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا ترغبوا عن آبائكم، فمن رغب عن أبيه، فهو كافر‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1803
    },
    {
      "hadithNumber": 1804,
      "english": {
        "narrated": "Yazid bin Sharik bin Tariq (May Allah be pleased with him) said:",
        "hadith": "I saw 'Ali (May Allah be pleased with him) giving a Khutbah (sermon) from the pulpit and I heard him saying: \"By Allah, we have no book to read except Allah's Book and what is written in this scroll. He unrolled the scroll which showed a list of what sort of camels to be given as blood-money, and other legal matters relating to killing game in the sanctuary of Makkah and the expiation thereof. In it was also written: The Messenger of Allah (ﷺ) said: 'Al-Madinah is a sanctuary from 'Air to Thaur (mountains). He who innovates in this territory new ideas in Islam, commits a sin therein, or shelters the innovators, will incur the Curse of Allah, the angels, and all the people, and Allah will accept from him neither repentance nor a ransom on the Day of Resurrection. The asylum (pledge of protection) granted by any Muslim (even of the) lowest status is to be honoured and respected by all other Muslims, and whoever betrays a Muslim in this respect (by violating the pledge) will incur the Curse of Allah, the angels, and all the people; and Allah will accept from him neither repentance nor a ransom on the Day of Resurrection. Whoever attributes his fatherhood to someone other than his (real) father, and takes someone else as his master other than his (real) master without his permission, will incur the Curse of Allah, the angels and all the people, and Allah will accept from him neither repentance nor a ransom on the Day of Resurrection.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن يزيد بن شريك بن طارق قال‏:‏ رأيت عليا رضي الله عنه على المنبر يخطب، فسمعته يقول‏:‏ لا والله ما عندنا من كتاب نقرؤه إلا كتاب الله، وما في هذه الصحيفة، فنشرها فإذا فيها أسنان الإبل، وأشياء من الجراحات، وفيها‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏المدينة حرم ما بين عير إلى ثور، فمن أحدث فيها حدثاً، أو آوى محدثاً، فعليه لعنة الله والملائكة والناس أجمعين، لا يقبل الله منه يوم القيامة صرفاً ولا عدلاً، ذمة المسلمين واحدة، يسعى بها أدناهم، فمن أخفر مسلماً، فعليه لعنة الله والملائكة والناس أجمعين، لا يقبل الله منه يوم القيامة صرفاً ولا عدلاً، ومن ادعى إلى غير أبيه، أو انتمى إلى غير مواليه، فعليه لعنة الله والملائكة والناس أجمعين، لا يقبل الله منه يوم القيامة صرفاً ولا عدلاً‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ \"ذِمَّةُ المُسْلِمِينَ\"أيْ: عَهْدُهُمْ وأمانتُهُم.\"وَأخْفَرَهُ\": نَقَضَ عَهْدَهُ.\"والصَّرفُ\": التَّوْبَةُ، وَقِيلَ: الحِيلَةُ.\"وَالْعَدْلُ\": الفِدَاءُ.",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1804
    },
    {
      "hadithNumber": 1805,
      "english": {
        "narrated": "Abu Dharr (May Allah be pleased with him) reported:",
        "hadith": "I heard the Messenger of Allah (ﷺ) saying: \"A person who attributes his fatherhood to anyone other than his real father, knowing that he is not his father, commits an act of disbelief. And he who makes a claim of anything which in fact does not belong to him, is none of us. He should make his abode in Hell, and he who labels anyone as disbeliever or calls him the enemy of Allah and he is in fact not so, his charge will revert to him.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي  ذر رضي الله عنه أنه سمع رسول الله صلى الله عليه وسلم  يقول‏:‏ “ليس من رجل  ادعى لغير أبيه وهو يعلمه إلا كفر، ومن ادعى ما ليس له، فليس منا، وليتبوأ مقعده من النار، ومن دعا رجلاً بالكفر، أو قال‏:‏ عدو الله، وليس كذلك إلا حار عليه” ‏(‏‏(‏متفق عليه وهذا لفظ رواية مسلم‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1805
    },
    {
      "hadithNumber": 1806,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Prophet (ﷺ) said, \"Allah, the Exalted, becomes angry, and His Anger is provoked when a person does what Allah has declared unlawful.\"[Al- Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إن الله تعالى يغار، وغيرة الله أن يأتي المرء ما حرم الله عليه‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1806
    },
    {
      "hadithNumber": 1807,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) said:",
        "hadith": "The Prophet (ﷺ) said, \"He who takes an oath and involuntarily says: 'By Al-Lat and Al-'Uzza' should at once affirm: 'La ilaha illallah (there is no true god except Allah)', and he who says to his companion: 'Come let's gamble' should make expiation by giving something in charity.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي  هريرة رضي الله عنه عن النبي صلى الله عليه وسلم  قال‏:‏ “من حلف فقال في حلفه‏:‏ باللات والعزى، فليقل‏:‏ لا إله إلا الله، ومن قال لصاحبه‏:‏ تعالى أقامرك فليتصدق‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 17,
      "bookName": "17The Book of the Prohibited actionsكتاب الأمور المنهي عنها",
      "bookReference": 1807
    }
  ]
}