{
  "collectionId": "riyadussalihin",
  "bookId": 2,
  "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
  "hadithCount": 51,
  "hadiths": [
    {
      "hadithNumber": 727,
      "english": {
        "narrated": "'Umar bin Abu Salamah (May Allah be pleased with him) reported:",
        "hadith": "Messenger of Allah (ﷺ), said to me, \"Mention Allah's Name (i.e., say Bismillah before starting eating), eat with your right hand, and eat from what is near you.\"\n\n[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏سم الله وكل بيمينك، وكل مما يليك‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 727
    },
    {
      "hadithNumber": 728,
      "english": {
        "narrated": "'Aishah (May Allah be pleased with her) reported:",
        "hadith": "Messenger of Allah (ﷺ) said, \"When any of you wants to eat, he should mention the Name of Allah in the begining, (i.e., say Bismillah). If he forgets to do it in the beginning, he should say Bismillah awwalahu wa akhirahu (I begin with the Name of Allah at the beginning and at the end).\"[At-Tirmidhi and Abu Dawud].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إذا أكل أحدكم فليذكر اسم الله تعالى، فإذا نسى أن يذكر اسم الله تعالى في أوله، فليقل، بسم الله أوله وآخره‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 728
    },
    {
      "hadithNumber": 729,
      "english": {
        "narrated": "Jabir (May Allah be pleased with him) reported:",
        "hadith": "I heard Messenger of Allah (ﷺ) saying, \"If a person mentions the Name of Allah upon entering his house or eating, Satan says, addressing his followers: 'You will find no where to spend the night and no dinner.' But if he enters without mentioning the Name of Allah, Satan says (to his followers); 'You have found (a place) to spend the night in, and if he does not mention the Name of Allah at the time of eating, Satan says: 'You have found (a place) to spend the night in as well as food.\"'[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إذا دخل الرجل بيته، فذكر الله تعالى عند دخوله وعند طعامه، قال الشيطان لأصحابه‏:‏ لا مبيت لكم ولا عشاء، وإذا دخل ، فلم يذكر الله تعالى عند دخوله، قال الشيطان‏:‏ أدركتم المبيت؛ وإذا لم يذكر الله تعالى عند طعامه قال‏:‏ أدركتم المبيت والعشاء‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 729
    },
    {
      "hadithNumber": 730,
      "english": {
        "narrated": "Hudhaifah (May Allah be pleased with him) reported:",
        "hadith": "When we attended a meal with the Messenger of Allah (ﷺ), we would not stretch forth our hands towards the food until he (ﷺ) would start eating first. Once, we were with him when a little girl rushed in as if someone was impelling her. She was about to lay her hand on the food when the Messenger of Allah (ﷺ) caught her hand. Then a bedouin came in rushing as if someone were pushing him. He (ﷺ) caught his hand also and said, \"Satan considers that food lawful for himself on which the Name of Allah is not mentioned. He (Satan) brought this girl to make the food lawful through her but I caught her hand. Then he brought the bedouin to make it lawful through him but I caught his hand too. By Him in Whose Hand my soul is, now Satan's hand is in my grasp along with their hands.\" Then he mentioned the Name of Allah and began to eat.[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إن الشيطان يستحل الطعام أن لا يذكر اسم الله تعالى عليه، وإنه جاء بهذه الجارية ليستحل بها، فأخذت بيدها، فجاء بهذا الأعرابي ليستحل به، فأخذت بيده، والذي نفسي بيده إن يده في يدي مع يديهما‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 730
    },
    {
      "hadithNumber": 731,
      "english": {
        "narrated": "Umaiyyah bin Makhshi (May Allah be pleased with him) reported:",
        "hadith": "Messenger of Allah (ﷺ) was sitting while a man was eating food. That man did not mention the Name of Allah (before commencing to eat) till only a morsel of food was left. When he raised it to his mouth, he said: \"Bismillah awwalahu wa akhirahu (With the Name of Allah, in the beginning and in the end).\" Messenger of Allah (ﷺ) smiled at this and said, \"Satan had been eating with him but when he mentioned the Name of Allah, Satan vomited all that was in his stomach.\"[Abu Dawud and An-Nasa'i].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ما زال الشيطان يأكل معه، فلما ذكر اسم الله استقاء ما فيه بطنه‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 731
    },
    {
      "hadithNumber": 732,
      "english": {
        "narrated": "'Aishah (May Allah be pleased with her) reported:",
        "hadith": "The Messenger of Allah (ﷺ) was eating with his six Companions when a desert Arab came and ate up the food in two mouthfuls. Messenger of Allah (ﷺ) said, \"Had he mentioned the Name of Allah, it would have sufficed for all of you.\"[At-Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏أما إنه لو سمى لكفاكم‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 732
    },
    {
      "hadithNumber": 733,
      "english": {
        "narrated": "Abu Umamah (May Allah be pleased with him) reported:",
        "hadith": "Whenever the Prophet (ﷺ) finished a meal, he would say: \"Al-hamdu lillahi hamdan kathiran taiyyiban mubarakan fihi, ghaira makfiyyin wa la muwadda`in, wa la mustaghnan `anhu, Rabbuna. (All praise is due to Allah, praise which is abundant, pure, and full of blessings, which is indispensable and to which one cannot be indifferent).''  \r\n\r\n[Al-Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏الحمد لله حمداً كثيراً طَيِّباً مباركاً فيه، غير مكفى ولامودع، ولا مستغنى عنه ربنا‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 733
    },
    {
      "hadithNumber": 734,
      "english": {
        "narrated": "Mu'adh bin Anas (May Allah be pleased with him) reported:",
        "hadith": "Messenger of Allah (ﷺ) said, \"He who has taken food and says at the end: 'Al- hamdu lillahi-lladhi at'amani hadha, wa razaqanihi min ghairi haulin minni wa la quwwatin (All praise is due to Allah Who has given me food to eat and provided it without any endeavour on my part or any power),' all his past sins will be forgiven.\" [Abu Dawud and At- Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏من أكل طعاماً فقال‏:‏ الحمد الله الذي أطعمني هذا، ورزقنيه من غير حول منى ولا قوةٍ، غفر له ما تقدم من ذنبه‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 734
    },
    {
      "hadithNumber": 735,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) reported:",
        "hadith": "Messenger of Allah (ﷺ) never found fault with food. If he had inclination to eating it, he would eat; and if he disliked it, he would leave it.\n\n[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ما عاب رسول الله صلى الله عليه وسلم طعاماً قط، إن اشتهاه أكله، وإن كرهه تركه‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 735
    },
    {
      "hadithNumber": 736,
      "english": {
        "narrated": "Jabir (May Allah be pleased with him) reported:",
        "hadith": "The Prophet (ﷺ) asked for sauce and was told that there was nothing except vinegar. He asked for it and began to eat from it saying, \"How excellent is vinegar when eaten as sauce! How excellent is vinegar when eaten as Udm!\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏نعم الأدم الخل، نعم الأدم الخل‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 736
    },
    {
      "hadithNumber": 737,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"When any of you is invited to a meal, he should accept the invitation. If he is observing Saum (fasting), he should supplicate for the betterment of the host and if he is not fasting, he should eat.\"\n\n[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إذا دعي أحدكم ، فليجب، فإن كان صائما فليصل، وإن كان مفطراً فليطعم‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 737
    },
    {
      "hadithNumber": 738,
      "english": {
        "narrated": "Abu Mas'ud Al-Badri (May Allah be pleased with him) reported:",
        "hadith": "A man prepared some food especially for the Prophet (ﷺ) and invited him along with four others. But a man accompanied him. Having arrived at the door, Messenger of Allah (ﷺ) said to the host, \"This person has followed us. You may allow him, if you like, and if you like he will return.\" He said: \"O Messenger of Allah, I allow him, too.\"\n\n[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إن هذا تبعنا؛ فإن شئت أن تأذن له، وإن شئت رجع‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 738
    },
    {
      "hadithNumber": 739,
      "english": {
        "narrated": "'Umar bin Abu Salamah (May Allah be pleased with them) reported:",
        "hadith": "I was a boy under the care of Messenger of Allah (ﷺ), and as my hand used to wander around in the dish, he (ﷺ) said to me once, \"Mention Allah's Name (i.e., say Bismillah), eat with your right hand, and eat from what is in front of you.\"\n\n[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ يا غلام سم الله تعالى، وكل بيمينك،وكل مما يليك‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 739
    },
    {
      "hadithNumber": 740,
      "english": {
        "narrated": "Salamah bin Al-Akwa' (May Allah be pleased with him) reported on the authority of his father:",
        "hadith": "A man ate with his left hand in the presence of Messenger of Allah (ﷺ), whereupon he said, \"Eat with your right hand.\" The man said: \"I cannot do that.\" Thereupon he (the Prophet (ﷺ)) said, \"May you not be able to do that.\" It was vanity that prevented him from doing it and he could not raise it (the right hand) up to his mouth afterwards.[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن سلمةَ بن الأَكْوَع أنَّ رَجُلاً أَكَلَ عِنْدَ رَسُولِ الله بِشِمَالِهِ ، فَقَالَ : « كُلْ بِيَمِينِكَ » قَالَ : لا أسْتَطِيعُ . قَالَ : « لا اسْتَطَعْتَ » ! مَا مَنَعَهُ إِلا الكِبْرُ ! فَمَا رَفَعَهَا إِلَى فِيهِ . ((رواه مسلم))",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 740
    },
    {
      "hadithNumber": 741,
      "english": {
        "narrated": "Jabalah bin Suhaim reported:",
        "hadith": "We were with 'Abdullah bin Az-Zubair (May Allah be pleased with them) in a time of famine, then we were provided with dates. (Once) when we were eating, 'Abdullah bin 'Umar (May Allah be pleased with them) passed by us and said: \"Do not eat two dates together, for Messenger of Allah (ﷺ) prohibited it, unless one seeks permission from his brother (partner).\"\n\n[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"إلا أن يستأذن الرجل أخاه\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 741
    },
    {
      "hadithNumber": 742,
      "english": {
        "narrated": "Wahshi bin Harb (May Allah be pleased with him) reported:",
        "hadith": "Some of the Companions of Messenger of Allah (ﷺ) said: \"We eat but are not satisfied.\" He (ﷺ) said, \"Perhaps you eat separately.\" The Companions replied in affirmative. He then said: \"Eat together and mention the Name of Allah over your food. It will be blessed for you.\"\n\n[Abu Dawud].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن وحشى بن حرب رضى الله عنه أن أصحاب رسول الله صلى الله عليه وسلم قالوا‏:‏ يا رسول الله ، إنا نأكل ولا نشبع قال‏:‏ ‏\"‏فلعلكم تفترقون‏\"‏ قالوا‏:‏ نعم‏.‏ قال‏:‏ فاجتمعوا على طعامكم، واذكروا اسم الله ، يبارك لكم فيه‏\"‏ ((رواه أبو داود)) ‏‏‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 742
    },
    {
      "hadithNumber": 743,
      "english": {
        "narrated": "Ibn 'Abbas (May Allah be pleased with them) reported:",
        "hadith": "The Prophet (ﷺ) said, \"Blessing descends upon food in its middle, so eat from the sides of the vessel and do not eat from its middle.\"\n\n[Abu Dawud and At-Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏البركة تنزل وسط الطعام، فكلوا من حافتيه ولا تأكلوا من وسطه‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 743
    },
    {
      "hadithNumber": 744,
      "english": {
        "narrated": "'Abdullah bin Busr (May Allah be pleased with him) reported:",
        "hadith": "The Prophet (ﷺ) had a large bowl called Al-Gharra', which would be carried by four men. One day, when the Companions finished their Duha (forenoon optional) prayer, Al-Gharra' was brought full of sopped bread, meat and broth, and they sat down around it. When their number increased, Messenger of Allah (ﷺ) sat down on his knees and rested on the soles of his feet. A bedouin said to him: \"What sort of sitting is that?\" Thereupon Messenger of Allah (ﷺ) said, \"Verily, Allah has made me a courteous slave not a fierce tyrant.\" Then he said, \"Eat from the sides of the bowl and leave the central part of it so that your food will be blessed.\"[Abu Dawud].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏كلوا من حواليها، ودعوا ذروتها يبارك فيها‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 744
    },
    {
      "hadithNumber": 745,
      "english": {
        "narrated": "Abu Juhaifah Wahb bin 'Abdullah (May Allah be pleased with him) reported:",
        "hadith": "Messenger of Allah (ﷺ) said, \"I do not eat reclining (against a pillow).\"\n\n[Al-Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ لا آكل متكئاً‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 745
    },
    {
      "hadithNumber": 746,
      "english": {
        "narrated": "Anas (May Allah be pleased with him) reported:",
        "hadith": "I saw Messenger of Allah (ﷺ) eating some dates while sitting on his buttocks, with his legs raised.[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أنس رضى الله عنه قال‏:‏ رأيت رسول الله صلى الله عليه وسلم جالساً مقعياً يأكل تمراً.‏ ‏‏((رواه مسلم))‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 746
    },
    {
      "hadithNumber": 747,
      "english": {
        "narrated": "Ibn 'Abbas (May Allah be pleased with them) reported:",
        "hadith": "Messenger of Allah (ﷺ) said, \"When one of you finishes eating, he should not wipe his fingers until he has licked them himself or has given them to someone else to lick for him.\"\n\n[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إذا أكل أحدكم طعاماً، فلا يمسح أصابعه حتى يلعقها أو يلعقها‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 747
    },
    {
      "hadithNumber": 748,
      "english": {
        "narrated": "Ka'b bin Malik (May Allah be pleased with him) reported:",
        "hadith": "I saw Messenger of Allah (ﷺ) eating with three fingers (i.e., the thumb, the index finger and the middle finger) and licking them after having finished the food.[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن كعب بن مالك رضى الله عنه قال‏:‏ رأيت رسول الله صلى الله عليه وسلم يأكل بثلاث أصابع ، فإذا فرغ لعقها‏.‏‏‏((رواه مسلم))‏\n ‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 748
    },
    {
      "hadithNumber": 749,
      "english": {
        "narrated": "Jabir (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) commanded the licking of fingers and the gleaning of the dish, saying, \"You do not know in which portion the blessing lies.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إنكم لا تدرون في أي طعامكم البركة‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 749
    },
    {
      "hadithNumber": 750,
      "english": {
        "narrated": "Jabir (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"When a morsel of any of you falls, he should pick it up and remove any of the dirt on it and then eat it, and should not leave it for Satan nor should wipe his hand with towel until he has licked his fingers, for he does not know in what portion of the food the blessing lies.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إذا وقعت لقمة أحدكم، فليأخذها فليمط ما كان بها من أذى وليأكلها، ولا يدعها للشيطان، ولا يمسح يده بالمنديل حتى يلعق أصابعه؛ فإنه لا يدرى في أي طعامه البركة‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 750
    },
    {
      "hadithNumber": 751,
      "english": {
        "narrated": "Jabir (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Satan appears at every thing done by you; he appears even at one's dinner. When a morsel of any of you falls, he should pick it up and remove any dirt on it, and then eat it. He should not leave it for Satan, nor should he wipe his hand with the towel until he has licked his fingers, for he does not know in what portion of the food the blessing lies.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إن الشيطان يحضر أحدكم عند كل شئ من شأنه، حتى يحضره عند طعامه؛ فإذا سقطت لقمة أحدكم فليأخذها فليمط ما كان بها من أذى، ثم ليأكلها ولا يدعها للشيطان، فإذا فرغ فليلعق أصابعه؛ فإنه لا يدرى في أي طعامه البركة‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 751
    },
    {
      "hadithNumber": 752,
      "english": {
        "narrated": "Anas (May Allah be pleased with him) reported:",
        "hadith": "Whenever the Messenger of Allah (ﷺ) ate food, he would lick his three fingers and say, \"If anyone of you drops a morsel of food, he should remove any dirt that may have stuck on it and then eat it, and should not leave it for Satan.\" He (ﷺ) also commanded us that we should glean the pot, saying, \"You do not know in which part of your food the blessings lies.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أنس رضى الله عنه قال‏:‏ كان رسول الله صلى الله عليه وسلم إذا أكل طعاماً، لعق أصابعه الثلاث، وقال‏:‏‏\"‏إذا سقطت لقمة أحدكم فليأخذها، وليمط عنها الأذى، وليأكلها،ولا يدعها للشيطان‏\"‏ وأمرنا أن نسلت القصعة وقال‏:‏ ‏\"‏إنكم لا تدرون في أي طعامكم البركة‏\"‏ ‏.‏‏‏((رواه مسلم))‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 752
    },
    {
      "hadithNumber": 753,
      "english": {
        "narrated": "Sa'id bin Al-Harith reported:",
        "hadith": "I asked Jabir (May Allah be pleased with him) whether it was obligatory to make Wudu' for Salat (prayer) after eating cooked food. He said: \"No, because in the lifetime of Messenger of Allah (ﷺ), such food was rarely available. We had no handkerchiefs, so when we ate such food we would wipe our fingers against our palms, forearms or (the sole of our) feet, and would offer Salat without fresh Wudu' (for prayer).\"[Al- Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن سعيد بن الحارث أنه سأل جابراً رضى الله عنه عن الوضوء مما مست النار، فقال‏:‏ لا ، قد كنا زمن النبي صلى الله عليه وسلم لا نجد مثل ذلك الطعام إلا قليلاً، فإذا نحن وجدناه، لم يكن لنا مناديل إلا أكفنا وسواعدنا وأقدامنا، ثم نصلى ولا نتوضأ‏.‏ ‏‏((‏رواه البخارى‏)‏‏)‏‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 753
    },
    {
      "hadithNumber": 754,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"The food of two persons suffices for three persons, and the food of three persons suffices for four persons.\"\n\n[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن أبى هريرة رضى الله عنه قال ‏:‏ قال رسول الله  صلى الله عليه وسلم ‏:‏طعام الاثنين كافي الثلاثة، وطعام الثلاثة كافي الأربعة‏\"‏.‏ ((متفق عليه))",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 754
    },
    {
      "hadithNumber": 755,
      "english": {
        "narrated": "Jabir bin 'Abdullah (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"The food of one person suffices for two, the food of two persons suffices for four persons, and the food of four persons suffices for eight persons.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏طعام الواحد يكفى الاثنين، وطعام الاثنين يكفى الأربعة، وطعام الأربعة يكفى الثمانية‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 755
    },
    {
      "hadithNumber": 756,
      "english": {
        "narrated": "Anas (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) used to breathe three times in the course of a drink (he used to drink in three gulps).\n\n[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن أنس رضى الله عنه أن رسول الله صلى الله عليه وسلم كان يتنفس في الشراب ثلاثاً‏.‏((متفق عليه))",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 756
    },
    {
      "hadithNumber": 757,
      "english": {
        "narrated": "Ibn 'Abbas (May Allah be pleased with them) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Do not drink in one gulp like a camel, but in two or three (gulps). Mention the Name of Allah (i.e., say Bismillah) when you start drinking and praise Him (i.e., say Al-hamdu lillah) after you have finished (drinking).\"[At- Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا تشربوا واحداً كشرب البعير، ولكن اشربوا مثنى وثلاث، وسموا إذا أنتم شربتم،واحمدوا إذا أنتم رفعتم‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 757
    },
    {
      "hadithNumber": 758,
      "english": {
        "narrated": "Abu Qatadah (May Allah be pleased with him) reported:",
        "hadith": "The Prophet (ﷺ) forbade breathing into the vessel while drinking.[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبى قتادة رضى الله عنه أن النبي صلى الله عليه وسلم نهى أن يتنفس في الإناء‏.‏‏((متفق عليه))",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 758
    },
    {
      "hadithNumber": 759,
      "english": {
        "narrated": "Anas (May Allah be pleased with him) reported:",
        "hadith": "Milk mixed with water was brought to the Messenger of Allah (ﷺ). On his right side was sitting a bedouin and on his left was sitting Abu Bakr (May Allah be pleased with him). He (ﷺ) drank from it and handed the rest to the bedouin saying, \"One who is on the right has preference, then again the one who is on the right.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏الأيمن فالأيمن‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 759
    },
    {
      "hadithNumber": 760,
      "english": {
        "narrated": "Sahl bin Sa'd (May Allah be pleased with him) reported:",
        "hadith": "A drink was brought to the Messenger of Allah (ﷺ) and he drank (some) from it. On his right was a boy and on his left were some elderly people. He (ﷺ) said to the boy, \"Would you permit me to give rest of this drink to these on my left?\" The boy said: \"O Messenger of Allah, I would certainly not give preference to anyone in anything that might come to me from you.\" So he (ﷺ) handed over the rest of the drink to him.[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏أتأذن لي أن أعطى هؤلاء‏.‏‏؟‏‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 760
    },
    {
      "hadithNumber": 761,
      "english": {
        "narrated": "Abu Sa'id Al-Khudri (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) forbade turning the water-skin upside down and drinking directly from its mouth.\n\n[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن أبى سعيد الخدرى رضى الله عنه قال ‏:‏ نهى رسول الله عن اختناث الأسقية ‏:‏ يعنى‏:‏ أن تكسر أفواهها، ويشرب منها‏.‏((متفق عليه))",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 761
    },
    {
      "hadithNumber": 762,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) prohibited drinking directly out of the mouth of a water- skin.[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبى هريرة رضى الله عنه قال‏:‏ نهى رسول الله صلى الله عليه وسلم أن يشرب من في السقاء أو القربة.‏((متفق عليه))",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 762
    },
    {
      "hadithNumber": 763,
      "english": {
        "narrated": "Umm Thabit Kabshah (May Allah be pleased with her), daughter of Thabit (May Allah be pleased with him) and the sister of Hassan bin Thabit, the Prophet's poet) reported:",
        "hadith": "The Messenger of Allah (ﷺ) visited me and drank some water from a hanging water-skin while he was in a standing posture. So, I stood up and cut off the mouth (of that water-skin).[At- Tirmidhi].\nAn-Nawawi said that the reason why she did this was to preserve the part of the water-skin which the lips of Messenger of Allah (ﷺ) touched, gain blessings from it, and preserve it from dishonor. This narration is understood to show permissibility whereas the previous two narrations are to show what is better and closer to perfection. Allah knows best.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أم ثابت كبشة بنت ثابت أخت حسان بن ثابت رضى الله عنه وعنها قالت‏:‏ دخل عليَّ رسول الله صلى الله عليه وسلم، فشرب من فيّ قربة معلقة قائماً، فقمت إلى فيها فقطعته‏ ‏((رواه الترمذي وقال: حديث حسن صحيح)).\nوإنما قطعتها لتحفظ موضع فم رَسُول اللَّهِ ﷺ وتتبرك به وتصونه عن الابتذال. وهذا الحديث محمول على بيان الجواز، والحديثان السابقان لبيان الأفضل والأكمل، والله أعلم.",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 763
    },
    {
      "hadithNumber": 764,
      "english": {
        "narrated": "Abu Sa'id Al-Khudri (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) prohibited us blowing in the drinking water. A man said: \"O Messenger of Allah! Sometimes I see some litter floating about on the surface. What should I do then?\" He (ﷺ) replied, \"Pour them out.\" Then the man said: \"My thirst is not quenched with one draught.\" Messenger of Allah (ﷺ) said, \"Then put away the cup from your mouth (in between three gulps), and take breath.\"\n\n[At-Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن أبى سعيد الخدرى رضى الله عنه أن النبي صلى الله عليه وسلم نهى عن النفخ في الشراب، فقال رجل ‏:‏ القذاة أراها في الإناء‏؟‏ فقالب‏:‏ ‏\"‏أهرقها‏\"‏ قال‏:‏ إني لا أروى من نفس واحد‏؟‏ قال‏:‏ ‏\"‏فأبن القدح إذاً عن فيك‏\"‏.‏((رواه الترمذي))",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 764
    },
    {
      "hadithNumber": 765,
      "english": {
        "narrated": "Ibn 'Abbas (May Allah be pleased with them) reported:",
        "hadith": "The Prophet (ﷺ) prohibited us from breathing into the drinking vessel or blowing in it.[At-Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن ابن عباس رضى الله عنهما أن النبي صلى الله عليه وسلم نهى أن يتنفس في الإناء، أو ينفخ فيه‏.‏((رواه الترمذي))",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 765
    },
    {
      "hadithNumber": 766,
      "english": {
        "narrated": "Ibn 'Abbas (May Allah be pleased with them) reported:",
        "hadith": "I served the Messenger of Allah (ﷺ) Zamzam water to drink and he drank it while he was standing.\n\n[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن ابن عباس رضى الله عنهما قال‏:‏ سقيت النبي صلى الله عليه وسلم من زمزم، فشرب وهو قائم ‏.‏((متفق عليه))",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 766
    },
    {
      "hadithNumber": 767,
      "english": {
        "narrated": "An-Nazzal bin Sabrah (May Allah be pleased with him) reported:",
        "hadith": "'Ali bin Abu Talib (May Allah be pleased with him) arrived at Bab Ar-Rahbah (in Kufah) and drank water in a standing posture. Then he said: \"I saw the Messenger of Allah (ﷺ) doing what you have seen me doing.\"[Al-Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن النزال بن سبرة رضى الله عنه قال‏:‏ أتى علي رضى الله عنه باب الرحبة فشرب قائماً، وقال‏:‏ إني رأيت رسول الله صلى الله عليه وسلم فعل كما رأيتموني فعلت‏.‏‏‏((‏رواه البخارى‏)‏‏)‏‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 767
    },
    {
      "hadithNumber": 768,
      "english": {
        "narrated": "Ibn 'Umar (May Allah be pleased with them) reported:",
        "hadith": "During the lifetime of the Messenger of Allah (ﷺ) we would eat while walking and would drink while standing.[At- Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن ابن عمر رضى الله عنهما قال‏:‏كنا نأكل على عهد رسول الله صلى الله عليه وسلم ونحن نمشى ، ونشرب ونحن قيام‏.‏((رواه الترمذي))",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 768
    },
    {
      "hadithNumber": 769,
      "english": {
        "narrated": "'Amr bin Shu'aib on the authority of his father and grandfather reported:",
        "hadith": "I saw Messenger of Allah (ﷺ) drink standing, or sitting.[At-Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن عمرو بن شعيب عن أبيه عن جده رضى الله عنه قال‏:‏ رأيت رسول الله صلى الله عليه وسلم يشرب قائماً أو قاعداً‏.‏ ((رواه الترمذي))",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 769
    },
    {
      "hadithNumber": 770,
      "english": {
        "narrated": "Anas (May Allah be pleased with him) reported:",
        "hadith": "The Prophet (ﷺ) forbade us from drinking while standing. Qatadah reported: \"We asked him: 'What about eating?\"' He said: \"That is even worse, (or may be he said) more detestable.\"Another narration is: The Messenger of Allah (ﷺ) reprimanded [us] for drinking while standing.[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أنس رضى الله عنه عن النبي  صلى الله عليه وسلم أنه نهى أن يشرب الرجل قائماً‏.‏ قال قتادة‏:‏ فقلنا لأنس‏:‏ فالأكل‏؟‏ قال‏:‏ ذلك أشر -أو أخبث- ‏.‏ وفى رواية له أن النبي صلى الله عليه وسلم زجر عن الشرب قائما.‏‏((رواه مسلم))‏\n \nوفى رواية له أن النبي صلى الله عليه وسلم زجر عن الشرب قائماً‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 770
    },
    {
      "hadithNumber": 771,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"None of you should drink standing; and if any one forgets, he must vomit.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبى هريرة رضى الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ لا يشربن أحد منكم قائماً، فمن نسى فليستقئ‏\"‏‏‏‏. ((رواه مسلم))‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 771
    },
    {
      "hadithNumber": 772,
      "english": {
        "narrated": "Abu Qatadah (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"He who serves others with drinking water should be the last to drink himself.\"\n\n[At-Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ ساقي القوم آخرهم شرباً‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 772
    },
    {
      "hadithNumber": 773,
      "english": {
        "narrated": "Anas bin Malik (May Allah be pleased with him) reported:",
        "hadith": "Once the time for As-Salat (the prayer) approached. Those whose houses were near, went to their houses (to perform Wudu') while some of the people remained with the Messenger of Allah (ﷺ). A stone (containing some water) bowl was brought for him. It was too small for him to spread his hand over it. He performed his Wudu' and it (the water) sufficed for all the others also. Anas was asked: \"How many of you were present there?\" He said: \"Eighty or more.\"\n\n[Al-Bukhari and Muslim]. This is Al-Bukhari's version.\nIn Muslim's version \"'that Allah's Apostle (ﷺ) called for a container of water so he was given a vessel that had some water.' Anas said 'Then I started looking at the water spouting from his fingers. Then I estimated (the persons) and they were between seventy and eighty.'\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "عن أنس رضى الله عنه قال‏:‏ حضرت الصلاة، فقام من كان قريب الدار إلى أهله، وبقى قوم فأتى رسول الله صلى الله عليه وسلم بمخضب من حجارة، فصغر المخضب أن يبسط فيه كفه، فتوضأ القوم كلهم‏.‏ قالوا‏:‏ كم كنتم‏؟‏ قال‏:‏ ثمانين وزيادة‏.‏((متفق عليه))، هذه رواية البخاري.\nوفي رواية مسلم:‏ أن النبي صلى الله عليه وسلم دعا بإناء من ماء، فأتى بقدح رحراح فيه شئ من ماء، فوضع أصابعه فيه‏.‏ قال أنس ‏:‏ فجعلت أنظر إلى الماء ينبع من بين أصابعه ‎، فحزرت من توضأ ما بين السبعين إلى الثمانين‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 773
    },
    {
      "hadithNumber": 774,
      "english": {
        "narrated": "'Abdullah bin Zaid (May Allah be pleased with him) reported:",
        "hadith": "The Prophet (ﷺ) visited us and we brought water for him in a brass vessel for his ablution and he performed ablution.[Al- Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن عبد الله بن زيد رضى الله عنه قال‏:‏ أتانا النبي صلى الله عليه وسلم، فأخرجنا له ماء في نور من صفر فتوضأ‏.‏‏‏((‏رواه البخارى‏)‏‏)‏‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 774
    },
    {
      "hadithNumber": 775,
      "english": {
        "narrated": "Jabir (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) visited the house of a man of the Ansar with one of his Companions and said to him, \"If you have some water in the water-skin left over from last night, give it to us for drinking; otherwise, we shall drink from some stream directly.\"[Al- Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏إن كان عندك ماء بات هذه الليلة في سنة وإلا كرعنا‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 775
    },
    {
      "hadithNumber": 776,
      "english": {
        "narrated": "Hudhaifah (May Allah be pleased with him) reported:",
        "hadith": "The Prophet (ﷺ) prohibited us from wearing brocade or silk and drinking out of gold or silver vessels and said, \"These are meant for them (disbelievers) in this world and for you in the Hereafter.\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏هي لهم في الدنيا، وهى لكم في الآخرة‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 776
    },
    {
      "hadithNumber": 777,
      "english": {
        "narrated": "Umm Salamah (May Allah be pleased with her) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"He who drinks from the vessel of silver kindles the Fire (of Hell) in his belly.\"[Al-Bukhari and Muslim].A narration in Muslim is: The Messenger of Allah (ﷺ) said, \"Surely, he who eats or drinks in gold and silver vessels fills his belly with Hell-fire.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أم سلمة رضى الله عنها أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏الذي يشرب في آنية الفضة إنما يجرجر في بطنه نار جهنم‏\"‏‏.((متفق عليه))  \n‏ وفى ‏:‏ ‏\"‏إن الذي يأكل أو يشرب في آنية الفضة والذهب‏\"‏  \nوفى رواية له‏:‏ ‏\"‏ من شرب في إناءٍ من ذهب أو فضة فإنما يجرجر في بطنه ناراً من جهنم‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 2,
      "bookName": "2The Book About the Etiquette of Eatingكتـــــاب أدب الطعام",
      "bookReference": 777
    }
  ]
}