{
  "collectionId": "riyadussalihin",
  "bookId": 16,
  "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
  "hadithCount": 46,
  "hadiths": [
    {
      "hadithNumber": 1465,
      "english": {
        "narrated": "An-Nu'man bin Bashir (May Allah be pleased with them) reported:",
        "hadith": "The Prophet (ﷺ) said, \"Du'a (supplication) is worship.\"[Abu Dawud].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏الدعاء هو العبادة‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1465
    },
    {
      "hadithNumber": 1466,
      "english": {
        "narrated": "'Aishah (May Allah be pleased with her) reported:",
        "hadith": "The Messenger of Allah (ﷺ) liked comprehensive supplications or (Al-Jawami' - i.e., supplications with very few words but comprehensive in meanings), and discarded others.[Abu Dawud].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن عائشة، رضي الله عنها، قالت‏:‏ كان رسول الله صلى الله عليه وسلم، يستحب الجوامع من الدعاء، ويدع ما سوى ذلك‏.‏ ‏(‏‏(‏رواه أبو داود بإسناد جيد‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1466
    },
    {
      "hadithNumber": 1467,
      "english": {
        "narrated": "Anas (May Allah be pleased with him) reported:",
        "hadith": "The supplication most often recited by the Prophet (ﷺ) was: \"Allahumma atina fid-dunya hasanatan, wa fil-akhirati hasanatan, wa qina 'adhab-annar (O our Rubb! give us in this world that which is good and in the Hereafter that which is good, and save us from the punishment of the Fire).\"'[Al-Bukhari and Muslim].In the narration of Muslim it is added that whenever Anas supplicated, he used to beseech Allah with this Du'a.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏اللهم آتنا في الدنيا حسنة، وفي الآخرة حسنة، وقنا عذاب النار‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1467
    },
    {
      "hadithNumber": 1468,
      "english": {
        "narrated": "'Abdullah bin Mas'ud (May Allah be pleased with him) reported:",
        "hadith": "The Prophet (ﷺ) used to supplicate: \"Allahumma inni as'alukal-huda, wat-tuqa, wal-'afafa, wal-ghina (O Allah! I beseech You for guidance, piety, chastity and contentment).\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏اللهم إني أسألك الهدى، والتقى، والعفاف، والغنى‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1468
    },
    {
      "hadithNumber": 1469,
      "english": {
        "narrated": "Tariq bin Ashyam (May Allah be pleased with him) reported:",
        "hadith": "Whenever a man entered the fold of Islam, the Prophet (ﷺ) would show him how to perform Salat and then direct him to supplicate: \"Allahumm-aghfir li, warhamni, wa-hdini, wa 'afini, warzuqni (O Allah! Forgive me, have mercy on me, guide me, guard me against harm and provide me with sustenance and salvation).\"'[Muslim].In another narration Tariq said: A man came to the Prophet (ﷺ) and said to him: \"O Messenger of Allah! What shall I say if I want to pray to my Rubb?\" He (ﷺ) said, \"Say: 'Allahumma-ghfir li, warhamni, wa 'afini, warzuqni (O Allah! Forgive me, have mercy on me, protect me and provide me with sustenance).' Surely, this supplication is better for you in this life and in the Hereafter.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن طارق بن أشيم، رضي الله عنه، قال‏:‏ كان الرجل إذا أسلم علمه النبي صلى الله عليه وسلم، الصلاة، ثم أمره أن يدعو بهؤلاء الكلمات‏:‏ ‏\"‏اللهم اغفر لي، وارحمني، واهدني، وعافني، وارزقني‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ \nوفي رواية له عن طارق أنه سمع النبي صلى الله عليه وسلم، وأتاه رجل، فقال‏:‏ يا رسول الله، كيف أقول حين أسأل ربي‏؟‏ قال‏:‏ ‏\"‏قل‏:‏ اللهم اغفر لي، وارحمني، وعافني، وارزقني، فإن هؤلاء تجمع لك دنياك وآخرتك‏\"‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1469
    },
    {
      "hadithNumber": 1470,
      "english": {
        "narrated": "'Abdullah bin 'Amr bin Al-'As (May Allah be pleased with them) reported:",
        "hadith": "The Messenger of Allah (ﷺ) supplicated: \"Allahumma musarrifal-qulubi, sarrif qulubana 'ala ta'atika (O Allah! Controller of the hearts, direct our hearts to Your obedience).\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏اللهم مصرف القلوب صرف قلوبنا على طاعتك‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1470
    },
    {
      "hadithNumber": 1471,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) reported:",
        "hadith": "The Prophet (ﷺ) said, \"Seek refuge in Allah against the turmoils, attacks of misfortunes, and evil of judgement and joys of the enemies.\"[Al-Bukhari and Muslim]  .  And in a narration Sufyan said \"I suspect I added one.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏تعوذوا بالله من جهد البلاء، ودرك الشقاء، وسوء القضاء، وشماته الأعداء‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1471
    },
    {
      "hadithNumber": 1472,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) used to say: \"Allahumm-aslih li diniyalladhi huwa 'ismatu amri, wa aslih li dunyaya-llati fiha ma'ashi, wa aslih li akhirati-llati fiha ma'adi, waj'alil-hayata ziyadatan li fi kulli khair, waj'alil-mauta rahatan li min kulli sharrin (O Allah, make my religion easy for me by virtue of which my affairs are protected, set right for me my world where my life exists, make good for me my Hereafter which is my resort to which I have to return, and make my life prone to perform all types of good, and make death a comfort for me from every evil).\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏اللهم أصلح لي ديني الذي هو عصمة أمري، وأصلح لي دنياي التي فيها معاشي، وأصلح لي آخرتي التي فيها معادي، واجعل الحياة زيادة لي في كل خير، واجعل الموت راحة لي من كل شر‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1472
    },
    {
      "hadithNumber": 1473,
      "english": {
        "narrated": "'Ali (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said to me, \"Recite: 'Allahumma-hdini wa saddidni (O Allah! Direct me to the Right Path and make me adhere to the Straight Path).\" Another narration is: 'Allahumma inni as'aluk-alhuda was-sadad (I beg You for guidance and uprightness).\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن علي رضي الله عنه قال‏:‏ قال لي رسول الله صلى الله عليه وسلم‏:‏ ‏\"‏قل‏:‏ اللهم اهدني، وسددني‏\"‏‏.‏ وفي رواية‏:‏ ‏\"‏اللهم إني أسألك الهدى، والسداد‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1473
    },
    {
      "hadithNumber": 1474,
      "english": {
        "narrated": "Anas (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) used to supplicate: \"Allahumma inni a'udhu bika minal-ajzi wal- kasali, wal-jubni wal-harami, wal-bukhli, wa a'udhu bika min 'adhabil- qabri, wa a'udhu bika min fitnatil-mahya wal-mamat [O Allah! I seek refuge in You from helplessness (to do good), indolence, cowardice, senility, and miserliness; and I seek Your Protection against the torment of the grave and the trials of life and death].\" Another narration adds: \"wa dala'id-daini wa ghalabatir-rijal (And from the burden of indebtedness and the tyranny of men).\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أنس رضي الله عنه قال‏:‏ كان رسول الله صلى الله عليه وسلم‏:‏ يقول‏:‏ ‏\"‏اللهم إني أعوذ بك من العجز والكسل والجبن والهرم، والبخل، وأعوذ بك من عذاب القبر، وأعوذ بك من فتنة المحيا والممات‏\"‏‏.‏ وفي رواية‏:‏ ‏\"‏وضلع الدين وغلبة الرجال‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1474
    },
    {
      "hadithNumber": 1475,
      "english": {
        "narrated": "Abu Bakr As-Siddiq (May Allah be pleased with him) reported:",
        "hadith": "I requested the Messenger of Allah (ﷺ) to teach me a supplication which I could recite in my Salat (prayer). Thereupon he said, \"Recite: 'Allahumma inni zalamtu nafsi zulman kathiran, wa la yaghfirudh- dhunuba illa Anta, faghfir li maghfiratan min 'indika, warhamni, innaka Antal-Ghafur-ur-Rahim (O Allah! I have considerably wronged myself. There is none to forgive the sins but You. So grant me pardon and have mercy on me. You are the Most Forgiving, the Most Compassionate).\"'[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي بكر الصديق رضي الله عنه أنه قال لرسول الله صلى الله عليه وسلم‏:‏ علمني دعاء أدعو به في صلاتي، قال‏:‏ ‏\"‏قل‏:‏ اللهم إني ظلمت نفسي ظلمًا كثيرًا، ولا يغفر الذنوب إلا أنت، فاغفر لي مغفرة من عندك، وارحمني، إنك أنت الغفور الرحيم‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ وفي رواية‏:‏ ‏\"‏وفي بيتي‏\"‏ وروي‏:‏ ‏\"‏ظلمًا كثيرًا‏\"‏ وروي ‏\"‏كبيرًا‏\"‏ بالثاء المثلثة وبالباء الموحدة، فينبغي أن يجمع بينهما، فقال‏:‏ كثيرًا كبيرًا‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1475
    },
    {
      "hadithNumber": 1476,
      "english": {
        "narrated": "Abu Musa (May Allah be pleased with him) reported:",
        "hadith": "The Prophet (ﷺ) used to supplicate: \"Allahumm-aghfir li khati'ati, wajahli, wa israfi fi amri, wa ma Anta a'lamu bihi minni. Allahumm-aghfir li jiddi wa hazli, wa khata'i wa 'amdi, wa kullu dhalika 'indi. Allahumm-aghfir li ma qaddamtu wa ma akhkhartu, wa ma asrartu, wa ma a'lantu, wa ma Anta a'lamu bihi minni. Antal-Muqaddimu, wa Antal-Mu'akhkhiru; wa Anta 'ala kulli shai'in Qadir (O Allah! Forgive my errors, ignorance and immoderation in my affairs. You are better aware of my faults than myself. O Allah! Forgive my faults which I committed in seriousness or in fun deliberately or inadvertently. O Allah! Grant me pardon for those sins which I committed in the past and I may commit in future, which I committed in privacy or in public and all those sins of which You are better aware than me. You Alone can send whomever You will to Jannah, and You Alone can send whomever You will to Hell-fire and You are Omnipotent).\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏اللهم اغفر لي خطيئتي وجهلي، وإسرافي في أمري، وما أنت أعلم به مني، اللهم اغفر لي جدي وهزلي، وخطئي وعمدي، وكل ذلك عندي، اللهم اغفر لي ما قدمت وما أخرت، وما أسررت وما أعلنت، وما أنت أعلم به مني، أنت المقدم، وأنت المؤخر، وأنت على كل شيء قدير‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1476
    },
    {
      "hadithNumber": 1477,
      "english": {
        "narrated": "'Aishah (May Allah be pleased with her) reported:",
        "hadith": "The Prophet (ﷺ) used to supplicate (in these words): \"Allahumma inni audhu bika min sharri ma 'amiltu, wa min sharri ma lam a'mal (O Allah! I seek refuge in You from the evil of that which I have done and the evil of that which I have not done).\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏اللهم إني أعوذ بك من شر ما عملت ومن شر ما لم أعمل‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1477
    },
    {
      "hadithNumber": 1478,
      "english": {
        "narrated": "'Abdullah bin 'Umar (May Allah be pleased with them) reported:",
        "hadith": "The Messenger of Allah (ﷺ) used to supplicate thus: \"Allahumma inni a'udhu bika min zawali ni'matika, wa tahawwuli 'afiyatika, wa fuja'ati niqmatika, wa jami'i sakhatika (O Allah! I seek refuge in You against the declining of Your Favours, passing of safety, the suddenness of Your punishment and all that which displeases You).\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏اللهم إني أعوذ بك من زوال نعمتك، وتحول عافيتك، وفجاءة نقمتك، وجميع سخطك‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1478
    },
    {
      "hadithNumber": 1479,
      "english": {
        "narrated": "Zaid bin Arqam (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) would supplicate: \"Allahumma inni a'udhu bika minal-'ajzi wal-kasali, wal-bukhli wal-harami, wa 'adhabil-qabri. Allahumma ati nafsi taqwaha, wa zakkiha Anta khairu man zakkaha, Anta waliyyuha wa maulaha. Allahumma inni a'udhu bika min 'ilmin la yanfau', wa min qalbin la yakhsha'u, wa min nafsin la tashba'u, wa min da'watin la yustajabu laha' [O Allah! I seek refuge in You from the inability (to do good), indolence, cowardice, miserliness, decrepitude and torment of the grave. O Allah! Grant me the sense of piety and purify my soul as You are the Best to purify it. You are its Guardian and its Protecting Friend. O Allah! I seek refuge in You from the knowledge which is not beneficial, and from a heart which does not fear (You), and from desire which is not satisfied, and from prayer which is not answered].\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏اللهم إني أعوذ بك من العجز والكسل، والبخل والهرم، وعذاب القبر، اللهم آت نفسي تقواها، وزكها أنت خير من زكاها، أنت وليها ومولاها، اللهم إني أعوذ بك من علم لا ينفع ومن قلب لا يخشع، ومن نفس لا تشبع، ومن دعوة لا يستجاب لها‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1479
    },
    {
      "hadithNumber": 1480,
      "english": {
        "narrated": "Ibn 'Abbas (May Allah be pleased with them) reported:",
        "hadith": "The Messenger of Allah (ﷺ) used to supplicate: \"Allahumma laka aslamtu, wa bika amantu, wa 'alaika tawakkaltu, wa ilaika anabtu, wa bika khasamtu, wa ilaika hakamtu. Faghfir li ma qaddamtu, wa ma akh-khartu, wa ma asrartu wa ma a'lantu, Antal-Muqaddimu, wa Antal-Mu'akhkhiru, la ilaha illa Anta (O Allah! to You I submit, in You I affirm my faith, in You I repose my trust, to You I turn in repentance and with Your Help I contend my adversaries and from You I seek judgement. O Allah! Grant me forgiveness for the faults which I made in past and those ones I may commit in the future, those which I committed secretly or openly. You Alone send whomever You will to Jannah, and You Alone send whomever You will to Hell-fire. There is none worthy of worship except You).\" Another narration adds: \"La hawla wa la quwwata illa billah (There is no strength to resist evil and no power to do good except through Allah).\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن ابن عباس رضي الله عنهما أن رسول الله صلى الله عليه وسلم، كان يقول‏:‏ ‏\"‏اللهم لك أسلمت، وبك آمنت، وعليك توكلت، وإليك أنبت وبك خاصمت، وإليك حاكمت، فاغفر لي ما قدمت، وما أخرت وما أسررت وما أعلنت، أنت المقدم، وأنت المؤخر، لا إله إلا أنت‏\"‏ زاد بعض الرواة‏:‏ ‏\"‏ولا حول ولا قوة إلا بالله‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1480
    },
    {
      "hadithNumber": 1481,
      "english": {
        "narrated": "'Aishah (May Allah be pleased with her) reported:",
        "hadith": "The Prophet (ﷺ) used to supplicate: \"Allahumma inni a'udhu bika min fitnatin-nari, wa 'adhabin-nari, wa min sharril-ghina wal-faqri (O Allah! I seek refuge in You from the trials and the torment of the Fire and from the evils of wealth and poverty).\"[Abu Dawud and At- Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏اللهم إني أعوذ بك من فتنة النار، وعذاب النار، ومن شر الغنى والفقر‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1481
    },
    {
      "hadithNumber": 1482,
      "english": {
        "narrated": "Ziyad bin 'Ilaqah reported:",
        "hadith": "My uncle Qutbah bin Malik (May Allah be pleased with him) said that the Prophet (ﷺ) used to supplicate: \"Allahumma inni a'udhu bika min munkaratil-akhlaqi, wal-a'mali, wal- ahwa'i (O Allah! I seek refuge in You from undesirable manners, deeds, and aspirations).\"[At-Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏اللهم إني أعوذ بك من منكرات الأخلاق، والأعمال، والأهواء‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1482
    },
    {
      "hadithNumber": 1483,
      "english": {
        "narrated": "Shakal bin Humaid (May Allah be pleased with him) reported:",
        "hadith": "I asked: \"O Messenger of Allah, teach me a prayer.\" He (ﷺ) said, \"Say: Allahumma inni a'udhu bika min sharri sam'i, wa min sharri basari, wa min sharri lisani, wa min sharri qalbi, wa min sharri maniyyi (O Allah! I seek refuge in You from the evils of my hearing, the evils of my seeing, the evils of my tongue; the evils of my heart and the evils of passions).\"[Abu Dawud and At- Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏قل‏:‏ اللهم إني أعوذ بك من شر سمعي، ومن شر بصري، ومن شر لساني، ومن شر قلبي، ومن شر مني‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1483
    },
    {
      "hadithNumber": 1484,
      "english": {
        "narrated": "Anas (May Allah be pleased with him) reported:",
        "hadith": "The Prophet (ﷺ) used to supplicate: \"Allahumma inni a'udhu bika minal-barasi, wal- jununi, wal-judhami, wa sayyi'il-asqami' (O Allah! I seek refuge in You from leucoderma, insanity, leprosy and evil diseases).\"[Abu Dawud].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏اللهم إني أعوذ بك من البرص والجنون، والجذام، وسيئ الأسقام‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1484
    },
    {
      "hadithNumber": 1485,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) used to supplicate: \"Allahumma inni a'udhu bika minal- ju'i, fa-innahu bi'sad-daji'u; wa a'udhu bika minal-khiyanati, fa- innaha bi'satil-bitanah' [O Allah! I seek refuge in You from hunger; surely, it is the worst companion. And I seek refuge in You from treachery; surely, it is a bad inner trait].\"[Abu Dawud].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏اللهم إني أعوذ بك من الجوع، فإنه بئس الضجيع، وأعوذ بك من الخيانة، فإنها بئست البطانة‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1485
    },
    {
      "hadithNumber": 1486,
      "english": {
        "narrated": "'Ali (May Allah be pleased with him) reported:",
        "hadith": "A slave who had made a contract with his master to pay for his freedom, came to me and said: \"I am unable to fulfill my obligation, so help me.\" He said to him: \"Shall I not teach you a supplication which the Messenger of Allah (ﷺ) taught me? It will surely prove so effective that if you have a debt as large as a huge mountain, Allah will surely pay it for you. Say: 'Allahumm-akfini bihalalika 'an haramika, wa aghnini bifadlika 'amman siwaka (O Allah! Grant me enough of what You make lawful so that I may dispense with what You make unlawful, and enable me by Your Grace to dispense with all but You).\"[At- Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏اللهم اكفني بحلالك عن حرامك، وأغنني بفضلك عمن سواك‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1486
    },
    {
      "hadithNumber": 1487,
      "english": {
        "narrated": "'Imran bin Husain (May Allah be pleased with them) reported:",
        "hadith": "The Prophet (ﷺ) taught my father two statements to recite in his Du'a. These are: \"Allahumma al-himni rushdi, wa a'idhni min sharri nafsi (O Allah! Inspire in me guidance and deliver me from the evils within myself).\"[At-Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏اللهم ألهمني رشدي، وأعذني من شر نفسي‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1487
    },
    {
      "hadithNumber": 1488,
      "english": {
        "narrated": "Abul-Fadl Al-`Abbas bin `Abdul-Muttalib (ra) reported:",
        "hadith": "I asked the Messenger of Allah (ﷺ) to teach me a supplication. He (ﷺ) said, \"Beg Allah for safety (from all evils in this world and in the Hereafter).\" I waited for some days and then I went to him again and asked him: \"O Messenger of Allah Teach me to supplicate something from Allah.\" He said to me, \"O Al-`Abbas, the uncle of Messenger of Allah! Beseech Allah to give you safety (Al-`afiyah ) in this life and in the Hereafter.\"[At- Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي الفضل العباس بن عبد المطلب رضي الله عنه قال‏:‏ قلت يا رسول الله‏:‏ علمني شيئًا أسأله الله تعالى، قال‏:‏ ‏\"‏سلوا الله العافية‏\"‏ فمكثت أيامًا، ثم جئت فقلت‏:‏ يا رسول الله‏:‏ علمني شيئًا أسأله الله تعالى، قال لي‏:‏ ‏\"‏يا عباس ‏يا عم رسول الله سلوا الله العافية في الدنيا والآخرة‏\"‏‏.‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن صحيح‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1488
    },
    {
      "hadithNumber": 1489,
      "english": {
        "narrated": "Shahr bin Haushab reported:",
        "hadith": "I asked Umm Salamah (May Allah be pleased with her), \"O Mother of the Believers! Which supplication did the Messenger of Allah (ﷺ) make frequently when he was in your house?\" She said: \"He (ﷺ) supplicated frequently: 'Ya muqallibal-qulubi, thabbit qalbi 'ala dinika (O Controller of the hearts make my heart steadfast in Your religion).\"[At- Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏يا مقلب القلوب ثبت قلبي على دينك‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1489
    },
    {
      "hadithNumber": 1490,
      "english": {
        "narrated": "Abud-Darda' (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"One of Prophet Dawud's supplications was: 'Allahumma inni as'aluka hubbaka, wa hubba man yuhibbuka, wal-'amalalladhi yuballighuni hubbaka. Allahumm-aj'al hubbaka ahabba ilayya min nafsi, wa ahli, wa minal-ma'il-baridi (O Allah! I ask You for Your Love, the love of those who love You, and deeds which will cause me to attain Your Love. O Allah! Make Your Love dearer to me than myself, my family and the cold water).\"'[At- Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي الدرداء، رضي الله عنه، قال‏:‏ رسول الله صلى الله عليه وسلم‏:‏ ‏\"‏كان من دعاء داود عليه السلام‏:‏ ‏\"‏اللهم إني أسألك حبك، وحب من يحبك، والعمل الذي يبلغني حبك، اللهم اجعل حبك أحب إلى من نفسي، وأهلي، ومن الماء البارد‏\"‏‏.‏ رواه الترمذي وقال حديث حسن‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1490
    },
    {
      "hadithNumber": 1491,
      "english": {
        "narrated": "Anas (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Recite frequently: 'Ya Dhal-Jalali wal-Ikram! (O You, Possessor of glory and honour).\"'[At- Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ألظوا بيا ذا الجلال والإكرام‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1491
    },
    {
      "hadithNumber": 1492,
      "english": {
        "narrated": "Abu Umamah (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) made many supplications which we did not memorize. We said to him: \"O Messenger of Allah! You have made many supplications of which we do not remember anything.\" He said, \"Shall I tell you a comprehensive prayer? Say: 'Allahumma inni as'aluka min khairi ma sa'alaka minhu nabiyyuka Muhammadun sallallahu 'alaihi wa sallam. Wa 'a'udhu bika min sharri mas-ta'adha minhu nabiyyuka Muhammadun sallallahu 'alaihi wa sallam. Wa Antal-Musta'anu, wa 'alaikal-balaghu, wa la hawla wa la quwwata illa billah (O Allah, I beg to You the good which Your Prophet Muhammad (ﷺ) begged of You; and I seek refuge in You from the evil where from Your Prophet Muhammad (ﷺ) sought refuge. You are the One from Whom help is sought and Your is the responsibility to communicate (the truth). There is no power or strength except with Allah the Exalted, the Great.\"'[At- Tirmidhi]",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي أمامة، رضي الله عنه قال‏:‏ دعا رسول الله صلى الله عليه وسلم، بدعاء كثير لم نحفظ منه شيئًا، قلنا: \"يا رسول الله دعوت بدعاء كثير لم نحفظ منه شيئا،\" فقال‏:‏ ‏\"‏ألا أدلكم على ما يجمع ذلك كله‏؟‏ تقول‏:‏ ‏\"‏اللهم إني أسألك من خير ما سألك منه نبيك محمد صلى الله عليه وسلم، وأعوذ بك من شر ما استعاذ منه نبيك محمد صلى الله عليه وسلم، وأنت المستعان، وعليك البلاغ، ولا حول ولا قوة إلا بالله‏\"‏‏.‏ رواه الترمذي وقال حديث حسن‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1492
    },
    {
      "hadithNumber": 1493,
      "english": {
        "narrated": "Ibn Mas'ud (May Allah be pleased with him) reported:",
        "hadith": "One of the supplications of the Messenger of Allah (ﷺ) was: \"Allahumma inni as'aluka mujibati rahmatika, wa 'aza'ima maghfiratika, was-salamata min kulli ithmin, wal-ghanimata min kulli birrin, wal-fawza bil- jannati, wannajata mina-nar (O Allah! I beg You for that which incites Your Mercy and the means of Your forgiveness, safety from every sin, the benefit from every good deed, success in attaining Jannah and deliverance from Fire).\"[Al-Hakim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏اللهم إني أسألك موجبات رحمتك، وعزائم مغفرتك، والسلامة من كل إثم، والغنيمة من كل بر، والفوز بالجنة، والنجاة من النار‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1493
    },
    {
      "hadithNumber": 1494,
      "english": {
        "narrated": "Abud-Darda' (May Allah be pleased with him) reported:",
        "hadith": "I heard the Messenger of Allah (ﷺ) saying, \"Whenever a Muslim supplicates for his (Muslim) brother in his absence, the angels say: 'May the same be for you too'.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏ما من عبد مسلم يدعو لأخيه بظهر الغيب إلا قال الملك ولك بمثل‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1494
    },
    {
      "hadithNumber": 1495,
      "english": {
        "narrated": "Abud-Darda' (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"The supplication of a Muslim for his (Muslim) brother in his absence will certainly be answered. Everytime he makes a supplication for good for his brother, the angel appointed for this particular task says: 'A meen! May it be for you, too'.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏دعوة المرء المسلم لأخيه بظهر الغيب مستجابة، عند رأسه ملك موكل كلما دعا لأخيه بخير قال الملك الموكل به‏:‏ آمين، ولك بمثل‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1495
    },
    {
      "hadithNumber": 1496,
      "english": {
        "narrated": "Usamah bin Zaid (May Allah be pleased with them) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"He who is favoured by another and says to his benefactor: `Jazak-Allah khairan (may Allah reward you well)' indeed praised (the benefactor) satisfactorily.''\n\n[At-Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏من صنع إليه معروف، فقال لفاعله‏:‏ جزاك الله خيرًا، فقد أبلغ في الثناء‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1496
    },
    {
      "hadithNumber": 1497,
      "english": {
        "narrated": "Jabir (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Do not invoke curses on yourself or on your children or on your possessions lest you should happen to do it at a moment when the supplications are accepted, and your prayer might be granted.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا تدعوا على أنفسكم، ولا تدعوا على أولادكم، ولا تدعو على أموالكم، لا توافقوا من الله ساعة يسأل فيها عطاء، فيستجيب لكم‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1497
    },
    {
      "hadithNumber": 1498,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"A slave becomes nearest to his Rubb when he is in prostration. So increase supplications in prostrations.\"[Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏أقرب ما يكون العبد من ربه وهو ساجد، فأكثروا الدعاء‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1498
    },
    {
      "hadithNumber": 1499,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ), \"The supplication of every one of you will be granted if he does not get impatient and say (for example): 'I supplicated my Rubb but my prayer has not been granted'.\"[Al-Bukhari and Muslim].The narration of Muslim is: \"The supplication of a slave continues to be granted as long as he does not supplicate for a sinful thing or for something that would cut off the ties of kinship and he does not grow impatient.\" It was said: \"O Messenger of Allah! What does growing impatient mean?\" He (ﷺ) said, \"It is one's saying: 'I supplicated again and again but I do not think that my prayer will be answered.' Then he becomes frustrated (in such circumstances) and gives up supplication altogether.\"",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏يستجاب لأحدكم ما لم يعجل‏:‏ يقول‏:‏ قد دعوت ربي، فلم يستجب لي‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1499
    },
    {
      "hadithNumber": 1500,
      "english": {
        "narrated": "Abu Umamah (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) was asked: \"At what time does the supplication find the greatest response?\" He (ﷺ) replied, \"A supplication made during the middle of the last part of the night and after the conclusion of the obligatory prayers.\"[At-Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏جوف الليل الآخر ودبر الصلوات المكتوبات‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1500
    },
    {
      "hadithNumber": 1501,
      "english": {
        "narrated": "'Ubadah bin As-Samit (May Allah be pleased with him) said:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"Whenever a Muslim supplicates Allah, He accepts his supplication or averts any similar kind of trouble from him until he prays for something sinful or something that may break the ties of kinship.\" Upon this someone of the Companions said: \"Then we shall supplicate plenty.\" The Messenger of Allah (ﷺ) said, \"Allah is more plentiful (in responding).\"[At- Tirmidhi].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن عبادة بن الصامت رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏ما على الأرض مسلم يدعو الله تعالى بدعوة إلا آتاه الله إياها، أو صرف عنه من السوء مثلها‏.‏ ما لم يدع بإثم، أو قطيعة رحم‏\"‏ فقال رجل من القوم‏:‏ إذًا نكثر قال‏:‏ ‏\"‏الله أكثر‏\"‏‏.‏ رواه الترمذي وقال حديث حسن صحيح‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1501
    },
    {
      "hadithNumber": 1502,
      "english": {
        "narrated": "Ibn 'Abbas (May Allah be pleased with them) said:",
        "hadith": "The Messenger of Allah (ﷺ) used to say when he was in distress: \"La ilaha illallahul-Azimul-Halim. La ilaha illallahu Rabbul-'Arshil-'Azim. La ilaha illallahu Rabbus-samawati, wa Rabbul-ardi, wa Rabbul-'Arshil- Karim. (None has the right to be worshipped but Allah the Incomparably Great, the Compassionate. None has the right to be worshipped but Allah the Rubb of the Mighty Throne. None has the right to be worshipped but Allah the Rubb of the heavens, the Rubb of the earth, and the Rubb of the Honourable Throne).\"[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏لا إله إلا الله العظيم الحليم، لا إله إلا الله رب العرش العظيم، لا إله إلا الله رب السماوات ورب الأرض ورب العرش الكريم‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1502
    },
    {
      "hadithNumber": 1503,
      "english": {
        "narrated": "'Abdur-Rahman bin Abu Bakr (May Allah be pleased with them) reported:",
        "hadith": "The Companions of As-Suffah were poor people. The Prophet (ﷺ) said, \"Whoever has food enough for two people, should take a third one (from among them), and whoever has food enough for four persons, should take a fifth or sixth (or said something similar).\" Abu Bakr (May Allah be pleased with him) took three people with him while Messenger of Allah (ﷺ) took ten. Abu Bakr (May Allah be pleased with him) took his supper with the Prophet (ﷺ) and stayed there till he offered the 'Isha' prayers. After a part of the night had passed, he returned to his house. His wife said to him: \"What has detained you from your guests?\" He said: \"Have you not served supper to them?\" She said: \"They refused to take supper until you come.\" [Abdur-Rahman (Abu Bakr's son) or the servants] presented the meal to them but they refused to eat. I (the narrator) hid myself out of fear. Abu Bakr (May Allah be pleased with him) (my father) rebuked me. Then he said to them: \"Please eat. By Allah! I will never eat the meal.\" 'Abdur-Rahman added: Whenever we took a morsel of the meal, the meal grew from underneath more than that morsel we had till everybody ate to his satisfaction; yet the remaining food was more than what was in the beginning. On seeing this, Abu Bakr (May Allah be pleased with him) called his wife and said: \"O sister of Banu Firas! What is this?\" She said: \"O pleasure of my eyes! The food has increased thrice in quantity.\" Then Abu Bakr (May Allah be pleased with him) started eating. He said: \"My oath not to take the meal was because of Satan.\" He took a morsel handful from it and carried the rest to the Prophet (ﷺ). That food remained with him. In those days there was a treaty between us and the pagans and when the period of that treaty elapsed, he (ﷺ) divided us into twelve groups and every group was headed by a man. Allah knows how many men were under the command of each leader. Anyhow, all of them ate of that meal.[Al-Bukhari and Muslim].There are some more narrations in both Al-Bukhari and Muslim with very minor differences in wordings and in details.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏من كان عنده طعام اثنين، فليذهب بثالث، ومن كان عنده طعام أربعة، فليذهب بخامس بسادس‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1503
    },
    {
      "hadithNumber": 1504,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) said, \"There were Muhaddithun (the recipients of Divine inspiration) among the nations before you. If there is any of such Muhaddith among my followers, he must be 'Umar.\"[Al- Bukhari].In Muslim, this Hadith is narrated by 'Aishah (May Allah be pleased with her), and in both these narrations Ibn Wahb has said that the meaning of Muhaddithun is recipients of Divine inspiration.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\"‏لقد كان فيما قبلكم من الأمم ناس محدثون، فإن يك في أمتي أحد، فإنه عمر‏\"‏ ‏(‏‏(‏رواه البخاري، ورواه مسلم من رواية عائشة، وفي روايتهما قال ابن وهب‏:‏ ‏\"‏محدثون‏\"‏ أي‏:‏ ملهمون‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1504
    },
    {
      "hadithNumber": 1505,
      "english": {
        "narrated": "Jabir bin Samurah (May Allah be pleased with them) said:",
        "hadith": "The inhabitants of Kufah complained to 'Umar (May Allah be pleased with him) against Sa'd bin Abu Waqqas (May Allah be pleased with him) and 'Umar (May Allah be pleased with him) appointed 'Ammar (May Allah be pleased with him) as Governor of Kufah in his place. Their complaint was that he did not even conduct As-Salat (the prayers) properly. 'Umar (May Allah be pleased with him) sent for Sa'd and said to him: \"O Abu Ishaq, the people claim that you do not offer the Salat properly.\" Sa'd replied: \"By Allah! I observe Salat according to the Salat of the Messenger of Allah (ﷺ), and I make no decrease in it. I prolong Qiyam (standing) in the first two Rak'ah in Maghrib and 'Isha' prayers and shorten in the last ones.\" 'Umar (May Allah be pleased with him) said: \"This is what I thought of you, O Abu Ishaq!\" Then he sent with him a man (or some men) to Kufah to investigate the matter about him (from the people of Kufah). The inquiry was conducted in every mosque and all the people in these mosques praised him; but in the mosque of the Banu 'Abs, a man, with the name of Usamah bin Qatadah and surname Abu Sa'dah, stood up and said, \"Sa'd bin Abu Waqqas did not participate in Jihad and he did not distribute the spoils equitably and did not judge justly.\" On this Sa'd said: \"I shall make three supplications in respect of him: O Allah! If this slave of Yours is a liar and seeker of notoriety, please prolong his life and lengthen his period of adversity and afflict him with trials.\" (And so did it happen.) Thereafter, when the man was asked about his condition he would say, \"I am an old man afflicted with trials and overtaken by the curses of Sa'd.\"'Abdul-Malik bin 'Umair (a subnarrator) said: I saw this man with eyebrows hung over his eyes as a result of his old age and he walked aimlessly, following young girls and winking at them.[Al-Bukhari and Muslim].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن جابر بن سَمُرة، رضي الله عنهما، قال‏:‏ شكا أهل الكوفة سعدًا، يعني‏:‏ ابن أبي وقاص، رضي الله عنه الله عنه، إلى عمر بن الخطاب، رضي الله عنه، فعزله واستعمل عليهم عمارًا، فشكوا حتى ذكروا أنه لا يحسن يصلي، فأرسل إليه، فقال‏:‏ يا أبا إسحاق، إن هؤلاء يزعمون أنك لا تحسن تصلي، فقال‏:‏ أما أنا والله فإني كنت أصلي بهم رسول الله صلى الله عليه وسلم، لا أخرم عنها أصلي صلاة العشاء فأركد في الأوليين، وأخف في الأخريين، قال‏:‏ ذلك الظن بك يا أبا إسحاق، وأرسل معه رجلا -أو رجالا- إلى الكوفة يسأل عنه أهل الكوفة، فلم يدع مسجدًا إلا سأل عنه، ويثنون معروفًا، حتى دخل مسجدًا لبني عبس، فقام رجل منهم، يقال له أسامة بن قتادة، يكنى أبا سعدة‏.‏ فقال‏:‏ أما إذ نشدتنا فإن سعدًا كان لا يسير بالسرية ولا يقسم بالسوية، ولا يعدل في القضية، قال سعد‏:‏ أم والله لأدعون بثلاث‏:‏ اللهم إن كان عبدك هذا كاذبًا، قام رياء، وسمعة، فأطل عمره، وأطل فقره، وعرضه للفتن‏.‏ وكان بعد ذلك إذا سئل يقول‏:‏ شيخ كبير مفتون، أصابتني دعوة سعد‏.‏ \nقال عبد الملك بن عمير الرواي عن جابر بن سمرة‏:‏ فأنا رأيته بعد قد سقط حاجباه على عينيه من الكبر، وإنه ليتعرض للجواري في الطرق فيغمزهن‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1505
    },
    {
      "hadithNumber": 1506,
      "english": {
        "narrated": "'Urwah bin Az-Zubair (May Allah be pleased with him) reported:",
        "hadith": "Arwa bint Aus brought a suit against Sa'id bin Zaid bin 'Amr bin Nufail (May Allah be pleased with him). She complained to Marwan bin Al-Hakam that he had wrongfully taken possession of a portion of her land. Sa'id said: \"How can I take a portion out of her land while I have heard a denunciation from the Messenger of Allah (ﷺ).\" Marwan asked him: \"What did you hear from the Messenger of Allah?\" He said, \"I heard the Messenger of Allah (ﷺ) saying, 'He who takes a span of land unjustly will be made to wear seven earths round his neck on the Day of Ressurection'.\" Marwan said to him: \"I don't seek proof from you after this.\" Sa'id supplicated: \"O Allah! If she is a liar, deprive her of her eye sight and cause her to die in her land.\" 'Urwah said: \"She did not die till she became blind. While she was walking in her land (concerning which the dispute arose) she fell down into a pit and died.\"[Al-Bukhari and Muslim].In another narration of Muslim, Muhammad bin Zaid bin 'Abdullah bin 'Umar said that he had seen Arwa blind, feeling for on the walls with her hand and saying: \"I am ruined by the curse of Sa'id.\" Later she fell in a well in the same disputed land and died.",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن عروة بن الزبير أن سعيد بن زيد بن عمرو بن نفيل، رضي الله عنه الله عنه خاصمته أروى بنت أوس إلى مروْان بن الحكم، وادعت أنه أخذ شيئًا من أرضها، فقال سعيد‏:‏ أنا كنت آخذ من أرضها شيئًا بعد الذي سمعت من رسول الله صلى الله عليه وسلم‏!‏‏؟‏ قال‏:‏ ماذا سمعت من رسول الله صلى الله عليه وسلم‏؟‏ قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏\"‏من أخذ شبرًا من الأرض ظلمًا، طوقه إلى سبعين أرضين‏\"‏ فقال له مروْان‏:‏ لا أسألك بينة بعد هذا، فقال سعيد‏:‏ اللهم إن كانت كاذبة، فأعمِ بصرها، واقتلها في أرضها، فقال‏:‏ فما ماتت حتى ذهب بصرها وبينما هي تمشي في أرضها إذ وقعت في حفرة فماتت‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ \nوفي رواية لمسلم عن محمد بن زيد بن عبد الله بن عمر بمعناه وأنه رآها عمياء تلتمس الجدر تقول‏:‏ أصابتني دعوة سعيد، وأنها مرت على بئر في الدار التي خاصمته فيها، فوقعت فيها فكانت قبرها‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1506
    },
    {
      "hadithNumber": 1507,
      "english": {
        "narrated": "Jabir bin 'Abdullah (May Allah be pleased with them) said:",
        "hadith": "My father called me on the evening before (the battle of) Uhud and said: \"I perceive that I shall be among the first from among the Companions of the Prophet (ﷺ) to be martyred, and after him you are the dearest to me. I am under the burden of debt. Pay it and treat your sisters well.\" Next morning he was among the first to be killed, so I buried him along with another in the same grave. Thereafter, I did not like that I should leave him with another in the grave. So I dug up his corpse after six months and he was in the same condition in which he was on the day when I buried him, except that there was a scratch on his ear. Then I buried him in a separate grave.[Al- Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن جابر بن عبد الله رضي الله عنه الله عنهما قال‏:‏ لما حضرت أحد دعاني أبي من الليل فقال‏:‏ ما رآني إلا مقتولا في أول من يقتل من أصحاب النبي صلى الله عليه وسلم، وإني لا أترك بعدي أعز علي منك غير نفس رسول الله صلى الله عليه وسلم، وإن علي دينا فاقضِ، واستوصِ بأخواتك خيرًا، فأصبحنا، فكان أول قتيل، ودفنت معه آخر في قبره، ثم لم تطب نفسي أن أتركه مع آخر، فاستخرجته بعد ستة أشهر، فإذا هو كيوم وضعته غير أذنه، فجعلته في قبر على حدة‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1507
    },
    {
      "hadithNumber": 1508,
      "english": {
        "narrated": "Anas (May Allah be pleased with him) reported:",
        "hadith": "Two Companions of the Prophet (ﷺ) left his home in a very dark night with something like lights in front of them; when they separated, each of them had one light in front of him till they arrived home.[Al- Bukhari].Other narrations reported in Al-Bukhari say that the two men were Usaid bin Hudhair and 'Abbad bin Bishr (May Allah be pleased with them).",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن أنس رضي الله عنه أن رجلين من أصحاب النبي صلى الله عليه وسلم خرجا من عند النبي صلى الله عليه وسلم، في ليلة مظلمة ومعهما مثل المصباحين بين أيديهما، فلما افترقا، صار مع كل واحد منهما واحد حتى أتى أهله‏.‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏ من طرق، وفي بعضها أن الرجلين أسيد بن حضير، وعباد بن بشر رضي الله عنهما‏.‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1508
    },
    {
      "hadithNumber": 1509,
      "english": {
        "narrated": "Abu Hurairah (May Allah be pleased with him) reported:",
        "hadith": "The Messenger of Allah (ﷺ) sent an espionage mission of ten men under the leadership of 'Asim bin Thabit Al-Ansari (May Allah be pleased with him). They proceeded till they reached Al-Had'ah, a place between 'Usfan and Makkah and the news of their arrival reached a section of the tribe of Hudhail, called Banu Lihyan. About one hundred men, who were all archers, hurried to follow their tracks. When 'A sim and his companions came to know of their pursuers, they took refuge in a safe place. The infidels encircled them and said to them: \"Come down and surrender, and we promise and guarantee you that we will not kill anyone of you.\" 'Asim bin Thabit (May Allah be pleased with him) said: \"By Allah! I will not come down to be under the protection of disbelievers. O Allah! convey this news to our Prophet (ﷺ).\" Then the infidels shot arrows at them till they killed 'Asim. Three men came down relying on their promise and covenant. They were Khubaib, Zaid bin Ad-Dathinah and another man. When the disbelievers captured them, they tied them up with the strings of their bows. The third of the captives said: \"This is the beginning of first betrayal. By Allah! I will not go with you. I have a good example in these (martyrs).\" So they dragged him and tried to compel him to accompany them, but he refused. At last they killed him. They took Khubaib and Zaid bin Ad- Dathina with them and sold them as slaves in Makkah. This incident took place after the battle of Badr.Khubaib was bought by the sons of Al-Harith bin 'Amir bin Naufal bin 'Abd Manaf. It was Khubaib who had killed Al-Harith in the battle of Badr. Khubaib remained a prisoner with those people for a few days till the sons of Al-Harith resolved to kill him.When Khubaib (May Allah be pleased with him) got wind of this plot, he borrowed a razor from one of Al- Harith's daughters in order to remove his pubic hair. Her little son crawled towards Khubaib because of her carelessness. Later on, she saw her son on his thigh and the razor was in his hand. She got scared so much that Khubaib noticed the agitation on her face and said: \"Are you afraid that I will kill him? No, I will never do that.\" She later remarked (after Al-Khubaib got martyred): \"By Allah! I never saw a prisoner better than Khubaib.\" She added: \"By Allah! I saw him once eating of a bunch of grapes in his hand while he was chained and there was no such fruit at that time in Makkah. Probably it was a boon which Allah bestowed upon Khubaib.\"When they took him out of the Haram of Makkah to kill him outside its boundaries, Khubaib requested them to let him offer two Rak'ah of voluntary prayer. They allowed him and he offered two Rak'ah prayer. Then he said: \"Had I not apprehended that you would think that I was afraid of death, I would have prolonged the prayer. O Allah! Count their number; slay them one by one and spare not one of them.\" He then recited these poetic verses:'I do not care how they kill me as long as I get martyred in the Cause of Allah as a Muslim. I received my death for Allah's sake. If Allah so desires, He will bless, the amputated limbs of the torn body.'Then the son of Al-Harith killed him. It was Khubaib who set the tradition for any Muslim sentenced to death in captivity to offer two Rak'ah of voluntary prayer. On that day the Messenger of Allah (ﷺ) informed his Companions of the martyrdom of Khubaib. Later on, when some disbelievers from Quraish were informed that 'Asim had been martyred, they sent some people to fetch a significant part of his body to ascertain his death. (This was because) 'Asim had killed one of their chiefs. So Allah sent a swarm of wasps, resembling a shady cloud, to hover over the body of 'Asim and to shield him from their messengers, and thus they could not cut off anything from his body.[Al- Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "\"‏اقتلهم بَِددًا‏\"",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1509
    },
    {
      "hadithNumber": 1510,
      "english": {
        "narrated": "Ibn 'Umar (May Allah be pleased with them) reported:",
        "hadith": "I never heard 'Umar (May Allah be pleased with him) relating anything that he conceived it to be so-and-so, but that it proved to be as he had conceived it.\"[Al-Bukhari].",
        "grade": ""
      },
      "arabic": {
        "narrated": "",
        "hadith": "وعن ابن عمر رضي الله عنهما قال‏:‏ ما سمعت عمر رضي الله عنه يقول لشيء قط‏:‏ إني لأظنه كذا إلا كان كما يظن‏.‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏",
        "grade": ""
      },
      "collectionId": "riyadussalihin",
      "bookId": 16,
      "bookName": "16The Book of Du'a (Supplications)كتاب الدعوات",
      "bookReference": 1510
    }
  ]
}